{
  "digitalTwinScoringFramework": {
    "version": "1.0",
    "description": "Complete scoring logic for Digital Twin Career Assessment - 10 dimensions × 10 options (a-j)",
    "lastUpdated": "2025-11-24",
    "questions": [
      {
        "questionId": 1,
        "theme": "Identity & Purpose Alignment",
        "question": "How connected do you feel to your deeper purpose through your current professional role?",
        "indexName": "Identity–Purpose Alignment Index (IPA Index)",
        "scoreType": "Readiness Score",
        "measure": "Measures how deeply work aligns with your inner purpose & evolving identity.",
        "scoringOptions": [
          {
            "option": "a",
            "score": 100,
            "text": "I feel deeply aligned — my work expresses who I am becoming.",
            "depiction": "Your work and purpose move as one — rare alignment.",
            "title": "Your Inner Compass: The Power of Being in Alignment",
            "archetype": "The Aligned Visionary",
            "keyInsight": "Your response reflects a rare and powerful Identity Emotional Story — the story of someone whose work and inner self are finally speaking the same language. This level of alignment does not happen by accident; it is a signal that your values, talents, and personal evolution are moving in the same direction. The Purpose Alignment Root Cause behind this is clarity: you know what you stand for, and your work is becoming a natural extension of that truth. It also indicates emotional maturity and deep self-awareness — you've done the inner work required to recognise what feels right and what doesn't.\n\nBut even in alignment, there is always a Growth Blocker hidden in the corners. For you, it is not misalignment — it is complacency. People who feel aligned often forget to stretch further. The danger is not confusion; it is settling for \"good\" when \"extraordinary\" is possible. Yet your Inner Compass Strength is exceptional — you have a strong intuitive radar that knows when something is right for your evolution. This intuition allows you to make bold decisions that others are afraid to make.\n\nBeneath this sits an Identity-Based Hidden Desire: you don't just want alignment — you want expansion. You want to shape something larger than yourself, express your uniqueness at scale, and build a legacy beyond daily work. Your Purpose-Driven Future Self is someone who leads with clarity, inspires with authenticity, and stands out because your identity and impact are inseparable.\n\nYour Identity Archetype is \"The Aligned Visionary\" — someone who grows not from force, but from inner truth. To strengthen this alignment, follow your Identity Reset Micro-Actions:\n\nNext 24 hours: Write a one-line statement about who you are becoming — and ensure it feels alive.\n\nNext 7 days: Identify one part of your work that deserves a bigger spotlight or bolder expression.\n\nNext 30 days: Begin integrating a new behaviour, project, or ritual that expands your identity, not just maintains it.\n\nYour Identity Fit Index indicates a high alignment, but not a destination — a launchpad. Your role supports your identity today, but your future self will require more influence, more creativity, and a wider stage. Finally, the Digital Twin (Identity Edition) whispers a gentle truth: \"You're on the right path — but the next version of you is waiting for a bigger canvas.\"",
            "growthBlocker": "Complacency - settling for good when extraordinary is possible",
            "hiddenStrength": "Strong intuitive radar that knows when something is right",
            "hiddenDesire": "Expansion - shape something larger, express uniqueness at scale",
            "futureArchetype": "Leader who leads with clarity, inspires with authenticity",
            "microActions": {
              "hours24": "Write a one-line statement about who you are becoming — and ensure it feels alive.",
              "days7": "Identify one part of your work that deserves a bigger spotlight or bolder expression.",
              "days30": "Begin integrating a new behaviour, project, or ritual that expands your identity, not just maintains it."
            }
          },
          {
            "option": "b",
            "score": 90,
            "text": "I feel meaning occasionally, but it's inconsistent or fragile.",            
            "depiction": "You feel meaning, but it flickers instead of flowing.",
            "title": "Your Identity Signal: Meaning Exists, But It Needs Strengthening",
            "archetype": "The Awakening Integrator",
            "keyInsight": "Your choice reflects an Identity Emotional Story of partial alignment — moments where your work feels meaningful, but the connection doesn't hold long enough. The Purpose Alignment Root Cause here is inconsistency: your identity finds expression occasionally, but the environment or the role doesn't support it continuously. The main Identity-Level Growth Blocker is fragmentation — a life lived in pockets of meaning rather than a steady rhythm of alignment. Yet there is a powerful Inner Compass Strength beneath this: you recognise when something feels meaningful, and that awareness is your advantage.\n\nThe Identity-Based Hidden Desire behind this choice is stability — you want your work to reflect your identity more consistently, not in scattered moments. Your Purpose-Driven Future Self is someone who builds a life where meaning is the baseline, not the exception. Your Identity Archetype here is \"The Awakening Integrator\" — someone who is starting to merge their inner truth with the outer world.\n\nTo strengthen alignment, follow these Identity Reset Micro-Actions:\n\n24 hours: Identify one moment this week where you felt most \"yourself.\"\n\n7 days: Pinpoint what created that meaning and how to repeat it.\n\n30 days: Integrate one aligned behaviour or responsibility into your weekly rhythm.\n\nYour Identity Fit Index shows moderate alignment but high potential for improvement. The Digital Twin reflects:\n\"Your moments of meaning are signals — not accidents. Build around them.\"",
            "growthBlocker": "Fragmentation - life lived in pockets of meaning rather than steady rhythm",
            "hiddenStrength": "You recognise when something feels meaningful",
            "hiddenDesire": "Stability - work to reflect identity consistently, not in scattered moments",
            "futureArchetype": "Someone who builds a life where meaning is the baseline",
            "microActions": {
              "hours24": "Identify one moment this week where you felt most yourself.",
              "days7": "Pinpoint what created that meaning and how to repeat it.",
              "days30": "Integrate one aligned behaviour or responsibility into your weekly rhythm."
            }
          },
          {
            "option": "c",
            "score": 80,
            "text": "I like what I do, but I'm not sure it reflects my deeper purpose.",
            "depiction": "You enjoy the work, but your deeper purpose hasn't joined the conversation yet.",
            "title": "The Identity Gap: When Liking Your Work Isn't the Same as Living Your Purpose",
            "archetype": "The Quiet Seeker",
            "keyInsight": "This response carries an Identity Emotional Story rooted in comfort without fulfilment. You appreciate what you do, but something in your inner world knows there is more. The Purpose Alignment Root Cause is the mild disconnect between liking a role and being expressed by a role. Your Identity-Level Growth Blocker is \"functional satisfaction\" — the kind of comfort that slows deeper transformation. However, you possess a strong Inner Compass Strength: you can sense misalignment even when things are \"good,\" and that awareness is the seed of identity evolution.\n\nYour Identity-Based Hidden Desire is depth — you want work that expresses something core, something meaningful, something only you can bring. Your Purpose-Driven Future Self is someone whose contribution feels personal, not just professional. Your Identity Archetype is \"The Quiet Seeker,\" someone who is ready for inner clarity before taking bigger steps.\n\nTo bridge the identity gap, implement these Identity Reset Micro-Actions:\n\n24 hours: Reflect on one thing your soul wishes you could express more.\n\n7 days: Identify where your current work allows even a small piece of your deeper self to show.\n\n30 days: Add or request one activity that aligns with your inner purpose.\n\nYour Identity Fit Index shows \"acceptable fit\" but not \"true alignment.\"\nThe Digital Twin whispers:\n\"Liking is fine… but you're meant for something that feels like truth.\"",
            "growthBlocker": "Functional satisfaction - the kind of comfort that slows deeper transformation",
            "hiddenStrength": "You can sense misalignment even when things are good",
            "hiddenDesire": "Depth - work that expresses something core, meaningful, something only you can bring",
            "futureArchetype": "Someone whose contribution feels personal, not just professional",
            "microActions": {
              "hours24": "Reflect on one thing your soul wishes you could express more.",
              "days7": "Identify where your current work allows even a small piece of your deeper self to show.",
              "days30": "Add or request one activity that aligns with your inner purpose."
            }
          },
          {
            "option": "d",
            "score": 70,
            "text": "I've grown detached — it feels like I'm on autopilot most days.",
            "depiction": "You're functioning, but your identity is asleep at the wheel.",
            "title": "The Identity Numbness: When Your Inner Self Goes Quiet",
            "archetype": "The Disconnected Wanderer",
            "keyInsight": "Your response reveals an Identity Emotional Story marked by numbness — a sense of moving through your days without true presence. The Purpose Alignment Root Cause here is emotional detachment: your inner self is no longer participating in your work, even if your outer self continues to function. This leads to a deep Identity-Level Growth Blocker: identity drift, where the gap between who you are and what you do widens slowly but steadily. And yet, your Inner Compass Strength is still active; detachment itself is a signal. It is your identity's way of telling you, \"This is not feeding me anymore.\"\n\nYour Identity-Based Hidden Desire is awakening — you want to feel alive again, to reconnect with something that holds emotional and personal meaning. Your Purpose-Driven Future Self is someone who works with intention, presence, and emotional involvement rather than autopilot execution. Your Identity Archetype here is \"The Disconnected Wanderer,\" someone whose next chapter begins with re-sensing themselves.\n\nYour Identity Reset Micro-Actions will help you reawaken:\n\n24 hours: Do one task today with full presence — no rush, no autopilot.\n\n7 days: Identify what part of your work you feel most emotionally absent from.\n\n30 days: Introduce or revive one activity that feels emotionally meaningful, even if small.\n\nYour Identity Fit Index indicates a low alignment, but high potential if you recalibrate.\nThe Digital Twin reflects:\n\"Your detachment is not a flaw — it is a message. You're meant to reawaken.\"",
            "growthBlocker": "Identity drift - the gap between who you are and what you do widens slowly",
            "hiddenStrength": "Detachment itself is a signal - your identity's way of saying this doesn't feed me",
            "hiddenDesire": "Awakening - you want to feel alive again, reconnect with meaningful work",
            "futureArchetype": "Someone who works with intention, presence, and emotional involvement",
            "microActions": {
              "hours24": "Do one task today with full presence — no rush, no autopilot.",
              "days7": "Identify what part of your work you feel most emotionally absent from.",
              "days30": "Introduce or revive one activity that feels emotionally meaningful, even if small."
            }
          },
          {
            "option": "e",
            "score": 60,
            "text": "My purpose is clear, but my work does not support it yet.",
            "depiction": "Your purpose is clear — your work simply hasn't caught up yet.",
            "title": "The Identity Tension: When Your Purpose is Ready but Your Environment Isn't",
            "archetype": "The Unexpressed Visionary",
            "keyInsight": "This choice embodies an Identity Emotional Story of clarity without expression. You know who you are becoming, but your current role does not yet provide the space to express that truth. The Purpose Alignment Root Cause is structural mismatch — your internal evolution has outpaced the external environment. The resulting Identity-Level Growth Blocker is frustration: the sense of holding back your potential because the current container is too small.\n\nYet, your Inner Compass Strength is exceptional — clarity of purpose is one of the strongest indicators of future leadership. Your Identity-Based Hidden Desire is amplification: you want an environment that matches your ambition, aligns with your values, and honours your purpose. Your Purpose-Driven Future Self is someone who leads with intention and expresses their identity through high-impact work. Your Identity Archetype is \"The Unexpressed Visionary\" — someone whose next chapter requires a bigger playing field.\n\nYour Identity Reset Micro-Actions can accelerate this transition:\n\n24 hours: Write down your purpose in a single sentence — keep it visible.\n\n7 days: Identify one area of your current work where your purpose can be expressed, even partially.\n\n30 days: Begin aligning your external ecosystem — conversations, roles, or projects — with your internal purpose.\n\nYour Identity Fit Index currently sits at \"purpose-high, role-low.\"\nThe Digital Twin says:\n\"Your purpose is not waiting — your environment is. It's time to expand.\"",
            "growthBlocker": "Structural mismatch - internal evolution has outpaced external environment",
            "hiddenStrength": "Clarity of purpose - one of the strongest indicators of future leadership",
            "hiddenDesire": "Amplification - environment that matches ambition, aligns with values, honours purpose",
            "futureArchetype": "Someone who leads with intention and expresses identity through high-impact work",
            "microActions": {
              "hours24": "Write down your purpose in a single sentence — keep it visible.",
              "days7": "Identify one area of your current work where your purpose can be expressed, even partially.",
              "days30": "Begin aligning your external ecosystem — conversations, roles, projects — with your internal purpose."
            }
          },
          {
            "option": "f",
            "score": 50,
            "text": "I sense an emerging purpose, but I can't articulate it fully.",
            "depiction": "You sense a calling forming beneath the surface, waiting to be articulated.",
            "title": "The Identity Emergence: When Your Next Purpose Is Still Forming",
            "archetype": "The Emerging Pathfinder",
            "keyInsight": "Your response tells an Identity Emotional Story of quiet transformation — a purpose that is forming beneath the surface, not yet fully shaped, but undeniably present. The Purpose Alignment Root Cause is emergence: your identity is evolving faster than your language or clarity. The major Identity-Level Growth Blocker is uncertainty — not the bad kind, but the fertile kind that precedes breakthroughs. Your Inner Compass Strength is intuition; you can feel the shift even before it becomes rational.\n\nYour Identity-Based Hidden Desire is direction — you want your purpose to come into focus, to name it, understand it, and integrate it into your work. Your Purpose-Driven Future Self is someone who finds clarity through experimentation, exploration, and exposure to new ideas. Your Identity Archetype is \"The Emerging Pathfinder\" — a seeker in motion, evolving through curiosity.\n\nYour Identity Reset Micro-Actions will help this emerging purpose reveal itself:\n\n24 hours: Notice what topics or conversations spark you unexpectedly.\n\n7 days: Document patterns in what energizes you and what drains you.\n\n30 days: Begin a small exploration project (learning, mentoring, experimenting) to test your emerging purpose.\n\nYour Identity Fit Index shows moderate alignment, but high potential as clarity develops.\nThe Digital Twin offers reassurance:\n\"Your purpose is not missing — it is unfolding. Stay curious.\"",
            "growthBlocker": "Uncertainty - fertile kind that precedes breakthroughs",
            "hiddenStrength": "Intuition - you can feel the shift even before it becomes rational",
            "hiddenDesire": "Direction - you want your purpose to come into focus, to name and integrate it",
            "futureArchetype": "Someone who finds clarity through experimentation, exploration, exposure",
            "microActions": {
              "hours24": "Notice what topics or conversations spark you unexpectedly.",
              "days7": "Document patterns in what energizes you and what drains you.",
              "days30": "Begin a small exploration project (learning, mentoring, experimenting) to test your emerging purpose."
            }
          },
          {
            "option": "g",
            "score": 40,
            "text": "I'm questioning everything — my identity, values, direction.",
            "depiction": "You're questioning everything — a powerful sign of deeper truth emerging.",
            "title": "The Identity Disruption: When Questioning Becomes the Beginning",
            "archetype": "The Identity Rebuilder",
            "keyInsight": "Your answer reveals an intense Identity Emotional Story — one where the old version of you no longer fits, and the new version has not yet fully formed. The Purpose Alignment Root Cause here is disruption: your inner system is recalibrating, pulling you out of certainty so you can reshape your identity. Your major Identity-Level Growth Blocker is overwhelm; when too many identity layers shift at once, clarity gets clouded. Yet your Inner Compass Strength is awakening — questioning is not confusion; it is awareness. People who question deeply are the ones who evolve the most profoundly.\n\nYour Identity-Based Hidden Desire is truth — a desire to know who you are without conditioning, expectation, or inherited identity roles. Your Purpose-Driven Future Self is someone grounded, self-defined, and internally anchored. Your Identity Archetype is \"The Identity Rebuilder,\" someone who breaks old containers to grow a more authentic self.\n\nSupport this transition with Identity Reset Micro-Actions:\n\n24 hours: Write down the top 3 things you are no longer willing to tolerate from your old identity.\n\n7 days: Describe moments where you felt like your \"true self\"—notice patterns.\n\n30 days: Begin removing one identity-layer you've outgrown (role, behaviour, expectation, or belief).\n\nYour Identity Fit Index shows a mismatch — but this mismatch is the starting point of reinvention.\nThe Digital Twin whispers:\n\"Questioning is not a crisis. It is your evolution calling.\"",
            "growthBlocker": "Overwhelm - when too many identity layers shift at once, clarity gets clouded",
            "hiddenStrength": "Awakening - questioning is not confusion, it is awareness",
            "hiddenDesire": "Truth - a desire to know who you are without conditioning or expectation",
            "futureArchetype": "Someone grounded, self-defined, internally anchored",
            "microActions": {
              "hours24": "Write down the top 3 things you are no longer willing to tolerate from your old identity.",
              "days7": "Describe moments where you felt like your true self—notice patterns.",
              "days30": "Begin removing one identity-layer you've outgrown (role, behaviour, expectation, belief)."
            }
          },
          {
            "option": "h",
            "score": 30,
            "text": "I feel stuck in a role that no longer fits who I'm becoming.",
            "depiction": "You're outgrowing a role that no longer matches who you're becoming.",
            "title": "The Identity Mismatch: When You've Outgrown Your Role",
            "archetype": "The Outgrowing Architect",
            "keyInsight": "Your response reveals a clear Identity Emotional Story of containment — a sense of being too big for the box you're currently in. The Purpose Alignment Root Cause is identity evolution: you're growing, but your role is static. The central Identity-Level Growth Blocker is misfit — your outer responsibilities no longer match your inner capabilities or aspirations. Yet the Inner Compass Strength you possess is growth-awareness; you're not numb — you can feel the misalignment sharply, and that is powerful.\n\nYour Identity-Based Hidden Desire is expansion — a desire for a role that reflects your emerging self, not your past self. Your Purpose-Driven Future Self is someone who steps into larger responsibilities, deeper meaning, or higher influence. Your Identity Archetype is \"The Outgrowing Architect,\" someone whose identity has evolved faster than their environment.\n\nUse these Identity Reset Micro-Actions to initiate movement:\n\n24 hours: List one responsibility you've outgrown and one you want to grow into.\n\n7 days: Identify the environments where your emerging identity fits better.\n\n30 days: Initiate a role redesign conversation or begin pursuing opportunities aligned with your new identity.\n\nYour Identity Fit Index indicates a low match between who you are becoming and where you currently are.\nThe Digital Twin reflects:\n\"You are not stuck — your identity has simply outgrown the space.\"",
            "growthBlocker": "Misfit - outer responsibilities no longer match inner capabilities or aspirations",
            "hiddenStrength": "Growth-awareness - you can feel the misalignment sharply",
            "hiddenDesire": "Expansion - a role that reflects your emerging self, not your past self",
            "futureArchetype": "Someone who steps into larger responsibilities, deeper meaning, higher influence",
            "microActions": {
              "hours24": "List one responsibility you've outgrown and one you want to grow into.",
              "days7": "Identify the environments where your emerging identity fits better.",
              "days30": "Initiate a role redesign conversation or begin pursuing opportunities aligned with new identity."
            }
          },
          {
            "option": "i",
            "score": 20,
            "text": "I don't know my purpose, but I feel a pull toward something new.",
            "depiction": "You don't know the purpose yet, but something is pulling you forward.",
            "title": "The Identity Pull: When Something New Calls Before You Know Its Name",
            "archetype": "The Emerging Explorer",
            "keyInsight": "Your answer illustrates an Identity Emotional Story of curiosity mixed with uncertainty. The Purpose Alignment Root Cause is inner stirring — a shift happening at a subconscious level before it becomes conscious. The Identity-Level Growth Blocker is lack of direction, not lack of potential; you sense movement, but cannot yet define it. Yet your Inner Compass Strength is undeniable — you feel the \"pull\" even without seeing the destination, which means your identity is alive and signalling.\n\nYour Identity-Based Hidden Desire is exploration — a desire to discover what's next rather than commit prematurely. Your Purpose-Driven Future Self is someone who uncovers clarity through action, experimentation, and exposure. Your Identity Archetype is \"The Emerging Explorer,\" someone who follows the pull, not the map.\n\nClarify your identity with Identity Reset Micro-Actions:\n\n24 hours: Write down what you feel pulled away from — clarity often begins there.\n\n7 days: Experiment with one new idea, project, or domain to test the pull.\n\n30 days: Begin documenting identity patterns that show up repeatedly — themes emerge long before purpose names itself.\n\nYour Identity Fit Index shows \"clarity-low, intuition-high,\" a combination that leads to breakthroughs.\nThe Digital Twin affirms:\n\"You don't need to know the destination. You just need to honour the pull.\"",
            "growthBlocker": "Lack of direction - you sense movement, but cannot yet define it",
            "hiddenStrength": "You feel the pull even without seeing destination - your identity is alive",
            "hiddenDesire": "Exploration - discover what's next rather than commit prematurely",
            "futureArchetype": "Someone who uncovers clarity through action, experimentation, exposure",
            "microActions": {
              "hours24": "Write down what you feel pulled away from — clarity often begins there.",
              "days7": "Experiment with one new idea, project, or domain to test the pull.",
              "days30": "Begin documenting identity patterns that show up repeatedly — themes emerge."
            }
          },
          {
            "option": "j",
            "score": 10,
            "text": "I'm reinventing myself and searching for a more meaningful identity.",
            "depiction": "You're shedding an old identity and searching for the one that fits your next life chapter.",
            "title": "The Identity Rebirth: You're Actively Becoming Someone New",
            "archetype": "The Conscious Reconstructor",
            "keyInsight": "Your response expresses an Identity Emotional Story of active reinvention — you're not stuck, lost, or confused; you're reconstructing yourself with intention. The Purpose Alignment Root Cause is conscious evolution: you've recognised that your former self has served its purpose, and a more meaningful identity is ready to be shaped. The Identity-Level Growth Blocker here is not resistance but redefinition fatigue — shaping a new identity requires emotional and cognitive energy. Yet your Inner Compass Strength is powerful intentionality; you're choosing who you want to become, not waiting for circumstances to decide.\n\nYour Identity-Based Hidden Desire is meaningful reinvention — an identity that resonates deeply rather than superficially. Your Purpose-Driven Future Self is someone grounded, intentional, expressive, and purpose-led. Your Identity Archetype is \"The Conscious Reconstructor,\" someone who builds a life from awareness, not autopilot.\n\nStrengthen your reinvention with Identity Reset Micro-Actions:\n\n24 hours: Define one trait your \"next self\" must embody.\n\n7 days: Engage in an activity or decision that reflects that new identity trait.\n\n30 days: Start eliminating one behaviour or belief that belongs to your old identity.\n\nYour Identity Fit Index shows you are in a transition phase — not misaligned, but actively reshaping.\nThe Digital Twin whispers:\n\"You're not finding yourself. You're building yourself.\"",
            "growthBlocker": "Redefinition fatigue - shaping a new identity requires emotional and cognitive energy",
            "hiddenStrength": "Powerful intentionality - you're choosing who you want to become",
            "hiddenDesire": "Meaningful reinvention - an identity that resonates deeply rather than superficially",
            "futureArchetype": "Someone grounded, intentional, expressive, purpose-led",
            "microActions": {
              "hours24": "Define one trait your next self must embody.",
              "days7": "Engage in an activity or decision that reflects that new identity trait.",
              "days30": "Start eliminating one behaviour or belief that belongs to your old identity."
            }
          }
        ]
      },
      {
        "questionId": 2,
        "theme": "Flow & Strength Expression",
        "question": "When do you most experience flow or 'lose track of time' while working?",
        "indexName": "Flow State Access Index (FSA Index)",
        "scoreType": "Strength Expression Score",
        "measure": "Measures how consistently and powerfully you access flow through natural strengths.",
        "scoringOptions": [
          {"option": "a", "score": 100, "text": "When solving problems that stretch me intellectually.", "depiction": "Your mind comes alive when a challenge stretches your intelligence.", "title": "Your Cognitive Edge: The Power of Deep Problem-Solving Flow", "archetype": "The Analytical Solver", "keyInsight": "Your response tells a Flow Emotional Story of mental expansion — the feeling of being fully alive when a challenge requires depth, logic, and intellectual stretch. The Strength Activation Pattern here is analytical depth; your mind thrives when pushed beyond comfort. Your main Strength Blocker is likely shallow work, repetitive tasks, or environments that value speed over depth. But beneath this is your Signature Hidden Strength: you are a deep thinker, someone who naturally moves toward complexity and clarity.\n\nYour Strength Desire is mastery — the satisfaction of cracking tough problems and understanding systems at a fundamental level. Your Flow-Based Future Self is someone who leads through expertise, logic, insight, and strategic clarity. Your Strength Archetype is \"The Analytical Solver,\" a mind that thrives in intellectually demanding environments.\n\nFollow these Productivity Micro-Actions to enhance your cognitive flow:\n\n24 hours: Protect 30 minutes for uninterrupted deep thinking.\n\n7 days: Identify your highest-complexity task and work on it during peak energy.\n\n30 days: Redesign one part of your workflow to include regular deep-work blocks.\n\nYour Strength Fit Index indicates strong suitability for roles where reasoning, analysis, and problem-solving are central.\nThe Digital Twin (Strength Edition) affirms:\n\"Your mind grows through complexity — give it bigger problems.\"", "growthBlocker": "Shallow work", "hiddenStrength": "Deep thinking and natural movement toward complexity", "hiddenDesire": "Mastery", "futureArchetype": "Someone who leads through expertise, logic, insight, and strategic clarity", "microActions": {"hours24": "Protect 30 minutes for uninterrupted deep thinking", "days7": "Identify your highest-complexity task and work on it during peak energy", "days30": "Redesign one part of your workflow to include regular deep-work blocks"}},
          {"option": "b", "score": 90, "text": "When I'm creating, building, or designing something new.", "depiction": "You enter deep flow when you're building or designing something new.", "title": "Your Creative Engine: Innovation Is Your Natural State", "archetype": "The Creative Builder", "keyInsight": "Your choice reveals a Flow Emotional Story of creative ignition — you enter flow when imagination and structure meet to form something new. The Strength Activation Pattern here is creative synthesis: the ability to turn ideas into tangible output. Your Strength Blocker is routine; anything too predictable will dim your creative energy. Yet your Signature Hidden Strength is your creator's mind — the ability to build, design, innovate, and give shape to insights.\n\nYour Strength Desire is expression — the joy of seeing your ideas come alive. Your Flow-Based Future Self is someone who leads through originality and bold thinking. The Strength Archetype is \"The Creative Builder,\" someone who thrives where ideas meet action.\n\nEnhance your flow with these Productivity Micro-Actions:\n\n24 hours: Start or sketch one creative idea — even a small one.\n\n7 days: Dedicate a creative block (no pressure, just exploration).\n\n30 days: Begin a mini-project that embodies your creative identity.\n\nYour Strength Fit Index signals strong alignment with roles involving design, innovation, creation, storytelling, or product building.\nThe Digital Twin whispers:\n\"Your ideas don't want permission — they want expression.\"", "growthBlocker": "Routine and predictability", "hiddenStrength": "Creator's mind with ability to build and innovate", "hiddenDesire": "Expression", "futureArchetype": "Someone who leads through originality and bold thinking", "microActions": {"hours24": "Start or sketch one creative idea — even a small one", "days7": "Dedicate a creative block (no pressure, just exploration)", "days30": "Begin a mini-project that embodies your creative identity"}},
          {"option": "c", "score": 80, "text": "When I'm helping people, coaching, or empowering others.", "depiction": "You lose track of time when you're uplifting, coaching, or enabling others.", "title": "Your Empowerment Strength: You Grow When Others Grow", "archetype": "The Empowering Guide", "keyInsight": "Your answer reveals a Flow Emotional Story shaped by connection — you feel most alive when you help others rise. The Strength Activation Pattern is relational intelligence; you enter flow through listening, guiding, and empowering. Your main Strength Blocker is environments that undervalue empathy or treat people like tasks. Yet your Signature Hidden Strength is your ability to translate insight into impact for others.\n\nYour Strength Desire is contribution — the emotional fulfilment of helping someone find clarity, confidence, or direction. Your Flow-Based Future Self is someone who becomes a trusted guide, mentor, or leader who uplifts others. Your Strength Archetype is \"The Empowering Guide.\"\n\nBoost this strength through Productivity Micro-Actions:\n\n24 hours: Offer one person a genuine moment of guidance or listening.\n\n7 days: Identify the types of people you naturally empower best.\n\n30 days: Initiate a recurring coaching, mentoring, or peer-support activity.\n\nYour Strength Fit Index shows strong suitability for leadership, coaching, HR, development roles, customer success, operations design, or any role where people transformation matters.\nYour Digital Twin reflects:\n\"Your strength grows when you lift others. Don't underestimate this gift.\"", "growthBlocker": "Environments that undervalue empathy", "hiddenStrength": "Ability to translate insight into impact for others", "hiddenDesire": "Contribution", "futureArchetype": "A trusted guide, mentor, or leader who uplifts others", "microActions": {"hours24": "Offer one person a genuine moment of guidance or listening", "days7": "Identify the types of people you naturally empower best", "days30": "Initiate a recurring coaching, mentoring, or peer-support activity"}},
          {"option": "d", "score": 70, "text": "When I'm organizing chaos and bringing clarity to complexity.", "depiction": "You thrive when you turn chaos into clarity and structure.", "title": "Your Clarity Superpower: Turning Chaos Into Order", "archetype": "The Clarity Architect", "keyInsight": "Your response reflects a unique Flow Emotional Story — the satisfaction and calm that arise when you transform confusion into coherence. The Strength Activation Pattern here is structural thinking; your mind thrives in complex, disorganized environments where others feel overwhelmed. Your biggest Strength Blocker is environments that are too orderly or rigid, leaving you with nothing to decode or simplify. Yet your Signature Hidden Strength is your natural ability to impose clarity on chaos with precision.\n\nYour Strength Desire is order — the joy of making things understandable, logical, and manageable. Your Flow-Based Future Self is someone who becomes the \"go-to\" person for strategy, structure, and simplifying complexity across systems or teams. Your Strength Archetype is \"The Clarity Architect.\"\n\nBoost your structural flow with these Productivity Micro-Actions:\n\n24 hours: Clean up one chaotic area of your workflow or inbox.\n\n7 days: Design or refine one process that removes friction.\n\n30 days: Build a simple framework or system that brings recurring clarity to a complex problem at work.\n\nYour Strength Fit Index signals strong alignment with roles in operations, strategy, consulting, project management, system design, or transformation functions.\nYour Digital Twin (Strength Edition) affirms:\n\"You bring clarity to places that fear complexity. That is your rare gift.\"", "growthBlocker": "Overly orderly or rigid environments", "hiddenStrength": "Natural ability to impose clarity on chaos with precision", "hiddenDesire": "Order", "futureArchetype": "The go-to person for strategy, structure, and simplifying complexity", "microActions": {"hours24": "Clean up one chaotic area of your workflow or inbox", "days7": "Design or refine one process that removes friction", "days30": "Build a simple framework or system that brings recurring clarity to a complex problem"}},
          {"option": "e", "score": 60, "text": "When I'm analyzing patterns, data, or systems.", "depiction": "Patterns, systems, and data unlock your strongest flow state.", "title": "Your Pattern-Mind: Seeing What Others Miss", "archetype": "The Insight Decoder", "keyInsight": "This choice reveals a Flow Emotional Story rooted in discovery — you feel most alive when uncovering insights hidden beneath the surface. The Strength Activation Pattern here is analytical pattern recognition; your mind sees connections, structures, and trends that others overlook. Your Strength Blocker is noise — tasks that demand speed instead of depth, or environments that lack access to meaningful data. Your Signature Hidden Strength is synthesizing information into clear insights.\n\nYour Strength Desire is understanding — the intellectual satisfaction of decoding how things work and why they behave the way they do. Your Flow-Based Future Self is someone who becomes highly valued for intelligent analysis and sharp insight. Your Strength Archetype is \"The Insight Decoder.\"\n\nIncrease your analytical flow using Productivity Micro-Actions:\n\n24 hours: Analyze one small pattern in your current work — numbers, behaviour, or outcomes.\n\n7 days: Build a simple dashboard, sheet, or list that tracks a meaningful pattern.\n\n30 days: Conduct a deeper analysis project that gives you a new perspective on your domain.\n\nYour Strength Fit Index aligns you with roles in analytics, systems thinking, research, product analysis, financial modeling, engineering, or data-led decision environments.\nYour Digital Twin reflects:\n\"Patterns speak to you — and you know how to listen.\"", "growthBlocker": "Noise and tasks demanding speed over depth", "hiddenStrength": "Synthesizing information into clear insights", "hiddenDesire": "Understanding", "futureArchetype": "Highly valued for intelligent analysis and sharp insight", "microActions": {"hours24": "Analyze one small pattern in your current work — numbers, behaviour, or outcomes", "days7": "Build a simple dashboard, sheet, or list that tracks a meaningful pattern", "days30": "Conduct a deeper analysis project that gives you a new perspective on your domain"}},
          {"option": "f", "score": 50, "text": "When I'm strategizing about the future or long-term direction.", "depiction": "You flow best when thinking long-term, shaping direction, and imagining futures.", "title": "Your Strategic Mind: Seeing Tomorrow Before Others Do", "archetype": "The Strategic Futurist", "keyInsight": "Your response reveals a Flow Emotional Story shaped by vision — you thrive when you look beyond today and imagine what could be. The Strength Activation Pattern here is foresight; your mind operates naturally in long-term thinking, scenario planning, and high-level strategy. Your Strength Blocker is short-termism — environments stuck in urgent tasks, reactive decisions, or lack of vision drain your flow. Yet your Signature Hidden Strength is your ability to see patterns of possibility far ahead of others.\n\nYour Strength Desire is impact — the satisfaction of shaping direction, influencing the big picture, and contributing to meaningful decisions. Your Flow-Based Future Self is someone who grows into strategic leadership or visionary roles. Your Strength Archetype is \"The Strategic Futurist.\"\n\nEnhance this strength through Productivity Micro-Actions:\n\n24 hours: Write down one long-term possibility or idea you believe in.\n\n7 days: Create a simple 6-month or 1-year vision map for one area of your work or life.\n\n30 days: Lead or initiate a strategic conversation with your team or stakeholders.\n\nYour Strength Fit Index indicates high alignment with leadership, strategy, product direction, transformation, vision-setting roles, or innovation environments.\nThe Digital Twin affirms:\n\"Your mind lives in the future — and pulls others toward it.\"", "growthBlocker": "Short-termism and reactive environments", "hiddenStrength": "Ability to see patterns of possibility far ahead of others", "hiddenDesire": "Impact", "futureArchetype": "Strategic leader or visionary role", "microActions": {"hours24": "Write down one long-term possibility or idea you believe in", "days7": "Create a simple 6-month or 1-year vision map for one area of your work or life", "days30": "Lead or initiate a strategic conversation with your team or stakeholders"}},
          {"option": "g", "score": 40, "text": "When I'm collaborating with motivated, high-energy people.", "depiction": "You enter flow when working alongside driven, high-energy people.", "title": "Your Collaboration Genius: You Rise in High-Energy Environments", "archetype": "The Collaborative Catalyst", "keyInsight": "Your choice reveals a Flow Emotional Story built around connection, shared momentum, and collective intelligence. You enter flow when surrounded by people who match your energy, ambition, and pace. The Strength Activation Pattern here is energetic synergy — your strengths expand in the presence of people who push, inspire, or challenge you. Your major Strength Blocker is misalignment: low-energy teams, pessimism, or slow-moving environments drain your natural spark. Yet your Signature Hidden Strength is catalytic influence — you elevate groups when you are aligned with the right people.\n\nYour Strength Desire is belonging with high-performing peers who ignite your enthusiasm. Your Flow-Based Future Self is someone who thrives in collaborative leadership, co-creation, team-based innovation, or high-stakes environments. Your Strength Archetype is \"The Collaborative Catalyst.\"\n\nBoost this strength with Productivity Micro-Actions:\n\n24 hours: Connect with one high-energy colleague and share ideas.\n\n7 days: Join or initiate a small group/crew that shares your ambition.\n\n30 days: Commit to a collaborative project that energizes you.\n\nYour Strength Fit Index suggests strong potential in team leadership, co-creation, partnerships, cross-functional roles, innovation pods, or any setting where collective energy matters.\nYour Digital Twin reflects:\n\"You don't just work well with energized people — you become your best self among them.\"", "growthBlocker": "Low-energy teams and misalignment", "hiddenStrength": "Catalytic influence on groups", "hiddenDesire": "Belonging with high-performing peers", "futureArchetype": "Thrives in collaborative leadership and co-creation", "microActions": {"hours24": "Connect with one high-energy colleague and share ideas", "days7": "Join or initiate a small group/crew that shares your ambition", "days30": "Commit to a collaborative project that energizes you"}},
          {"option": "h", "score": 30, "text": "When I'm working independently without interruptions.", "depiction": "Your deepest flow emerges in solitude, without interruptions.", "title": "Your Deep Independence: Flow Through Focused Solitude", "archetype": "The Independent Deep-Worker", "keyInsight": "Your response expresses a Flow Emotional Story anchored in solitude, clarity, and control over your mental space. The Strength Activation Pattern here is independent deep work — you thrive when your mind has room to concentrate without noise. Your primary Strength Blocker is interruption: meetings, distractions, and reactive demands break your concentration and weaken your strengths. Your Signature Hidden Strength is self-reliance — the ability to produce high-quality outcomes when given time, trust, and autonomy.\n\nYour Strength Desire is undisturbed focus — the satisfaction of completing meaningful work on your terms. Your Flow-Based Future Self is someone known for precision, depth, and high-quality execution. Your Strength Archetype is \"The Independent Deep-Worker.\"\n\nEnhance your flow using Productivity Micro-Actions:\n\n24 hours: Block a 45-minute uninterrupted deep-work session.\n\n7 days: Build a ritual or environment that signals focus time to others.\n\n30 days: Restructure part of your workflow to protect regular focus blocks.\n\nYour Strength Fit Index aligns you with roles involving research, writing, analysis, coding, creative production, investigation, or any domain requiring deep solo focus.\nYour Digital Twin whispers:\n\"Your best work happens in silence — honour that.\"", "growthBlocker": "Interruption and distractions", "hiddenStrength": "Self-reliance and high-quality independent work", "hiddenDesire": "Undisturbed focus", "futureArchetype": "Known for precision, depth, and high-quality execution", "microActions": {"hours24": "Block a 45-minute uninterrupted deep-work session", "days7": "Build a ritual or environment that signals focus time to others", "days30": "Restructure part of your workflow to protect regular focus blocks"}},
          {"option": "i", "score": 20, "text": "I rarely experience flow — work feels fragmented or draining.", "depiction": "Flow is rare because your work is too scattered to sustain deep concentration.", "title": "Your Flow Breakdown: When Fragmentation Blocks Your Strengths", "archetype": "The Suppressed Performer", "keyInsight": "Your selection reveals a Flow Emotional Story of fragmentation and fatigue — a lack of sustained focus or meaningful engagement in your work. The Strength Activation Pattern is currently suppressed, not missing; your environment likely forces context switching, multitasking, crisis-driven work, or unclear priorities. This creates a powerful Strength Blocker: cognitive overload. Yet your Signature Hidden Strength remains intact — it's simply buried beneath noise, chaos, or burnout.\n\nYour Strength Desire is stability — the longing for space, clarity, and rhythm so your real strengths can re-emerge. Your Flow-Based Future Self is someone who rediscovers their natural talent once freed from overwhelm. Your Strength Archetype is \"The Suppressed Performer.\"\n\nBegin restoring your flow through Productivity Micro-Actions:\n\n24 hours: Eliminate or delegate one draining micro-task.\n\n7 days: Identify your top three weekly priorities and protect them.\n\n30 days: Redesign your workflow to reduce task-switching and increase focus blocks.\n\nYour Strength Fit Index currently reads as \"obscured,\" not low — meaning your strengths exist but can't breathe in the current structure.\nYour Digital Twin gently says:\n\"Your strengths are not missing — they're suffocating. Remove the noise, and they'll return.\"", "growthBlocker": "Cognitive overload and fragmentation", "hiddenStrength": "Strengths remain intact beneath noise", "hiddenDesire": "Stability", "futureArchetype": "Performer who rediscovers strengths once freed from overwhelm", "microActions": {"hours24": "Eliminate or delegate one draining micro-task", "days7": "Identify your top three weekly priorities and protect them", "days30": "Redesign your workflow to reduce task-switching and increase focus blocks"}},
          {"option": "j", "score": 10, "text": "I don't know yet — my strengths feel undeveloped or hidden.", "depiction": "Your real strengths are still hidden — flow hasn't found its doorway yet.", "title": "Your Hidden Potential: When Strengths Are Waiting to Be Born", "archetype": "The Emerging Talent", "keyInsight": "Your answer tells a Flow Emotional Story of early-stage discovery — a sense of having potential but not yet knowing its expression. The Strength Activation Pattern is unclear, not absent, meaning your environment or experiences haven't yet revealed your natural flow zones. The main Strength Blocker is lack of exposure — without varied experiences, strengths cannot surface. Yet your Signature Hidden Strength is sensitivity to possibility; people who know their strengths are hidden are usually the ones standing at the edge of breakthrough.\n\nYour Strength Desire is exploration — a longing to experiment, try, stretch, and discover. Your Flow-Based Future Self is someone who becomes confident and centred once strengths crystallize. Your Strength Archetype is \"The Emerging Talent.\"\n\nUse these Productivity Micro-Actions to uncover your hidden strengths:\n\n24 hours: Try one new task or method, even briefly — observe what feels natural.\n\n7 days: Experiment with different roles, activities, or contexts to see what energizes you.\n\n30 days: Create a strength-discovery journal tracking what feels draining vs energizing.\n\nYour Strength Fit Index is \"unknown\"—which is far better than \"misfit,\" because unknown can evolve into anything.\nYour Digital Twin reassures:\n\"Your strengths are not invisible — they are untested. Your future self is waiting for you to explore.\"", "growthBlocker": "Lack of exposure", "hiddenStrength": "Sensitivity to possibility", "hiddenDesire": "Exploration", "futureArchetype": "Confident and centred once strengths crystallize", "microActions": {"hours24": "Try one new task or method, even briefly — observe what feels natural", "days7": "Experiment with different roles, activities, or contexts to see what energizes you", "days30": "Create a strength-discovery journal tracking what feels draining vs energizing"}}
        ]
      },
      {
        "questionId": 3,
        "theme": "Career Trajectory Perception",
        "question": "How do you perceive your current career growth trajectory?",
        "indexName": "Career Momentum Trajectory Index (CMT Index)",
        "scoreType": "Growth Momentum Score",
        "measure": "Captures the true trajectory—accelerating, plateauing, drifting, or pivot-ready.",
        "scoringOptions": [
          {"option": "a", "score": 100, "text": "Upward and accelerating — I'm gaining momentum.", "depiction": "Your trajectory is in lift-off mode — momentum is unmistakable.", "title": "Your Momentum Curve: You Are Rising Faster Than You Realize", "archetype": "The Accelerating Builder", "keyInsight": "Your choice reveals a powerful Trajectory Emotional Story — the excitement and inner certainty that come when your work starts compounding. The Growth Momentum Root Cause here is traction: you've crossed the threshold where action, feedback, and visibility are starting to build on each other. Your Growth Blocker, however, is not stagnation — it is overextension. People gaining momentum often say yes too often, diluting their acceleration. Yet beneath this lies your Signature Hidden Strength: responsiveness — you can sense what's working, absorb feedback, and adjust quickly.\n\nYour Trajectory Desire is to maximize this window of growth — this moment where the market, your skills, and your environment are all aligned. Your Momentum-Based Future Self is someone who becomes unstoppable once fully aligned. Your Trajectory Archetype is \"The Accelerating Builder,\" someone whose growth compounds when direction and energy converge.\n\nFollow these Career Momentum Micro-Actions:\n\n24 hours: Identify the one area where momentum is strongest — double down on it.\n\n7 days: Review and eliminate one non-essential task that slows your acceleration.\n\n30 days: Proactively initiate a move (project, visibility, relationship) that amplifies your current trajectory.\n\nYour Momentum Fit Index indicates high-speed growth potential.\nThe Digital Twin (Momentum Edition) affirms:\n\"You're not just growing — you're accelerating. Protect your focus.\"", "growthBlocker": "Overextension - saying yes to too much", "hiddenStrength": "Responsiveness and ability to convert feedback into action", "hiddenDesire": "Maximizing window of growth", "futureArchetype": "Someone who becomes unstoppable once aligned", "microActions": {"hours24": "Identify the one area where momentum is strongest — double down on it", "days7": "Review and eliminate one non-essential task that slows your acceleration", "days30": "Proactively initiate a move (project, visibility, relationship) that amplifies your current trajectory"}},
          {"option": "b", "score": 90, "text": "Growing steadily but not exponentially.", "depiction": "You're growing well, but not yet compounding exponentially.", "title": "Your Steady Ascent: Slow, Stable, and Full of Untapped Potential", "archetype": "The Strategic Steady-Grower", "keyInsight": "Your response reveals a calm, grounded Trajectory Emotional Story — you are growing, but at a measured pace. The Growth Momentum Root Cause here is consistency — you are progressing steadily through effort and reliability. Your Growth Blocker is not stagnation; it's the absence of stretch. Steady growth rarely becomes exponential without new challenges or higher complexity. Yet beneath this lies your Signature Hidden Strength: positive directional movement — you're advancing with consistency, discipline, and progress others can rely on.\n\nYour Trajectory Desire is evolution — you want to grow faster, not just comfortably. Your Momentum-Based Future Self is someone who blends calmness with ambition, moving with pace and clarity. Your Trajectory Archetype is \"The Strategic Steady-Grower,\" someone who thrives by upgrading the scale of challenges.\n\nAccelerate your trajectory with Career Momentum Micro-Actions:\n\n24 hours: Identify one area where you can increase difficulty or complexity.\n\n7 days: Take on a task that requires new capabilities or visibility.\n\n30 days: Initiate one growth conversation with your manager or stakeholder about expanding your responsibilities.\n\nYour Momentum Fit Index signals steady acceleration potential with the right upgrade in challenge.\nThe Digital Twin reflects:\n\"You're moving well — the next level is a decision, not a destination.\"", "growthBlocker": "Absence of stretch", "hiddenStrength": "Positive directional movement", "hiddenDesire": "Evolution", "futureArchetype": "Someone who blends calmness with ambition", "microActions": {"hours24": "Identify one area where you can increase difficulty or complexity", "days7": "Take on a task that requires new capabilities or visibility", "days30": "Initiate one growth conversation with your manager or stakeholder"}},
          {"option": "c", "score": 80, "text": "Stable, predictable, and comfortable.", "depiction": "Your path is steady and predictable — safe but not stretching.", "title": "Your Comfort Plateau: Safe but Limiting", "archetype": "The Settled Stabilizer", "keyInsight": "Your choice reveals a Trajectory Emotional Story of calm stability — a plateau that feels secure, structured, and manageable. The Growth Momentum Root Cause is consolidation: you have reached a level where things feel repeatable, predictable, and safe. Your Growth Blocker is comfort — the subtle inertia that keeps you from exploring new challenges or complexity. Yet your Signature Hidden Strength is adaptability and stability — you have mastered your current level and can handle it with ease.\n\nYour Trajectory Desire is significance and stretch — a longing for growth that feels meaningful, not just incremental. Your Momentum-Based Future Self is someone who disrupts predictability intentionally to grow into the next version of themselves. Your Trajectory Archetype is \"The Settled Stabilizer,\" someone who needs intentional disruption to catalyze growth.\n\nBreak the plateau with Career Momentum Micro-Actions:\n\n24 hours: Identify one area where you feel under-challenged.\n\n7 days: Volunteer for a task that pushes you into a new skill zone or elevates your visibility.\n\n30 days: Start a project, certification, or initiative that breaks predictability and rekindles stretch.\n\nYour Momentum Fit Index shows high competence but low tension — both are needed for growth.\nThe Digital Twin whispers:\n\"Comfort is a plateau, not a destination. Break it before it becomes a cage.\"", "growthBlocker": "Comfort — the subtle inertia that keeps you from exploring", "hiddenStrength": "Adaptability and stability", "hiddenDesire": "Significance and stretch", "futureArchetype": "Someone who needs intentional disruption to grow", "microActions": {"hours24": "Identify one area where you feel under-challenged", "days7": "Volunteer for a task that pushes you into a new skill zone", "days30": "Start a project, certification, or initiative that breaks predictability"}},
          {"option": "d", "score": 70, "text": "Growing externally, but internally I feel stagnant.", "depiction": "You're progressing on paper but not evolving within.", "title": "The Dual-Trajectory Conflict: When Your Growth Looks Good but Feels Empty", "archetype": "The Hollow Achiever", "keyInsight": "Your response reveals a powerful Trajectory Emotional Story — the tension between external success and internal stagnation. The Growth Momentum Root Cause here is misalignment: your external trajectory (title, scope, pay) is moving upward, but your internal trajectory (identity, learning, fulfilment) is stagnant. Your Growth Blocker is the disconnect between impact and fulfilment — you're achieving outcomes that don't feed your inner evolution. Yet your Signature Hidden Strength is self-awareness — you can sense the gap between external progress and internal growth, which many never recognize.\n\nYour Trajectory Desire is meaningful advancement — growth that matters to your identity, not just your résumé. Your Momentum-Based Future Self is someone who outgrows the image of success and pursues roles that align mind, impact, and meaning. Your Trajectory Archetype is \"The Hollow Achiever,\" someone whose next chapter must merge outer progress with inner depth.\n\nRealign your trajectory with Career Momentum Micro-Actions:\n\n24 hours: Identify one area where your work feels emotionally or intellectually under-stimulating.\n\n7 days: Choose one project or activity that develops you, not just your résumé.\n\n30 days: Initiate a shift toward roles or responsibilities that feel identity-aligned, not just title-driven.\n\nYour Momentum Fit Index shows external strength but internal misalignment.\nThe Digital Twin reflects:\n\"You're succeeding — but are you evolving? That's the question your soul is asking.\"", "growthBlocker": "Misalignment between impact and fulfilment", "hiddenStrength": "Self-awareness", "hiddenDesire": "Meaningful advancement", "futureArchetype": "Someone who outgrows the image of success", "microActions": {"hours24": "Identify one area where your work feels emotionally or intellectually under-stimulating", "days7": "Choose one project or activity that develops you, not just your résumé", "days30": "Initiate a shift toward roles or responsibilities that feel identity-aligned"}},
          {"option": "e", "score": 60, "text": "I'm plateauing — growth feels slower than it should.", "depiction": "You feel the slowdown — growth is happening but too slowly.", "title": "The Plateau Moment: You've Hit a Level That No Longer Stretches You", "archetype": "The Plateau Breaker", "keyInsight": "Your choice tells a clear Trajectory Emotional Story — the awareness that your momentum has slowed, even though your capability hasn't. The Growth Momentum Root Cause is opportunity limitation: the environment or structure no longer provides the challenges, visibility, or mentorship that fuel growth. Your Growth Blocker is not capability, but context — you're ready for more, but the ecosystem isn't offering it. Yet your Signature Hidden Strength is independence and capability — you can deliver at a high level even without strong external acceleration.\n\nYour Trajectory Desire is upward movement — a renewed sense of momentum, stretch, and progress. Your Momentum-Based Future Self is someone who needs a strategic push (new role, project, mentor, or environment) to rise again. Your Trajectory Archetype is \"The Plateau Breaker,\" someone who must intentionally redesign their path to resume growth.\n\nReignite momentum with Career Momentum Micro-Actions:\n\n24 hours: Identify the top 1–2 decisions where lack of guidance hurts your progress.\n\n7 days: Find a stretch opportunity (project, responsibility, skill) that excites you.\n\n30 days: Begin the repositioning process — visibility, mentorship, or role-expansion steps.\n\nYour Momentum Fit Index indicates capability above current growth opportunity.\nThe Digital Twin affirms:\n\"You haven't stopped growing — your environment has. It's time to shift your ecosystem.\"", "growthBlocker": "Opportunity limitation", "hiddenStrength": "Independence and capability", "hiddenDesire": "Upward movement", "futureArchetype": "Someone who needs a strategic push to rise again", "microActions": {"hours24": "Identify the top 1–2 decisions where lack of guidance hurts your progress", "days7": "Find a stretch opportunity (project, responsibility, skill) that excites you", "days30": "Begin the repositioning process — visibility, mentorship, or role-expansion steps"}},
          {"option": "f", "score": 50, "text": "My trajectory is unclear — I'm still finding the path.", "depiction": "The road ahead is foggy — you're still discovering the right direction.", "title": "The Exploration Phase: When Clarity Comes After Discovery", "archetype": "The Direction-Seeker", "keyInsight": "Your response reflects a gentle Trajectory Emotional Story of ambiguity mixed with possibility. The Growth Momentum Root Cause here is emergence: your path hasn't crystallized yet because you're in the discovery phase, not the execution phase. Your Growth Blocker is lack of clarity — not a weakness, but a natural state for someone whose future is still forming. Yet your Signature Hidden Strength is early-stage movement — you're exploring, testing, and staying open rather than forcing a premature path.\n\nYour Trajectory Desire is clarity — a sense of direction, purpose, and confidence in where you're heading. Your Momentum-Based Future Self is someone whose path reveals itself through exploration, not planning. Your Trajectory Archetype is \"The Direction-Seeker,\" someone who discovers clarity by moving, not waiting.\n\nAccelerate clarity with Career Momentum Micro-Actions:\n\n24 hours: Write down the top three things you don't want in your career — clarity often starts here.\n\n7 days: Explore one field, role, skill, or project that sparks curiosity.\n\n30 days: Track patterns: what energizes you vs what drains you — this reveals direction before logic does.\n\nYour Momentum Fit Index shows low clarity but high potential — clarity follows action.\nThe Digital Twin reflects:\n\"You're not lost — you're gathering data. Keep moving, and the path will form.\"", "growthBlocker": "Lack of clarity", "hiddenStrength": "Early-stage movement", "hiddenDesire": "Clarity", "futureArchetype": "Someone whose path reveals itself through exploration", "microActions": {"hours24": "Write down the top three things you don't want in your career — clarity often starts here", "days7": "Explore one field, role, skill, or project that sparks curiosity", "days30": "Track patterns: what energizes you vs what drains you — this reveals direction"}},
          {"option": "g", "score": 40, "text": "I feel misaligned — I'm growing, but in the wrong direction.", "depiction": "You're growing — but in a direction that doesn't feel like yours.", "title": "The Off-Path Acceleration: Growing Fast, But Not Where It Matters", "archetype": "The Path Realigner", "keyInsight": "Your answer reveals a sharp Trajectory Emotional Story — you are progressing, moving, achieving, but not toward the life or identity you want. The Growth Momentum Root Cause is directional misalignment: the path you're on was chosen (or inherited) at a different stage of your life, and your identity has evolved faster than your trajectory. Your Growth Blocker is not lack of momentum — it's moving quickly in a direction that no longer serves you. Yet your Signature Hidden Strength is self-awareness about misalignment; many people spend years on the wrong path without recognizing it.\n\nYour Trajectory Desire is course correction — a need to reorient toward a path that feels true to who you're becoming. Your Momentum-Based Future Self is someone who must shift direction, not speed — trading external momentum for internal alignment. Your Trajectory Archetype is \"The Path Realigner,\" someone whose next chapter requires courage to pivot.\n\nRealign your trajectory with Career Momentum Micro-Actions:\n\n24 hours: Write down the top two ways your path feels misaligned.\n\n7 days: Identify which direction does feel true — even if not fully clear yet.\n\n30 days: Begin reorienting one part of your work or ecosystem toward your authentic direction.\n\nYour Momentum Fit Index shows high speed but low alignment — both matter.\nThe Digital Twin whispers:\n\"You're not failing — you're outgrowing. The next path is calling.\"", "growthBlocker": "Directional misalignment", "hiddenStrength": "Self-awareness about misalignment", "hiddenDesire": "Course correction", "futureArchetype": "Someone who must shift direction, not speed", "microActions": {"hours24": "Write down the top two ways your path feels misaligned", "days7": "Identify which direction does feel true — even if not fully clear yet", "days30": "Begin reorienting one part of your work or ecosystem toward your authentic direction"}},
          {"option": "h", "score": 30, "text": "I've hit a wall — progress feels blocked or political.", "depiction": "You've hit a wall — politics, systems, or barriers are stalling you.", "title": "The Blocked Trajectory: When External Forces Restrict Internal Potential", "archetype": "The Barrier Breaker", "keyInsight": "Your response tells a heavy Trajectory Emotional Story — one of frustration, resistance, and invisible ceilings. The Growth Momentum Root Cause is systemic blockage: politics, organizational friction, or structural barriers are preventing your growth, regardless of your capability. Your Growth Blocker is external, not internal — you're ready to rise, but the system isn't ready to let you. Yet your Signature Hidden Strength is persistence despite barriers — you're still functioning, strategizing, and showing up even when progress feels blocked.\n\nYour Trajectory Desire is liberation — freedom from constraints that limit your potential. Your Momentum-Based Future Self is someone who must choose whether to climb over the barrier, walk around it, or find a new field entirely. Your Trajectory Archetype is \"The Barrier Breaker,\" someone whose growth requires strategic maneuvering or bold departure.\n\nNavigate blockage with Career Momentum Micro-Actions:\n\n24 hours: Identify the real source of the block — person, system, structure, or culture.\n\n7 days: Adjust your influence strategy — allies, visibility, skill amplification.\n\n30 days: Begin evaluating alternative pathways (internal shift or external move).\n\nYour Momentum Fit Index shows capability constrained by environment.\nThe Digital Twin reflects:\n\"You're not stuck — you're being held. It's time to decide: break through or break free.\"", "growthBlocker": "Systemic blockage", "hiddenStrength": "Persistence despite barriers", "hiddenDesire": "Liberation", "futureArchetype": "Someone who must choose whether to climb over or walk around", "microActions": {"hours24": "Identify the real source of the block — person, system, structure, or culture", "days7": "Adjust your influence strategy — allies, visibility, skill amplification", "days30": "Begin evaluating alternative pathways (internal shift or external move)"}},
          {"option": "i", "score": 20, "text": "I'm preparing for a major pivot, even if it's not visible yet.", "depiction": "You're preparing quietly for a major shift — the signs of reinvention have begun.", "title": "The Quiet Pivot: Your Next Chapter is Already in Motion", "archetype": "The Intentional Rebuilder", "keyInsight": "Your response reveals an exciting Trajectory Emotional Story — transition beneath the surface. The Growth Momentum Root Cause is intentional reinvention: you've recognized that your current path no longer serves your next self, and you're quietly preparing for a major shift. Your Growth Blocker is invisibility of pivot — others may not see your transformation yet, which can feel isolating or slow. Yet your Signature Hidden Strength is intentional movement — you're not reacting; you're reshaping your trajectory with awareness and purpose.\n\nYour Trajectory Desire is transformation — a complete shift in direction, identity, or impact. Your Momentum-Based Future Self is someone whose external actions catch up with internal clarity, making the pivot visible and powerful. Your Trajectory Archetype is \"The Intentional Rebuilder,\" someone who rewrites their story with courage.\n\nAccelerate your pivot with Career Momentum Micro-Actions:\n\n24 hours: Write down the one sentence describing the pivot you're preparing for.\n\n7 days: Take one visible step — learning, networking, exploring — that signals the pivot.\n\n30 days: Begin shaping your ecosystem (skills, network, identity) toward the new direction.\n\nYour Momentum Fit Index shows low current alignment but high future potential.\nThe Digital Twin affirms:\n\"You're not waiting for permission — you're building the next version in silence. Trust the process.\"", "growthBlocker": "Invisibility of pivot", "hiddenStrength": "Intentional movement", "hiddenDesire": "Transformation", "futureArchetype": "Someone whose external actions catch up with internal clarity", "microActions": {"hours24": "Write down the one sentence describing the pivot you're preparing for", "days7": "Take one visible step — learning, networking, exploring — that signals the pivot", "days30": "Begin shaping your ecosystem (skills, network, identity) toward the new direction"}},
          {"option": "j", "score": 10, "text": "I feel lost — I don't know where this path is taking me.", "depiction": "You're moving without a compass — clarity and direction need rebuilding.", "title": "The Drift Phase: When Lostness Is the First Step to Reinvention", "archetype": "The Identity Seeker", "keyInsight": "Your answer expresses a vulnerable and honest Trajectory Emotional Story — the feeling of walking through fog with no clear direction. The Growth Momentum Root Cause is drift: your path has lost clarity, whether through change, burnout, identity shift, or external disruption. Your Growth Blocker is lack of clarity — not knowing where you're going makes it hard to take confident steps. Yet your Signature Hidden Strength is that you're continuing to move despite uncertainty — showing up, functioning, and staying present even in the fog.\n\nYour Trajectory Desire is self-discovery — a longing to reconnect with purpose, direction, and meaning. Your Momentum-Based Future Self is someone whose path reveals itself through exploration, not planning — clarity comes from action, not waiting. Your Trajectory Archetype is \"The Identity Seeker,\" someone whose lostness is the fertile ground for reinvention.\n\nRebuild direction with Career Momentum Micro-Actions:\n\n24 hours: Write down what feels wrong or misaligned — clarity starts by eliminating what no longer fits.\n\n7 days: Explore three different themes, skills, or directions without pressure to commit.\n\n30 days: Observe patterns in what excites, calms, or energizes you — these form your foundation for the next path.\n\nYour Momentum Fit Index is currently undefined — but undefined is the starting point of reinvention.\nThe Digital Twin whispers:\n\"You're not lost forever — you're in the fog before the breakthrough. Keep walking.\"", "growthBlocker": "Lack of clarity", "hiddenStrength": "Continuing to move despite uncertainty", "hiddenDesire": "Self-discovery", "futureArchetype": "Someone whose path reveals itself through exploration", "microActions": {"hours24": "Write down what feels wrong or misaligned — clarity starts by eliminating what no longer fits", "days7": "Explore three different themes, skills, or directions without pressure to commit", "days30": "Observe patterns in what excites, calms, or energizes you — these form your foundation"}}
        ]
      },
      {
        "questionId": 4,
        "theme": "Emotional Relationship with Work",
        "question": "Which statement best describes your emotional relationship with work right now?",
        "indexName": "Work–Emotion Vitality Index (WEV Index)",
        "scoreType": "Emotional Health Score",
        "measure": "Measures emotional connection, energy quality, and psychological engagement with work.",
        "scoringOptions": [
          {"option": "a", "score": 100, "text": "I feel energized — work stretches me in meaningful ways.", "depiction": "Work stretches you in the right ways — emotional energy is fully alive.", "title": "Your Emotional Peak Zone: The Energy of Meaningful Stretch", "archetype": "The Energized Performer", "keyInsight": "Your response reveals a vibrant Work-Emotion Story — the sensation of being stretched in ways that feel stimulating rather than draining. The Emotional Energy Root Cause here is meaningful challenge: your work demands growth without crushing your spirit. The primary Emotion Blocker is over-stimulation — people who thrive on stretch sometimes push too hard, risking burnout through excessive ambition. Yet your Signature Hidden Strength is vitality and emotional fuel — you regenerate through challenge, not rest alone.\n\nYour Emotional Desire is mastery and continuous growth — the satisfaction of becoming sharper, faster, deeper. Your Emotion-Based Future Self is someone who thrives in high-growth environments where performance and meaning coexist. Your Emotional Archetype is \"The Energized Performer,\" someone whose energy rises when the work matters.\n\nSustain your emotional vitality with Emotional Energy Micro-Actions:\n\n24 hours: Note which activities elevate your energy — they reveal your growth zones.\n\n7 days: Protect 1–2 high-energy blocks for deep, meaningful work.\n\n30 days: Expand your role by adding a challenge that fuels your momentum without overextending.\n\nYour Emotional Fit Index indicates high alignment and vitality.\nThe Digital Twin (Emotional Edition) affirms:\n\"Your energy is your compass — follow what lights you up.\"", "growthBlocker": "Over-stimulation", "hiddenStrength": "Vitality and emotional fuel", "hiddenDesire": "Mastery and continuous growth", "futureArchetype": "Someone who thrives in high-growth environments", "microActions": {"hours24": "Note which activities elevate your energy — they reveal your growth zones", "days7": "Protect 1–2 high-energy blocks for deep, meaningful work", "days30": "Expand your role by adding a challenge that fuels your momentum"}},
          {"option": "b", "score": 90, "text": "I feel engaged but wish my emotional connection was deeper.", "depiction": "You're invested, but you crave a deeper emotional resonance with your work.", "title": "The Half-Full Engagement: Present, But Not Fully Alive", "archetype": "The Under-Connected Achiever", "keyInsight": "Your answer reflects a subtle Work-Emotion Story — you are involved, committed, and attentive, but something deeper is missing. The Emotional Energy Root Cause is partial resonance: your work engages your mind but not your heart fully. The Emotion Blocker is emotional undernourishment — you're delivering outcomes but not feeling emotionally fed by the process. Yet your Signature Hidden Strength is resilience and consistency — you show up reliably even when emotional fulfilment is incomplete.\n\nYour Emotional Desire is connection and emotional fulfilment — work that feels personally meaningful, not just professionally valid. Your Emotion-Based Future Self is someone seeking authenticity and emotional alignment in their daily contributions. Your Emotional Archetype is \"The Under-Connected Achiever,\" someone who performs well but craves deeper emotional investment.\n\nDeepen your engagement with Emotional Energy Micro-Actions:\n\n24 hours: Identify which tasks feel meaningful vs mechanical.\n\n7 days: Add emotional texture — connect with a colleague, impact story, or purpose-driven task.\n\n30 days: Initiate a shift toward responsibilities that give you a sense of emotional ownership.\n\nYour Emotional Fit Index shows functional engagement but emotional opportunity.\nThe Digital Twin reflects:\n\"You're present — but your heart is asking for more. Listen to it.\"", "growthBlocker": "Emotional undernourishment", "hiddenStrength": "Resilience and consistency", "hiddenDesire": "Connection and emotional fulfilment", "futureArchetype": "Someone seeking authenticity and emotional alignment", "microActions": {"hours24": "Identify which tasks feel meaningful vs mechanical", "days7": "Add emotional texture — connect with a colleague, impact story, or purpose-driven task", "days30": "Initiate a shift toward responsibilities that give you a sense of emotional ownership"}},
          {"option": "c", "score": 80, "text": "I feel neutral — work gets done, but it doesn't move me.", "depiction": "Work gets done, but it doesn't touch your emotional core.", "title": "The Emotional Flatline: When Work Feels Functional, Not Fulfilling", "archetype": "The Neutral Operator", "keyInsight": "Your response reveals a calm yet concerning Work-Emotion Story — work has become transactional rather than transformational. The Emotional Energy Root Cause is emotional neutrality: your work neither drains nor inspires you. The Emotion Blocker is monotony and routine — the repetition of tasks that once felt fresh but have now become predictable. Yet your Signature Hidden Strength is functional efficiency — you can deliver high-quality work even without emotional investment.\n\nYour Emotional Desire is activation and inspiration — a spark that makes work feel alive again. Your Emotion-Based Future Self is someone seeking emotional fulfillment, not just task completion. Your Emotional Archetype is \"The Neutral Operator,\" someone whose emotional engine has idled but can reignite with the right stimulus.\n\nReignite emotional engagement with Emotional Energy Micro-Actions:\n\n24 hours: Identify one part of your work that once excited you — reclaim a piece of it.\n\n7 days: Introduce a small new challenge, idea, or responsibility into your routine.\n\n30 days: Reposition your role around tasks that stimulate meaning, not just efficiency.\n\nYour Emotional Fit Index shows stability but low vitality.\nThe Digital Twin whispers:\n\"Neutral is safe, but your soul wants more. Give it permission to feel again.\"", "growthBlocker": "Monotony and routine", "hiddenStrength": "Functional efficiency", "hiddenDesire": "Activation and inspiration", "futureArchetype": "Someone seeking emotional fulfillment", "microActions": {"hours24": "Identify one part of your work that once excited you — reclaim a piece of it", "days7": "Introduce a small new challenge, idea, or responsibility into your routine", "days30": "Reposition your role around tasks that stimulate meaning, not just efficiency"}},
          {"option": "d", "score": 70, "text": "I feel emotionally distant — like I'm watching myself work.", "depiction": "You see yourself working from the outside — emotional distance is growing.", "title": "The Disconnected Self: When You Become the Observer, Not the Participant", "archetype": "The Detached Executor", "keyInsight": "Your choice reveals a profound Work-Emotion Story — one where you feel like you are performing your role rather than living it. The Emotional Energy Root Cause is identity detachment: your actions have separated from your emotional core, creating a sense of watching yourself work rather than experiencing it. The Emotion Blocker is dissociation — a protective mechanism where emotions shut down to prevent overwhelm or burnout. Yet your Signature Hidden Strength is high functional resilience — you continue to execute even when emotionally distant.\n\nYour Emotional Desire is re-engagement and participation — a longing to feel present and emotionally invested in your work again. Your Emotion-Based Future Self is someone who feels deeply involved, emotionally connected, and present. Your Emotional Archetype is \"The Detached Executor,\" someone whose emotional engine needs reconnection.\n\nReconnect with yourself through Emotional Energy Micro-Actions:\n\n24 hours: Pause and notice when the emotional disconnect is strongest — mornings, meetings, certain tasks?\n\n7 days: Introduce one emotionally meaningful activity into your workflow — storytelling, mentoring, creativity.\n\n30 days: Realign your responsibilities to include tasks that engage your emotional identity.\n\nYour Emotional Fit Index shows functional performance but emotional distance.\nThe Digital Twin reflects:\n\"You're watching yourself live. It's time to step back inside.\"", "growthBlocker": "Identity detachment", "hiddenStrength": "High functional resilience", "hiddenDesire": "Re-engagement and participation", "futureArchetype": "Someone who feels deeply involved", "microActions": {"hours24": "Pause and notice when the emotional disconnect is strongest — mornings, meetings, certain tasks?", "days7": "Introduce one emotionally meaningful activity into your workflow — storytelling, mentoring, creativity", "days30": "Realign your responsibilities to include tasks that engage your emotional identity"}},
          {"option": "e", "score": 60, "text": "I'm productive, but I've lost joy and spark in the process.", "depiction": "Productivity is intact, but the spark has faded quietly underneath.", "title": "The Joy Drop: When Performance Continues But Passion Fades", "archetype": "The Faded Performer", "keyInsight": "Your answer reveals a bittersweet Work-Emotion Story — you are performing well, but joy has leaked out of the experience. The Emotional Energy Root Cause is joy depletion: the tasks that once excited you have become routine, mechanical, or obligation-driven. The Emotion Blocker is routine-driven burnout — not the dramatic collapse, but the slow fade of emotional vitality. Yet your Signature Hidden Strength is discipline and high performance — you deliver even when the spark dims.\n\nYour Emotional Desire is revival — a return of the joy, curiosity, and excitement that once made work feel alive. Your Emotion-Based Future Self is someone whose productivity is matched by passion, not just discipline. Your Emotional Archetype is \"The Faded Performer,\" someone who needs intentional joy restoration.\n\nRevive your spark with Emotional Energy Micro-Actions:\n\n24 hours: Identify the exact moment you felt joy last — what triggered it?\n\n7 days: Add one joy-restoring element into your work (learning, experimentation, autonomy).\n\n30 days: Rebuild part of your role around tasks that genuinely excite you.\n\nYour Emotional Fit Index shows high productivity but low emotional vitality.\nThe Digital Twin whispers:\n\"You haven't lost your spark — you've just forgotten to feed it. Reclaim your joy.\"", "growthBlocker": "Routine-driven burnout", "hiddenStrength": "Discipline and high performance", "hiddenDesire": "Revival", "futureArchetype": "Someone whose productivity is matched by passion", "microActions": {"hours24": "Identify the exact moment you felt joy last — what triggered it?", "days7": "Add one joy-restoring element into your work (learning, experimentation, autonomy)", "days30": "Rebuild part of your role around tasks that genuinely excite you"}},
          {"option": "f", "score": 50, "text": "I feel drained — not because of work, but because of constant context switching.", "depiction": "Too many shifts are draining your emotional bandwidth.", "title": "The Fragmentation Drain: When Your Brain Is Pulled in Too Many Directions", "archetype": "The Fragmented Multitasker", "keyInsight": "Your selection reveals a Work-Emotion Story dominated by cognitive overload rather than emotional disengagement. The Emotional Energy Root Cause is fragmentation: your day is broken into too many pieces, preventing sustained focus or emotional coherence. The Emotion Blocker is lack of protected focus — constant interruptions, task-switching, and scattered attention drain mental bandwidth. Yet your Signature Hidden Strength is adaptability — you can pivot quickly between contexts, even though it's exhausting.\n\nYour Emotional Desire is coherence — work that flows, focuses, and feels integrated rather than scattered. Your Emotion-Based Future Self is someone who feels mentally lighter and centred, working with depth instead of breadth. Your Emotional Archetype is \"The Fragmented Multitasker,\" someone who needs structural redesign for emotional sustainability.\n\nRestore coherence with Emotional Energy Micro-Actions:\n\n24 hours: Remove or batch one category of tasks to reduce switching.\n\n7 days: Introduce one uninterrupted block of deep focus into your week.\n\n30 days: Redesign your weekly structure for fewer transitions and more flow.\n\nYour Emotional Fit Index shows capability but structural misalignment.\nThe Digital Twin reflects:\n\"You're not weak — you're fragmented. Protect your focus, reclaim your flow.\"", "growthBlocker": "Lack of protected focus", "hiddenStrength": "Adaptability", "hiddenDesire": "Coherence", "futureArchetype": "Someone who feels mentally lighter and centred", "microActions": {"hours24": "Remove or batch one category of tasks to reduce switching", "days7": "Introduce one uninterrupted block of deep focus into your week", "days30": "Redesign your weekly structure for fewer transitions and more flow"}},
          {"option": "g", "score": 40, "text": "Work feels heavier lately — small things take more emotional effort.", "depiction": "Even small tasks are demanding more emotional energy than they should.", "title": "The Emotional Weight Build-Up: When Minor Tasks Start Feeling Major", "archetype": "The Emotional Carrier", "keyInsight": "Your answer reveals a telling Work-Emotion Story — heaviness creeping in where ease once existed. The Emotional Energy Root Cause is emotional saturation: your emotional reserves are depleted, making even minor tasks feel disproportionately draining. The Emotion Blocker is accumulated emotional weight — unresolved stress, unprocessed frustrations, or invisible burdens that compound over time. Yet your Signature Hidden Strength is perseverance — you continue functioning even under emotional heaviness.\n\nYour Emotional Desire is relief — a lightening of the emotional load so work feels manageable again. Your Emotion-Based Future Self is someone who reclaims emotional agility, responding to tasks with ease rather than heaviness. Your Emotional Archetype is \"The Emotional Carrier,\" someone who needs to offload accumulated weight.\n\nLighten your emotional load with Emotional Energy Micro-Actions:\n\n24 hours: Identify the 2–3 small tasks that drain you disproportionately.\n\n7 days: Offload, eliminate, or batch them to reduce emotional friction.\n\n30 days: Reset your workload boundaries — fewer drains, more meaningful tasks.\n\nYour Emotional Fit Index shows depletion signaling need for recovery.\nThe Digital Twin whispers:\n\"You're carrying more than you realize. It's time to put some of it down.\"", "growthBlocker": "Emotional saturation", "hiddenStrength": "Perseverance", "hiddenDesire": "Relief", "futureArchetype": "Someone who reclaims emotional agility", "microActions": {"hours24": "Identify the 2–3 small tasks that drain you disproportionately", "days7": "Offload, eliminate, or batch them to reduce emotional friction", "days30": "Reset your workload boundaries — fewer drains, more meaningful tasks"}},
          {"option": "h", "score": 30, "text": "I feel undervalued or unseen, which affects my energy.", "depiction": "Feeling undervalued is stealing your emotional vitality.", "title": "The Invisible Contributor: When Recognition Fails to Meet Effort", "archetype": "The Unseen Achiever", "keyInsight": "Your choice reveals a poignant Work-Emotion Story — you're contributing, showing up, delivering, yet the emotional reward of being seen is missing. The Emotional Energy Root Cause is recognition deficit: your effort and impact are not being acknowledged, creating emotional drain. The Emotion Blocker is invisibility — when contribution goes unnoticed, motivation and energy gradually fade. Yet your Signature Hidden Strength is commitment and contribution — you continue to deliver even without external validation.\n\nYour Emotional Desire is acknowledgement — recognition that your work matters and is valued. Your Emotion-Based Future Self is someone working in an environment where effort is recognized, valued, and celebrated. Your Emotional Archetype is \"The Unseen Achiever,\" someone whose emotional vitality depends on being seen.\n\nIncrease visibility with Emotional Energy Micro-Actions:\n\n24 hours: Identify where your contributions go unnoticed — task, team, or leadership gap.\n\n7 days: Increase visibility intentionally — document wins, share updates, speak up.\n\n30 days: Reevaluate your environment — move toward roles or ecosystems that reflect your value.\n\nYour Emotional Fit Index shows contribution without recognition — unsustainable long-term.\nThe Digital Twin reflects:\n\"You're not invisible — you're undervalued. Seek spaces that see you.\"", "growthBlocker": "Recognition deficit", "hiddenStrength": "Commitment and contribution", "hiddenDesire": "Acknowledgement", "futureArchetype": "Someone working in an environment where effort is recognized", "microActions": {"hours24": "Identify where your contributions go unnoticed — task, team, or leadership gap", "days7": "Increase visibility intentionally — document wins, share updates, speak up", "days30": "Reevaluate your environment — move toward roles or ecosystems that reflect your value"}},
          {"option": "i", "score": 20, "text": "I'm functioning, but I'm on emotional autopilot.", "depiction": "You're functioning without emotional presence — running on habit, not heart.", "title": "The Autopilot Mode: When You Work Without Feeling Alive", "archetype": "The Emotional Sleeper", "keyInsight": "Your response reveals a muted Work-Emotion Story — you're doing the work, but the emotional engine is idling. The Emotional Energy Root Cause is disengagement: your emotions have shut down to protect against monotony, disappointment, or burnout. The Emotion Blocker is habit and autopilot — functioning mechanically without emotional investment or presence. Yet your Signature Hidden Strength is discipline — you still show up and execute even when emotionally numb.\n\nYour Emotional Desire is reanimation — a return of emotional presence, feeling, and aliveness at work. Your Emotion-Based Future Self is someone who works with renewed intentionality, presence, and heart. Your Emotional Archetype is \"The Emotional Sleeper,\" someone whose emotions need awakening.\n\nReawaken emotionally with Emotional Energy Micro-Actions:\n\n24 hours: Interrupt the autopilot once — do one task consciously and mindfully.\n\n7 days: Add a new stimulus (challenge, idea, collaboration) to wake up engagement.\n\n30 days: Rebuild your role around elements that feel emotionally meaningful or exciting.\n\nYour Emotional Fit Index shows functional performance but emotional dormancy.\nThe Digital Twin whispers:\n\"You're not broken — you're asleep. It's time to wake your heart up.\"", "growthBlocker": "Habit and disengagement", "hiddenStrength": "Discipline", "hiddenDesire": "Reanimation", "futureArchetype": "Someone who works with renewed intentionality", "microActions": {"hours24": "Interrupt the autopilot once — do one task consciously and mindfully", "days7": "Add a new stimulus (challenge, idea, collaboration) to wake up engagement", "days30": "Rebuild your role around elements that feel emotionally meaningful or exciting"}},
          {"option": "j", "score": 10, "text": "I feel like I need a reset — emotionally, mentally, or directionally.", "depiction": "You've reached the threshold — your system is asking for a reset or direction shift.", "title": "The Reset Point: When Your System Asks for a New Beginning", "archetype": "The Reset Seeker", "keyInsight": "Your answer expresses a significant Work-Emotion Story — the sense that your inner system has reached saturation and is demanding renewal. The Emotional Energy Root Cause is accumulated misalignment: layers of unmet needs, suppressed frustrations, or ongoing disconnection have built up to a breaking point. The Emotion Blocker is saturation — your system can no longer absorb the current pattern without collapse. Yet your Signature Hidden Strength is awareness — recognizing you need a reset before full burnout is powerful self-knowledge.\n\nYour Emotional Desire is renewal — a complete emotional, mental, or directional reset that creates space for a new beginning. Your Emotion-Based Future Self is someone who begins a new chapter with intention and alignment, free from accumulated weight. Your Emotional Archetype is \"The Reset Seeker,\" someone whose next phase requires conscious reinvention.\n\nInitiate your reset with Emotional Energy Micro-Actions:\n\n24 hours: List the top 3 things you want to release from your current work-life.\n\n7 days: Introduce one restorative habit — reflection, solitude, new learning, digital boundaries.\n\n30 days: Begin resetting direction — shift role, routine, relationships, or priorities.\n\nYour Emotional Fit Index shows saturation signaling need for transformation.\nThe Digital Twin affirms:\n\"Your system isn't failing — it's asking for renewal. Honor that call.\"", "growthBlocker": "Accumulated misalignment", "hiddenStrength": "Awareness", "hiddenDesire": "Renewal", "futureArchetype": "Someone who begins a new chapter with intention and alignment", "microActions": {"hours24": "List the top 3 things you want to release from your current work-life", "days7": "Introduce one restorative habit — reflection, solitude, new learning, digital boundaries", "days30": "Begin resetting direction — shift role, routine, relationships, or priorities"}}
        ]
      },
      {
        "questionId": 5,
        "theme": "Energy & Workload Reality",
        "question": "How would you describe your typical weekly energy and workload experience?",
        "indexName": "Sustainable Energy Load Index (SEL Index)",
        "scoreType": "Burnout Risk Score",
        "measure": "Assesses energy rhythm, overload patterns, and burnout thresholds.",
        "scoringOptions": [
          {"option": "a", "score": 100, "text": "Balanced — I end most weeks with fuel left in the tank.", "depiction": "Your weekly rhythm is healthy — energy remains steady with room to grow.", "title": "Your Energy Equilibrium: A Rare State of Sustainable Growth", "archetype": "The Balanced Performer", "keyInsight": "Your response reflects a healthy Energy Story — you are managing your workload in a way that sustains performance without consuming your emotional reserves. The Energy Load Root Cause is strong self-regulation: you have mastered pacing, boundaries, and recovery rhythms that protect your vitality. Your Energy Blocker is complacency — balance can make you underestimate growth opportunities or forget to stretch. Yet your Signature Hidden Strength is exceptional self-awareness and energy management — you know your limits and honor them.\n\nYour Energy Desire is optimization — elevating performance while maintaining sustainable rhythms. Your Energy-Based Future Self is someone who elevates performance without sacrificing health or emotional reserves. Your Energy Archetype is \"The Balanced Performer,\" someone who models sustainable excellence.\n\nPreserve and optimize with Energy Management Micro-Actions:\n\n24 hours: Identify one ritual that currently preserves your balance — protect it.\n\n7 days: Add a small energy-positive habit (sleep window, walk, reflection time).\n\n30 days: Redesign or streamline one recurring task to reduce friction.\n\nYour Energy Fit Index shows optimal sustainability.\nThe Digital Twin affirms:\n\"You've mastered balance — now teach others and protect this gift.\"", "growthBlocker": "Complacency", "hiddenStrength": "Strong self-regulation", "hiddenDesire": "Optimization", "futureArchetype": "Someone who elevates performance without sacrificing health", "microActions": {"hours24": "Identify one ritual that currently preserves your balance — protect it", "days7": "Add a small energy-positive habit (sleep window, walk, reflection time)", "days30": "Redesign or streamline one recurring task to reduce friction"}},
          {"option": "b", "score": 90, "text": "Manageable — some weeks are heavy, but I recover well.", "depiction": "Pressure appears occasionally, but your recovery mechanisms are strong.", "title": "The Adaptive Energy Rhythm: You Bend Without Breaking", "archetype": "The Resilient Balancer", "keyInsight": "Your choice reveals an Energy Story of resilience — you experience fluctuations, but you recover quickly and maintain good emotional stability. The Energy Load Root Cause is adaptive capacity: your recovery mechanisms are strong enough to absorb periodic intensity without long-term damage. Your Energy Blocker is unpredictability — not knowing when heavy weeks will hit can create background stress. Yet your Signature Hidden Strength is elasticity and adaptability — you bend under pressure but bounce back effectively.\n\nYour Energy Desire is consistency — more predictable rhythms that reduce the need for constant recovery. Your Energy-Based Future Self is someone who maintains high performance without absorbing unnecessary volatility. Your Energy Archetype is \"The Resilient Balancer,\" someone who thrives through adaptability.\n\nStabilize your rhythm with Energy Management Micro-Actions:\n\n24 hours: List the 1–2 triggers that make some weeks heavier.\n\n7 days: Build a buffer system — batching, clearer boundaries, or planning.\n\n30 days: Restructure one demanding workflow to reduce intensity spikes.\n\nYour Energy Fit Index shows strong resilience with room for smoother pacing.\nThe Digital Twin reflects:\n\"You recover well — but you don't have to absorb so much. Smooth the spikes.\"", "growthBlocker": "Unpredictability", "hiddenStrength": "Elasticity and adaptability", "hiddenDesire": "Consistency", "futureArchetype": "Someone who maintains high performance without absorbing unnecessary volatility", "microActions": {"hours24": "List the 1–2 triggers that make some weeks heavier", "days7": "Build a buffer system — batching, clearer boundaries, or planning", "days30": "Restructure one demanding workflow to reduce intensity spikes"}},
          {"option": "c", "score": 80, "text": "Variable — energy swings depending on tasks or people.", "depiction": "Your energy swings — people and tasks significantly shape your weeks.", "title": "The Energy Oscillation Pattern: High Highs, Low Lows", "archetype": "The Sensitive High-Performer", "keyInsight": "Your response reveals a fluctuating Energy Story — your energy isn't constant; it spikes with certain tasks and drains with others. The Energy Load Root Cause is environmental sensitivity: your energy is highly responsive to people, tasks, and contexts. Your Energy Blocker is inconsistency — unpredictable energy swings make planning and sustained performance challenging. Yet your Signature Hidden Strength is self-awareness — you know what energizes and drains you, which is the foundation for better design.\n\nYour Energy Desire is stability — more consistent energy that doesn't depend on external variables. Your Energy-Based Future Self is someone who consciously selects energizing environments and tasks. Your Energy Archetype is \"The Sensitive High-Performer,\" someone who thrives when energy inputs are managed.\n\nStabilize your energy with Energy Management Micro-Actions:\n\n24 hours: Identify your biggest energy boosters and energy drainers.\n\n7 days: Reduce exposure to one energy-draining task or person.\n\n30 days: Rebuild part of your workflow around your natural energy cycles.\n\nYour Energy Fit Index shows high sensitivity requiring intentional design.\nThe Digital Twin whispers:\n\"Your energy is a signal — listen to it and design around it.\"", "growthBlocker": "Inconsistency", "hiddenStrength": "Self-awareness", "hiddenDesire": "Stability", "futureArchetype": "Someone who consciously selects energizing environments and tasks", "microActions": {"hours24": "Identify your biggest energy boosters and energy drainers", "days7": "Reduce exposure to one energy-draining task or person", "days30": "Rebuild part of your workflow around your natural energy cycles"}},
          {"option": "d", "score": 70, "text": "Sustained pressure — doable but tiring.", "depiction": "Your workload is constant and tiring, but still within your control zone.", "title": "The Long-Distance Strain: Carrying a Load That Never Lightens", "archetype": "The Endurance Worker", "keyInsight": "Your response tells a very real Energy Story — you can handle the work, but the ongoing pressure is slowly grinding your emotional and mental reserves. The Energy Load Root Cause is chronic pressure: sustained demands without sufficient recovery cycles are depleting you incrementally. Your Energy Blocker is lack of recovery cycles — pressure never fully lifts, preventing restoration. Yet your Signature Hidden Strength is endurance — you can sustain effort longer than most without collapsing.\n\nYour Energy Desire is relief — breathing room where demands lighten and energy can restore. Your Energy-Based Future Self is someone who performs at high level while maintaining emotional spaciousness. Your Energy Archetype is \"The Endurance Worker,\" someone whose sustainability requires intentional rest design.\n\nReduce strain with Energy Management Micro-Actions:\n\n24 hours: Identify the 1–2 pressure points that consistently push you into fatigue.\n\n7 days: Implement mini-recovery windows — micro-breaks, decompression blocks, calendar spacing.\n\n30 days: Redesign a small part of your workload or routine to reduce ongoing strain.\n\nYour Energy Fit Index shows capability under strain but unsustainable long-term.\nThe Digital Twin reflects:\n\"You're built for endurance — but endurance without recovery is burnout in slow motion.\"", "growthBlocker": "Lack of recovery cycles", "hiddenStrength": "Endurance", "hiddenDesire": "Relief", "futureArchetype": "Someone who performs at high level while maintaining emotional spaciousness", "microActions": {"hours24": "Identify the 1–2 pressure points that consistently push you into fatigue", "days7": "Implement mini-recovery windows — micro-breaks, decompression blocks, calendar spacing", "days30": "Redesign a small part of your workload or routine to reduce ongoing strain"}},
          {"option": "e", "score": 60, "text": "Always 'on' — difficult to disconnect fully.", "depiction": "Disconnecting is hard — your mind rarely gets to switch off fully.", "title": "The Hyper-Responsiveness Trap: When Your Mind Never Shuts Off", "archetype": "The Perpetual Performer", "keyInsight": "Your answer reflects a high-alert Energy Story — even when you're not working, your mind remains switched on. The Energy Load Root Cause is hyper-connectivity: technology, expectations, or internal drive keep you perpetually accessible and mentally engaged. Your Energy Blocker is emotional vigilance — constant availability prevents true rest. Yet your Signature Hidden Strength is dedication — your commitment and responsiveness are extraordinary.\n\nYour Energy Desire is mental freedom — the ability to disconnect fully and restore without guilt or anxiety. Your Energy-Based Future Self is someone who works in cycles — intense when needed, fully off when not. Your Energy Archetype is \"The Perpetual Performer,\" someone who needs boundary redesign for sustainability.\n\nReclaim mental freedom with Energy Management Micro-Actions:\n\n24 hours: Turn off one notification category — email, chat, or work alerts.\n\n7 days: Set a fixed shutdown ritual to transition out of work mode.\n\n30 days: Redefine your availability boundaries — when you're reachable and when you're not.\n\nYour Energy Fit Index shows dedication without boundaries — unsustainable.\nThe Digital Twin whispers:\n\"Being always-on isn't strength — it's a trap. Reclaim your off switch.\"", "growthBlocker": "Emotional vigilance", "hiddenStrength": "Dedication", "hiddenDesire": "Mental freedom", "futureArchetype": "Someone who works in cycles — intense when needed, fully off when not", "microActions": {"hours24": "Turn off one notification category — email, chat, or work alerts", "days7": "Set a fixed shutdown ritual to transition out of work mode", "days30": "Redefine your availability boundaries — when you're reachable and when you're not"}},
          {"option": "f", "score": 50, "text": "Overextended — I manage, but barely.", "depiction": "You're managing, but just barely — the overextension signals are visible.", "title": "The Overload Phase: One Step Away From Burnout", "archetype": "The Overloaded Executor", "keyInsight": "Your response reveals a serious Energy Story — you're functioning, but at the edge. The Energy Load Root Cause is overextension: demands exceed your sustainable capacity, creating constant strain. Your Energy Blocker is depletion — reserves are nearly empty, leaving no buffer for unexpected demands. Yet your Signature Hidden Strength is resilience — you continue delivering even when operating at the limit.\n\nYour Energy Desire is relief — lightening the load so you operate from strength, not survival. Your Energy-Based Future Self is someone who operates from strength, not survival mode. Your Energy Archetype is \"The Overloaded Executor,\" someone requiring urgent workload redesign.\n\nCreate relief with Energy Management Micro-Actions:\n\n24 hours: Eliminate or defer one non-critical task — create instant bandwidth.\n\n7 days: Identify the top two responsibilities that are unsustainably heavy — begin renegotiation.\n\n30 days: Redesign your workload structure — boundaries, delegation, or reallocation.\n\nYour Energy Fit Index shows critical overload requiring immediate intervention.\nThe Digital Twin affirms:\n\"You're one step from burnout. This is your signal to act, not endure.\"", "growthBlocker": "Depletion", "hiddenStrength": "Resilience", "hiddenDesire": "Relief", "futureArchetype": "Someone who operates from strength, not survival", "microActions": {"hours24": "Eliminate or defer one non-critical task — create instant bandwidth", "days7": "Identify the top two responsibilities that are unsustainably heavy — begin renegotiation", "days30": "Redesign your workload structure — boundaries, delegation, or reallocation"}},
          {"option": "g", "score": 40, "text": "Mentally overloaded — too many tasks, not enough space.", "depiction": "Your brain is carrying too much — task density is exceeding processing space.", "title": "The Cognitive Overload State: When Your Brain Is Operating Beyond Capacity", "archetype": "The Overloaded Thinker", "keyInsight": "Your response reveals a heavy Energy–Mind Story — your brain is carrying too many open loops, too many demands, too many unfinished threads. The Energy Load Root Cause is cognitive saturation: task density exceeds your brain's processing capacity. Your Energy Blocker is cognitive clutter — too many open threads prevent deep focus or rest. Yet your Signature Hidden Strength is perseverance — you continue functioning despite mental overload.\n\nYour Energy Desire is mental decluttering — fewer open tasks, clearer priorities, spacious thinking. Your Energy-Based Future Self is someone who operates with sharper focus and fewer tabs open. Your Energy Archetype is \"The Overloaded Thinker,\" someone requiring immediate simplification.\n\nDeclutter your mind with Energy Management Micro-Actions:\n\n24 hours: Brain-dump all open tasks onto paper or a digital list to unload your mind.\n\n7 days: Batch similar tasks to reduce cognitive switching.\n\n30 days: Redesign your workload by eliminating or delegating lower-priority items.\n\nYour Energy Fit Index shows mental overload requiring urgent simplification.\nThe Digital Twin reflects:\n\"Your brain isn't failing — it's overloaded. Close some tabs.\"", "growthBlocker": "Cognitive clutter", "hiddenStrength": "Perseverance", "hiddenDesire": "Mental decluttering", "futureArchetype": "Someone who operates with sharper focus and fewer tabs open", "microActions": {"hours24": "Brain-dump all open tasks onto paper or a digital list to unload your mind", "days7": "Batch similar tasks to reduce cognitive switching", "days30": "Redesign your workload by eliminating or delegating lower-priority items"}},
          {"option": "h", "score": 30, "text": "Physically exhausted — my body feels the strain before my mind does.", "depiction": "Your body is absorbing the workload strain before your mind does.", "title": "The Physical Fatigue Zone: When Your Body Sends the First Warning Signal", "archetype": "The Drained Achiever", "keyInsight": "Your response reveals a telling Energy–Body Story — your body is absorbing the workload's impact before your mind registers it. The Energy Load Root Cause is somatic depletion: physical energy reserves are exhausted while mental drive continues pushing. Your Energy Blocker is somatic fatigue — your body needs rest more urgently than your mind acknowledges. Yet your Signature Hidden Strength is mental durability — your mind can sustain focus even when your body protests.\n\nYour Energy Desire is restoration — physical recovery that matches your mental demands. Your Energy-Based Future Self is someone who honours their physiology as much as their ambition. Your Energy Archetype is \"The Drained Achiever,\" someone requiring urgent physical restoration.\n\nRestore physically with Energy Management Micro-Actions:\n\n24 hours: Prioritize one restorative action — hydration, stretch, early sleep, light movement.\n\n7 days: Create a physical recovery ritual — walks, stretching blocks, breathwork.\n\n30 days: Rebuild your lifestyle rhythm to include sustainable energy cycles.\n\nYour Energy Fit Index shows body signaling urgent need for rest.\nThe Digital Twin whispers:\n\"Your body is speaking. Listen before it shuts down completely.\"", "growthBlocker": "Somatic fatigue", "hiddenStrength": "Mental durability", "hiddenDesire": "Restoration", "futureArchetype": "Someone who honours their physiology as much as their ambition", "microActions": {"hours24": "Prioritize one restorative action — hydration, stretch, early sleep, light movement", "days7": "Create a physical recovery ritual — walks, stretching blocks, breathwork", "days30": "Rebuild your lifestyle rhythm to include sustainable energy cycles"}},
          {"option": "i", "score": 20, "text": "Running on reserve energy — recovery isn't happening.", "depiction": "You're running on the last layer of fuel — recovery isn't happening effectively.", "title": "The Reserve-Only Mode: When You're Operating Without Refill", "archetype": "The Reserve Runner", "keyInsight": "Your response illustrates a concerning Energy Story — you are functioning using emotional and physical reserves that should only be tapped occasionally. The Energy Load Root Cause is chronic depletion: you're operating on reserves meant for emergencies, not daily functioning. Your Energy Blocker is lack of restoration cycles — recovery simply isn't happening. Yet your Signature Hidden Strength is survival strength — you can function longer on reserves than most.\n\nYour Energy Desire is replenishment — restoring reserves and rebuilding sustainable energy rhythms. Your Energy-Based Future Self is someone who rebuilds energy faster than they deplete it. Your Energy Archetype is \"The Reserve Runner,\" someone requiring emergency restoration protocol.\n\nReplenish reserves with Energy Management Micro-Actions:\n\n24 hours: Remove one non-essential demand to create immediate breathing space.\n\n7 days: Add one high-quality recovery habit — sleep consistency, nutrition upgrade, digital detox.\n\n30 days: Redesign your weekly pattern for proper charge–discharge balance.\n\nYour Energy Fit Index shows critical depletion requiring immediate action.\nThe Digital Twin reflects:\n\"You're running on fumes. This isn't sustainable. Rest now.\"", "growthBlocker": "Lack of restoration cycles", "hiddenStrength": "Survival strength", "hiddenDesire": "Replenishment", "futureArchetype": "Someone who rebuilds energy faster than they deplete it", "microActions": {"hours24": "Remove one non-essential demand to create immediate breathing space", "days7": "Add one high-quality recovery habit — sleep consistency, nutrition upgrade, digital detox", "days30": "Redesign your weekly pattern for proper charge–discharge balance"}},
          {"option": "j", "score": 10, "text": "In burnout zone — I'm functioning but emotionally depleted.", "depiction": "You're functioning, but emotionally and physically depleted — burnout zone detected.", "title": "The Burnout Threshold: Functioning Outside Your Emotional bandwidth", "archetype": "The Burnout Survivor", "keyInsight": "Your choice reveals a deep Energy–Emotion Story — you are delivering, but at an emotional cost that is no longer sustainable. The Energy Load Root Cause is complete burnout: emotional, physical, and mental reserves are exhausted. Your Energy Blocker is systemic depletion — you're functioning but emotionally empty. Yet your Signature Hidden Strength is grit — you're still showing up despite complete depletion.\n\nYour Energy Desire is reset — a complete pause, restoration, and rebuilding of sustainable rhythms. Your Energy-Based Future Self is someone who operates with renewal, strength, and emotional alignment. Your Energy Archetype is \"The Burnout Survivor,\" someone requiring urgent intervention and support.\n\nBegin recovery with Energy Management Micro-Actions:\n\n24 hours: Pause one draining task or say no once — reclaim a tiny piece of emotional bandwidth.\n\n7 days: Engage in one replenishing activity — talking to someone safe, slowing down, resting intentionally.\n\n30 days: Begin a larger reset — shifting expectations, responsibilities, or environment.\n\nYour Energy Fit Index shows burnout requiring professional support and major change.\nThe Digital Twin affirms:\n\"You've reached the edge. This is not failure — this is your body protecting you. Rest.\"", "growthBlocker": "Emotional burnout", "hiddenStrength": "Grit", "hiddenDesire": "Reset", "futureArchetype": "Someone who operates with renewal, strength, and emotional alignment", "microActions": {"hours24": "Pause one draining task or say no once — reclaim a tiny piece of emotional bandwidth", "days7": "Engage in one replenishing activity — talking to someone safe, slowing down, resting intentionally", "days30": "Begin a larger reset — shifting expectations, responsibilities, or environment"}}
        ]
      },
      {
        "questionId": 6,
        "theme": "Cultural Tension Signal",
        "question": "If you could change one cultural aspect of your workplace, what would it be?",
        "indexName": "Cultural Alignment Need Index (CAN Index)",
        "scoreType": "Cultural Friction Score",
        "measure": "Shows what cultural shift your system is craving — trust, safety, recognition, etc.",
        "scoringOptions": [
          {"option": "a", "score": 100, "text": "More transparency in communication and decisions.", "depiction": "You thrive in truth-first cultures — clarity fuels your best work.", "title": "The Clarity Craving: When Opacity Erodes Emotional Safety", "archetype": "The Clarity Advocate", "keyInsight": "Your answer reveals a significant Culture–Emotion Story — you thrive in environments where truth is shared openly, decisions are explained, and ambiguity is minimized. The Cultural Tension Root Cause is informational opacity: when decisions happen behind closed doors or communication is filtered, trust erodes. The Culture Blocker is lack of transparency — hidden processes create anxiety and disengagement. Yet your Signature Hidden Strength is your desire for clarity, alignment, and honest dialogue — you naturally push for openness.\n\nYour Cultural Desire is transparency-as-trust — environments where information flows freely and decisions are explained. Your Culture-Based Future Self is someone operating in environments that respect open communication. Your Cultural Archetype is \"The Clarity Advocate,\" someone who champions truth and openness.\n\nAdvocate for transparency with Cultural Micro-Actions:\n\n24 hours: Identify one area where lack of transparency affects performance or trust.\n\n7 days: Ask clarifying questions in a neutral, non-confrontational tone.\n\n30 days: Advocate for transparent rituals (decision logs, project updates, open Q&As).\n\nYour Culture Fit Index shows high need for open communication environments.\nThe Digital Twin reflects:\n\"Transparency isn't weakness — it's the foundation of trust. Advocate for it.\"", "growthBlocker": "Informational opacity", "hiddenStrength": "Desire for clarity, alignment, and honest dialogue", "hiddenDesire": "Transparency-as-trust", "futureArchetype": "Someone operating in environments that respect open communication", "microActions": {"hours24": "Identify one area where lack of transparency affects performance or trust", "days7": "Ask clarifying questions in a neutral, non-confrontational tone", "days30": "Advocate for transparent rituals (decision logs, project updates, open Q&As)"}},
          {"option": "b", "score": 90, "text": "More trust — less micromanagement and control.", "depiction": "You work best when empowered — not controlled or monitored.", "title": "The Autonomy Need: When Oversight Becomes Emotional Friction", "archetype": "The Autonomy Champion", "keyInsight": "Your response reveals a strong Culture–Emotion Story — you work best when trusted, empowered, and allowed to execute without unnecessary oversight. The Cultural Tension Root Cause is control culture: excessive monitoring, approval layers, or micromanagement signal lack of trust. The Culture Blocker is over-control — when autonomy is restricted, motivation and creativity drain. Yet your Signature Hidden Strength is independence and expertise — you thrive when given ownership.\n\nYour Cultural Desire is empowerment — environments that trust you to deliver without constant oversight. Your Culture-Based Future Self is someone part of an organization that values ownership and autonomy. Your Cultural Archetype is \"The Autonomy Champion,\" someone who performs best when trusted.\n\nBuild trust with Cultural Micro-Actions:\n\n24 hours: Identify the specific behaviours that feel like micromanagement.\n\n7 days: Proactively showcase progress to create visibility without being asked.\n\n30 days: Suggest trust-building rituals — weekly sync instead of daily checkpoints.\n\nYour Culture Fit Index shows high need for trust-based environments.\nThe Digital Twin affirms:\n\"Trust is earned by delivering — but it's also a culture's responsibility to give.\"", "growthBlocker": "Over-control and micromanagement", "hiddenStrength": "Independence and expertise", "hiddenDesire": "Empowerment", "futureArchetype": "Someone part of an organization that values ownership", "microActions": {"hours24": "Identify the specific behaviours that feel like micromanagement", "days7": "Proactively showcase progress to create visibility without being asked", "days30": "Suggest trust-building rituals — weekly sync instead of daily checkpoints"}},
          {"option": "c", "score": 80, "text": "More recognition — people deserve to be seen.", "depiction": "Being unseen drains you — acknowledgment is your fuel.", "title": "The Visibility Gap: When Contribution Isn't Reflected Back", "archetype": "The Recognition Defender", "keyInsight": "Your choice reveals an emotionally rich Culture–Recognition Story — you believe that effort should be acknowledged, and impact should be seen. The Cultural Tension Root Cause is appreciation deficit: when contributions go unnoticed, motivation and emotional energy fade. The Culture Blocker is invisibility — cultures that don't celebrate wins or acknowledge effort create disengagement. Yet your Signature Hidden Strength is fairness and belief in merit — you naturally champion recognition for all.\n\nYour Cultural Desire is appreciation and visibility — environments where people's efforts are seen and valued. Your Culture-Based Future Self is someone thriving in environments where people are valued publicly. Your Cultural Archetype is \"The Recognition Defender,\" someone who advocates for acknowledgment.\n\nCultivate recognition with Cultural Micro-Actions:\n\n24 hours: Notice one area where recognition is consistently missing.\n\n7 days: Model recognition — appreciate others publicly.\n\n30 days: Begin shaping conversations around value, not just output.\n\nYour Culture Fit Index shows high need for appreciation-rich environments.\nThe Digital Twin reflects:\n\"Recognition isn't vanity — it's fuel. Build a culture that sees people.\"", "growthBlocker": "Appreciation deficit", "hiddenStrength": "Fairness and belief in merit", "hiddenDesire": "Appreciation and visibility", "futureArchetype": "Someone thriving in environments where people are valued", "microActions": {"hours24": "Notice one area where recognition is consistently missing", "days7": "Model recognition — appreciate others publicly", "days30": "Begin shaping conversations around value, not just output"}},
          {"option": "d", "score": 70, "text": "More fairness — fewer favorites, clearer merit.", "depiction": "Bias or favouritism irritates you — merit matters deeply.", "title": "The Equity Demand: When Unequal Treatment Disrupts Motivation", "archetype": "The Equity Guardian", "keyInsight": "Your response reflects a strong Culture–Equity Story — you are deeply affected when recognition, opportunities, or rewards follow favoritism instead of merit. The Cultural Tension Root Cause is perceived inequality: when systems favor relationships over results, fairness erodes. The Culture Blocker is bias — favoritism, unequal access, or subjective decisions that undermine meritocracy. Yet your Signature Hidden Strength is an internal moral compass — you sense injustice sharply and advocate for fair systems.\n\nYour Cultural Desire is equitable meritocracy — environments where effort, skill, and results determine outcomes. Your Culture-Based Future Self is someone who thrives in transparent, unbiased systems. Your Cultural Archetype is \"The Equity Guardian,\" someone who champions fairness.\n\nPromote equity with Cultural Micro-Actions:\n\n24 hours: Identify the patterns of unfairness — decisions, opportunities, praise distribution.\n\n7 days: Anchor your conversations in objective outcomes.\n\n30 days: Influence fairness rituals — clear role expectations, transparent opportunity processes.\n\nYour Culture Fit Index shows high need for merit-based environments.\nThe Digital Twin reflects:\n\"Fairness isn't optional — it's the foundation of trust. Advocate for it.\"", "growthBlocker": "Perceived inequality", "hiddenStrength": "Internal moral compass", "hiddenDesire": "Equitable meritocracy", "futureArchetype": "Someone who thrives in transparent, unbiased systems", "microActions": {"hours24": "Identify the patterns of unfairness — decisions, opportunities, praise distribution", "days7": "Anchor your conversations in objective outcomes", "days30": "Influence fairness rituals — clear role expectations, transparent opportunity processes"}},
          {"option": "e", "score": 60, "text": "More psychological safety — freedom to speak honestly.", "depiction": "You want a culture where honesty doesn't come with risk.", "title": "The Safety Gap: When Truth Must Tiptoe", "archetype": "The Safety Builder", "keyInsight": "Your answer reveals a sensitive and insightful Culture–Emotion Story — you can sense when people hold back their ideas, concerns, or feedback. The Cultural Tension Root Cause is conversational risk: fear of consequences prevents honest dialogue. The Culture Blocker is lack of safety — when speaking up feels risky, innovation and trust suffer. Yet your Signature Hidden Strength is authenticity and value for honesty — you naturally create spaces for real conversation.\n\nYour Cultural Desire is psychological freedom — environments where people can speak truthfully without fear. Your Culture-Based Future Self is someone thriving in open cultures where opinions are welcomed. Your Cultural Archetype is \"The Safety Builder,\" someone who creates trust.\n\nBuild safety with Cultural Micro-Actions:\n\n24 hours: Observe where silence exists — meetings, decisions, conflict zones.\n\n7 days: Model safe expression by asking open questions and welcoming views.\n\n30 days: Cultivate a local pocket of psychological safety.\n\nYour Culture Fit Index shows high need for psychologically safe environments.\nThe Digital Twin affirms:\n\"Safety isn't weakness — it's where truth and innovation thrive. Build it.\"", "growthBlocker": "Conversational risk", "hiddenStrength": "Authenticity and value for honesty", "hiddenDesire": "Psychological freedom", "futureArchetype": "Someone thriving in open cultures where opinions are welcomed", "microActions": {"hours24": "Observe where silence exists — meetings, decisions, conflict zones", "days7": "Model safe expression by asking open questions and welcoming views", "days30": "Cultivate a local pocket of psychological safety"}},
          {"option": "f", "score": 50, "text": "More collaboration — less siloed, more collective energy.", "depiction": "You believe siloed work kills potential — collective energy lifts you.", "title": "The Silo Frustration: When Work Happens in Islands, Not Ecosystems", "archetype": "The Collaboration Catalyst", "keyInsight": "Your response reflects a dynamic Culture–Team Story — you believe collective energy, shared ideas, and cross-team flow amplify impact. The Cultural Tension Root Cause is structural fragmentation: silos prevent information flow and collaborative problem-solving. The Culture Blocker is isolation — when teams work in islands, potential remains untapped. Yet your Signature Hidden Strength is a connector mindset — you naturally bridge gaps and build relationships.\n\nYour Cultural Desire is synergy — environments where teams collaborate fluidly across boundaries. Your Culture-Based Future Self is someone who thrives in collaborative ecosystems. Your Cultural Archetype is \"The Collaboration Catalyst,\" someone who unites teams.\n\nFoster collaboration with Cultural Micro-Actions:\n\n24 hours: Identify the one team you should collaborate with but currently don't.\n\n7 days: Initiate a cross-team conversation, sync, or co-created initiative.\n\n30 days: Build a repeatable collaboration rhythm.\n\nYour Culture Fit Index shows high need for cross-functional environments.\nThe Digital Twin reflects:\n\"Silos kill potential. You're built to connect. Do it.\"", "growthBlocker": "Structural fragmentation", "hiddenStrength": "Connector mindset", "hiddenDesire": "Synergy", "futureArchetype": "Someone who thrives in collaborative ecosystems", "microActions": {"hours24": "Identify the one team you should collaborate with but currently don't", "days7": "Initiate a cross-team conversation, sync, or co-created initiative", "days30": "Build a repeatable collaboration rhythm"}},
          {"option": "g", "score": 40, "text": "More innovation — fewer layers, more experimentation.", "depiction": "Layers and rules suffocate your creativity — you crave experimentation.", "title": "The Innovation Constriction: When Bureaucracy Blocks Imagination", "archetype": "The Innovation Activator", "keyInsight": "Your response reveals a powerful Culture–Innovation Story — you thrive in environments where ideas move fast, experiments are encouraged, and layers don't suffocate initiative. The Cultural Tension Root Cause is bureaucratic rigidity: excessive approval chains and risk aversion stifle creativity. The Culture Blocker is process over progress — when innovation requires too many layers, momentum dies. Yet your Signature Hidden Strength is imagination combined with action — you generate ideas and move quickly.\n\nYour Cultural Desire is creative freedom — environments where experimentation is encouraged. Your Culture-Based Future Self is someone who thrives in agile, idea-forward cultures. Your Cultural Archetype is \"The Innovation Activator,\" someone who catalyzes change.\n\nSpark innovation with Cultural Micro-Actions:\n\n24 hours: Identify one idea that has been stuck due to layers.\n\n7 days: Run a low-risk, small-scale experiment.\n\n30 days: Build a mini-innovation loop in your team.\n\nYour Culture Fit Index shows high need for experimental environments.\nThe Digital Twin affirms:\n\"Bureaucracy kills ideas. You're built to experiment. Start small.\"", "growthBlocker": "Rigidity and approval chains", "hiddenStrength": "Imagination combined with action", "hiddenDesire": "Creative freedom", "futureArchetype": "Someone who thrives in agile, idea-forward cultures", "microActions": {"hours24": "Identify one idea that has been stuck due to layers", "days7": "Run a low-risk, small-scale experiment", "days30": "Build a mini-innovation loop in your team"}},
          {"option": "h", "score": 30, "text": "More empathy — leaders understanding human realities.", "depiction": "You want leaders who understand human realities, not just metrics.", "title": "The Humanity Gap: When Leadership Forgets the Human Behind the Role", "archetype": "The Empathy Amplifier", "keyInsight": "Your answer unveils a deeply emotional Culture–Empathy Story — you feel the absence of human sensitivity in leadership interactions. The Cultural Tension Root Cause is emotional disconnect: leaders focus on metrics while missing human needs. The Culture Blocker is dehumanization — when people are treated as resources, not humans, engagement collapses. Yet your Signature Hidden Strength is compassion and human recognition — you see people's emotional realities.\n\nYour Cultural Desire is human leadership — environments where empathy is valued as strength. Your Culture-Based Future Self is someone thriving where empathy is seen as strength. Your Cultural Archetype is \"The Empathy Amplifier,\" someone who leads with heart.\n\nCultivate empathy with Cultural Micro-Actions:\n\n24 hours: Acknowledge one colleague's emotional reality.\n\n7 days: Initiate a human check-in moment in a meeting.\n\n30 days: Model compassionate leadership rituals.\n\nYour Culture Fit Index shows high need for human-centered environments.\nThe Digital Twin whispers:\n\"Empathy isn't soft — it's smart. Lead with it.\"", "growthBlocker": "Emotional disconnect", "hiddenStrength": "Compassion and human recognition", "hiddenDesire": "Human leadership", "futureArchetype": "Someone thriving where empathy is seen as strength", "microActions": {"hours24": "Acknowledge one colleague's emotional reality", "days7": "Initiate a human check-in moment in a meeting", "days30": "Model compassionate leadership rituals"}},
          {"option": "i", "score": 20, "text": "More clarity — clearer goals, roles, expectations.", "depiction": "Ambiguity drains you — you need roles, goals, and direction clear.", "title": "The Definition Deficit: When Ambiguity Becomes a Hidden Tax", "archetype": "The Clarity Architect", "keyInsight": "Your response reflects a precise Culture–Clarity Story — you cannot perform at your best when expectations are foggy, roles are blurry, or goals shift without notice. The Cultural Tension Root Cause is structural ambiguity: unclear expectations drain energy and create frustration. The Culture Blocker is definition deficit — when roles and goals are vague, performance suffers. Yet your Signature Hidden Strength is need for direction and purposeful focus — you thrive with clear frameworks.\n\nYour Cultural Desire is clarity-enabled empowerment — environments where expectations are explicit. Your Culture-Based Future Self is someone thriving in structured, aligned cultures. Your Cultural Archetype is \"The Clarity Architect,\" someone who builds clear systems.\n\nCreate clarity with Cultural Micro-Actions:\n\n24 hours: Identify one unclear expectation that drains your energy.\n\n7 days: Ask for alignment: What does success look like?\n\n30 days: Build a clarity ritual — weekly priorities, role statements, expectation check-ins.\n\nYour Culture Fit Index shows high need for well-defined environments.\nThe Digital Twin reflects:\n\"Ambiguity is expensive. Clarity is power. Demand it.\"", "growthBlocker": "Structural ambiguity", "hiddenStrength": "Need for direction and purposeful focus", "hiddenDesire": "Clarity-enabled empowerment", "futureArchetype": "Someone thriving in structured, aligned cultures", "microActions": {"hours24": "Identify one unclear expectation that drains your energy", "days7": "Ask for alignment: What does success look like?", "days30": "Build a clarity ritual — weekly priorities, role statements, expectation check-ins"}},
          {"option": "j", "score": 10, "text": "Less politics — more authenticity and real conversations.", "depiction": "You're allergic to politics — authenticity matters more than optics.", "title": "The Politics Fatigue: When Power Games Replace Purpose", "archetype": "The Authenticity Purist", "keyInsight": "Your response reveals a strong Culture–Integrity Story — you feel emotionally drained when politics overshadow performance or relationships. The Cultural Tension Root Cause is power-play culture: agendas, positioning, and optics replace honest communication. The Culture Blocker is inauthenticity — when politics dominate, trust evaporates. Yet your Signature Hidden Strength is authenticity — you value realness and directness.\n\nYour Cultural Desire is realness — environments where people speak plainly and act with integrity. Your Culture-Based Future Self is someone thriving where people speak plainly and act transparently. Your Cultural Archetype is \"The Authenticity Purist,\" someone who demands truth.\n\nNavigate politics with Cultural Micro-Actions:\n\n24 hours: Identify political patterns — who, where, and how they emerge.\n\n7 days: Navigate conversations with grounded clarity — no gossip, no triangulation.\n\n30 days: Build a micro-environment of authenticity — transparent communication, no hidden agendas, clear intentions.\n\nYour Culture Fit Index shows high need for authentic environments.\nThe Digital Twin affirms:\n\"Politics drain souls. Authenticity builds trust. Choose it.\"", "growthBlocker": "Power-play culture", "hiddenStrength": "Authenticity", "hiddenDesire": "Realness", "futureArchetype": "Someone thriving where people speak plainly and act transparently", "microActions": {"hours24": "Identify political patterns — who, where, and how they emerge", "days7": "Navigate conversations with grounded clarity", "days30": "Build a micro-environment of authenticity"}}
        ]
      },
      {
        "questionId": 7,
        "theme": "Leadership Energy Drain/Boost",
        "question": "How would you describe the impact your current leadership/manager has on your energy and confidence?",
        "indexName": "Leadership Impact Energy Index (LIE Index)",
        "scoreType": "Leadership Influence Score",
        "measure": "Measures how your manager impacts your energy, confidence, and growth potential.",
        "scoringOptions": [
          {"option": "a", "score": 100, "text": "They elevate me — I grow faster because of them.", "depiction": "Your leader multiplies your growth — they are a true accelerator.", "title": "The Energy-Lifting Leader: A Catalyst for Your Momentum", "archetype": "The Uplifted Performer", "keyInsight": "Your choice reveals a highly empowering Leader–Energy Story — your leader amplifies your potential, stretches your abilities, and accelerates your growth.", "growthBlocker": "Minimal", "hiddenStrength": "Responsiveness to good mentorship", "hiddenDesire": "Mastery", "futureArchetype": "Someone who carries forward this cycle of elevation", "microActions": {"hours24": "Identify one growth insight your leader gave that accelerated your progress", "days7": "Ask for strategic stretch assignments to expand your capability", "days30": "Build a personal Growth OS — weekly reflection, targeted skill deep dives"}},
          {"option": "b", "score": 90, "text": "They support me — I feel safe to stretch myself.", "depiction": "You feel supported and safe to stretch — trust fuels your progress.", "title": "The Safety-First Leader: A Steady Foundation for Your Growth", "archetype": "The Secure Striver", "keyInsight": "Your answer reveals a balanced, nurturing Leader–Energy Story — your leader creates emotional safety, psychological comfort, and space for learning.", "growthBlocker": "Internal underutilization", "hiddenStrength": "Openness to learning", "hiddenDesire": "Courage", "futureArchetype": "Someone who blends calmness with ambition", "microActions": {"hours24": "Acknowledge one area where their support enabled you to succeed", "days7": "Request specific feedback that sharpens your growth focus", "days30": "Take on one calculated-risk project that pushes you beyond comfort"}},
          {"option": "c", "score": 80, "text": "They guide me, but our styles don't fully match.", "depiction": "Guidance exists, but the style mismatch slows your fullest potential.", "title": "The Partial Alignment Leader: Helpful, Yet Not Quite Your Rhythm", "archetype": "The Adaptive Performer", "keyInsight": "Your response reveals a nuanced Leader–Energy Story — your leader provides guidance, but the way they operate isn't fully aligned with your natural work rhythm.", "growthBlocker": "Style mismatch", "hiddenStrength": "Adaptability", "hiddenDesire": "Resonance", "futureArchetype": "Someone who integrates multiple styles authentically", "microActions": {"hours24": "Identify the specific moments where your styles diverge", "days7": "Bridge the gap by aligning expectations and preferred communication formats", "days30": "Develop your own leadership rhythm that absorbs the useful"}},
          {"option": "d", "score": 70, "text": "They're neutral — neither draining nor inspiring.", "depiction": "Your leader neither boosts nor drains you — energy remains flat.", "title": "The Flatline Leadership Effect: When You Must Create Your Own Momentum", "archetype": "The Self-Propelled Achiever", "keyInsight": "Your response reveals a calm but uninspiring Leader–Energy Story — your leader does not harm your growth, but they also do not accelerate it.", "growthBlocker": "Emotional neutrality", "hiddenStrength": "Self-drive", "hiddenDesire": "Inspiration", "futureArchetype": "Someone who creates momentum from within", "microActions": {"hours24": "Identify where you rely on your leader for direction vs where you can self-initiate", "days7": "Seek inspiration from outside the leader—mentors, peers, learning spaces", "days30": "Establish a personal acceleration loop — goals, stretch targets, self-coaching"}},
          {"option": "e", "score": 60, "text": "They're distant — I'm left to navigate things alone.", "depiction": "You're navigating alone — the absence of leadership costs you energy.", "title": "The Absent Leadership Impact: When Guidance Becomes a Missing Resource", "archetype": "The Independent Navigator", "keyInsight": "Your answer reflects a challenging Leader–Energy Story — your leader is present in title but not in engagement.", "growthBlocker": "Emotional distance", "hiddenStrength": "Independence and learning to navigate", "hiddenDesire": "Connection and partnership", "futureArchetype": "Someone who provides the kind of involvement wished for", "microActions": {"hours24": "Identify the top 1–2 decisions where lack of guidance hurts your progress", "days7": "Proactively request specific inputs rather than waiting for general support", "days30": "Build your own advisory circle — peers, mentors, experts"}},
          {"option": "f", "score": 50, "text": "They're inconsistent — some days empowering, some days draining.", "depiction": "Unpredictable leadership creates emotional whiplash and uneven motivation.", "title": "The Unpredictable Leader: When Your Growth Depends on Their Mood Swing", "archetype": "The Resilient Stabilizer", "keyInsight": "Your response reveals a volatile Leader–Energy Story — your leader oscillates between empowering and draining, creating uncertainty in your work rhythm.", "growthBlocker": "Inconsistency", "hiddenStrength": "Resilience and adaptability", "hiddenDesire": "Stability", "futureArchetype": "Someone who values steadiness and clarity", "microActions": {"hours24": "Identify patterns — when they empower you vs when they drain you", "days7": "Build your own structure independent of their mood", "days30": "Create emotional insulation and strengthen internal stability"}},
          {"option": "g", "score": 40, "text": "They're demanding — growth happens but with emotional weight.", "depiction": "You're growing, but the emotional price of meeting expectations is heavy.", "title": "The High-Pressure Leader: Growth at the Cost of Emotional Fatigue", "archetype": "The Grit-Forged Achiever", "keyInsight": "Your response reveals a complex Leader–Energy Story — you are being stretched, but the stretch often feels heavy, urgent, or emotionally weighty.", "growthBlocker": "Pressure-loaded guidance", "hiddenStrength": "Grit", "hiddenDesire": "Balanced challenge", "futureArchetype": "Someone who pushes others but not at expense of well-being", "microActions": {"hours24": "Identify the tasks or interactions that feel more draining than developmental", "days7": "Create boundaries around urgency — clarify timelines and real criticalities", "days30": "Rebuild your personal growth rhythm — choosing your stretch"}},
          {"option": "h", "score": 30, "text": "They unintentionally drain me — communication gaps or unclear direction.", "depiction": "Unclear direction or feedback quietly drains your confidence.", "title": "The Accidental Drainer: When Confusion Eats Into Your Confidence", "archetype": "The Clarity-Seeking Performer", "keyInsight": "Your answer reveals a subtle yet impactful Leader–Energy Story — your leader doesn't aim to drain you, but their communication or clarity issues create emotional leakage.", "growthBlocker": "Misalignment and unclear communication", "hiddenStrength": "Conscientiousness", "hiddenDesire": "Coherence", "futureArchetype": "Someone who communicates simply, clearly, and predictably", "microActions": {"hours24": "Note the specific moments where unclear communication caused rework or stress", "days7": "Ask for clarity in real time: Can you confirm the priority and expectation?", "days30": "Build a clarity ritual — summaries, written confirmations, weekly alignment loops"}},
          {"option": "i", "score": 20, "text": "They limit me — my confidence dips around them.", "depiction": "Your leader restricts your potential — your confidence dips around them.", "title": "The Confidence-Dampening Leader: When Your Potential Shrinks in Their Presence", "archetype": "The Confidence Reclaimer", "keyInsight": "Your response reveals a concerning Leader–Energy Story — your leader's style, tone, or expectations make you doubt yourself.", "growthBlocker": "Psychological constriction", "hiddenStrength": "Self-awareness", "hiddenDesire": "Psychological safety", "futureArchetype": "Someone who expands others, not shrinks them", "microActions": {"hours24": "Identify the exact behaviours that make you shrink — tone, feedback style, control", "days7": "Create distance emotionally — don't internalize their tone as truth", "days30": "Build external confidence reservoirs — mentors, communities, small wins"}},
          {"option": "j", "score": 10, "text": "They exhaust me — I'm operating in survival mode.", "depiction": "Leadership exhausts you — you're operating in defensive, survival-driven energy.", "title": "The Survival-Mode Leader: When Emotional Fatigue Becomes Your Default", "archetype": "The Burnout-Aware Leader in the Making", "keyInsight": "Your selection reveals a deeply draining Leader–Energy Story — your leader's presence, style, or expectations consistently deplete your emotional reserves.", "growthBlocker": "Overload culture", "hiddenStrength": "Endurance", "hiddenDesire": "Emotional safety and sustainability", "futureArchetype": "Someone who leads with steadiness, respect, and humanity", "microActions": {"hours24": "Identify the moments where their presence triggers tension or fatigue", "days7": "Protect your emotional boundary — minimize non-essential interactions", "days30": "Begin designing your exit from survival mode"}}
        ]
      },
      {
        "questionId": 8,
        "theme": "Meaning & Values Alignment",
        "question": "When you reflect on your work and life, which statement feels most accurate?",
        "indexName": "Values–Work Harmony Index (VWH Index)",
        "scoreType": "Values Alignment Score",
        "measure": "Evaluates how closely your work matches your core beliefs, identity, and meaning.",
        "scoringOptions": [
          {"option": "a", "score": 100, "text": "My work aligns beautifully with what I stand for.", "depiction": "Your work beautifully mirrors what you stand for — rare alignment.", "title": "The Congruence State: When Your Work Reflects Your Soul's Signature", "archetype": "The Aligned Contributor", "keyInsight": "Your response reveals a deeply harmonious Values–Identity Story — your daily work expresses your principles, beliefs, and inner compass. The Values Alignment Root Cause is congruence: when your work reflects your core beliefs, energy flows naturally. The Values Blocker is complacency — perfection can lead to stagnation. Yet your Signature Hidden Strength is authenticity — you live your truth daily.\n\nYour Values Desire is expansion — deepening impact while maintaining alignment. Your Values-Based Future Self is someone who leads transformation rooted in meaning. Your Values Archetype is \"The Aligned Contributor,\" someone whose work mirrors their soul.\n\nDeepen alignment with Values Micro-Actions:\n\n24 hours: Identify one specific moment this week where your work expressed your principles.\n\n7 days: Seek a stretch task that deepens your contribution to a value-driven outcome.\n\n30 days: Build your personal Meaning OS — define top 3 values for your next chapter.\n\nYour Values Fit Index is optimal — you've found rare congruence.\nThe Digital Twin celebrates:\n\"Alignment is your superpower. Now scale it.\"", "growthBlocker": "Complacency", "hiddenStrength": "Authenticity", "hiddenDesire": "Expansion", "futureArchetype": "Someone who leads transformation rooted in meaning", "microActions": {"hours24": "Identify one specific moment this week where your work expressed your principles", "days7": "Seek a stretch task that deepens your contribution to a value-driven outcome", "days30": "Build your personal Meaning OS — define top 3 values for your next chapter"}},
          {"option": "b", "score": 90, "text": "My values guide my decisions, and work supports them.", "depiction": "Your values steer your choices, and your work largely supports them.", "title": "The Anchored Decision-Maker: Living Your Values, Not Just Naming Them", "archetype": "The Intentional Pathfinder", "keyInsight": "Your answer reflects a strong Values–Behaviour Story — your choices are rooted in principles, not pressure. The Values Alignment Root Cause is intentional congruence: your decisions reflect deep convictions, not external demands. The Values Blocker is limited stretch — staying comfortable can prevent expansion. Yet your Signature Hidden Strength is intentionality — you make principled choices consistently.\n\nYour Values Desire is deeper embodiment — living your values with greater impact. Your Values-Based Future Self is someone who inspires through consistency, integrity, and conviction. Your Values Archetype is \"The Intentional Pathfinder,\" someone who leads with principles.\n\nDeepen embodiment with Values Micro-Actions:\n\n24 hours: Name the one value you protected most strongly this month.\n\n7 days: Align a key work decision explicitly to your values.\n\n30 days: Design a Values Expansion Plan for your next career step.\n\nYour Values Fit Index is strong — values guide your path.\nThe Digital Twin affirms:\n\"Values aren't decorative. They're directional. Live them louder.\"", "growthBlocker": "Limited stretch", "hiddenStrength": "Intentionality", "hiddenDesire": "Deeper embodiment", "futureArchetype": "Someone who inspires through consistency, integrity, and conviction", "microActions": {"hours24": "Name the one value you protected most strongly this month", "days7": "Align a key work decision explicitly to your values", "days30": "Design a Values Expansion Plan for your next career step"}},
          {"option": "c", "score": 80, "text": "I'm aligned internally, but my environment doesn't always reflect it.", "depiction": "You're aligned within, but your environment doesn't always match your values.", "title": "The Inner-Outer Mismatch: When Your Values Shine, but Your Culture Doesn't", "archetype": "The Integrity Holder", "keyInsight": "Your response reveals a powerful but challenging Values–Environment Story — internally, you know what you stand for, but externally, the culture doesn't always match. The Values Alignment Root Cause is cultural dissonance: when organizational values contradict personal ones, friction emerges. The Values Blocker is environmental misalignment — external systems don't support internal principles. Yet your Signature Hidden Strength is integrity — you hold your compass steady despite pressure.\n\nYour Values Desire is resonance — environments that mirror your beliefs. Your Values-Based Future Self is someone who influences environments or chooses aligned ones. Your Values Archetype is \"The Integrity Holder,\" someone who stands firm in values.\n\nNavigate dissonance with Values Micro-Actions:\n\n24 hours: Identify the top 1–2 cultural mismatches causing friction.\n\n7 days: Anchor your behaviour in your internal compass.\n\n30 days: Decide whether to influence the environment or transition to an aligned one.\n\nYour Values Fit Index shows friction — your values are solid, but your context isn't.\nThe Digital Twin advises:\n\"Your integrity isn't the problem. Your environment is. Change it or leave it.\"", "growthBlocker": "Cultural dissonance", "hiddenStrength": "Integrity", "hiddenDesire": "Resonance", "futureArchetype": "Someone who influences environments or chooses aligned ones", "microActions": {"hours24": "Identify the top 1–2 cultural mismatches causing friction", "days7": "Anchor your behaviour in your internal compass", "days30": "Decide whether to influence the environment or transition to an aligned one"}},
          {"option": "d", "score": 70, "text": "I'm clear about my values, but not fully living them.", "depiction": "You know your values, but you're not consistently living them yet.", "title": "The Partial Alignment State: When Your Values Are Known but Not Yet Embodied", "archetype": "The Conscious Re-aligner", "keyInsight": "Your response reveals a meaningful Values–Behaviour Gap Story — you have clarity about what matters, but your daily decisions don't always reflect it. The Values Alignment Root Cause is intention-action gap: knowing your values doesn't automatically translate to living them. The Values Blocker is misaligned behaviour loops — habits and pressures override principles. Yet your Signature Hidden Strength is awareness — you recognize the gap, which is the first step.\n\nYour Values Desire is congruence — closing the gap between belief and action. Your Values-Based Future Self is someone whose choices mirror their truth. Your Values Archetype is \"The Conscious Re-aligner,\" someone actively bridging the gap.\n\nClose the gap with Values Micro-Actions:\n\n24 hours: Pinpoint one recent decision that contradicted your values.\n\n7 days: Make one value-led choice, even if small.\n\n30 days: Create a Values in Action plan.\n\nYour Values Fit Index shows potential — awareness exists, action is needed.\nThe Digital Twin reflects:\n\"Knowing isn't enough. Living is everything. Start today.\"", "growthBlocker": "Misaligned behaviour loops", "hiddenStrength": "Awareness", "hiddenDesire": "Congruence", "futureArchetype": "Someone whose choices mirror their truth", "microActions": {"hours24": "Pinpoint one recent decision that contradicted your values", "days7": "Make one value-led choice, even if small", "days30": "Create a Values in Action plan"}},
          {"option": "e", "score": 60, "text": "I know my values, but I'm unsure how they fit into my career.", "depiction": "You understand your values, but struggle to translate them into career direction.", "title": "The Directional Uncertainty: When Values Exist, but the Career Path Doesn't Yet Integrate Them", "archetype": "The Purpose-Seeking Navigator", "keyInsight": "Your answer reflects a thoughtful Values–Career Story — you're clear about what you believe, but the link between those beliefs and your career direction is still forming. The Values Alignment Root Cause is translation gap: values feel personal, but the professional pathway isn't clear. The Values Blocker is misalignment of purpose pathways — career hasn't been designed around principles. Yet your Signature Hidden Strength is self-awareness — you know what matters.\n\nYour Values Desire is integration — career that expresses your core beliefs. Your Values-Based Future Self is someone whose career becomes extension of principles. Your Values Archetype is \"The Purpose-Seeking Navigator,\" someone searching for alignment.\n\nBridge values to career with Values Micro-Actions:\n\n24 hours: Identify your top 3 values.\n\n7 days: Assess which aspects of your current role support or contradict them.\n\n30 days: Explore roles, industries, or pathways where values become career anchors.\n\nYour Values Fit Index shows opportunity — values exist, pathway needs design.\nThe Digital Twin guides:\n\"Your values aren't abstract. They're your career blueprint. Build it.\"", "growthBlocker": "Misalignment of purpose pathways", "hiddenStrength": "Self-awareness", "hiddenDesire": "Integration", "futureArchetype": "Someone whose career becomes extension of principles", "microActions": {"hours24": "Identify your top 3 values", "days7": "Assess which aspects of your current role support or contradict them", "days30": "Explore roles, industries, or pathways where values become career anchors"}},
          {"option": "f", "score": 50, "text": "My values are shifting — I'm evolving.", "depiction": "Your values are changing — you're in a meaningful identity evolution.", "title": "The Evolution Phase: When Your Inner Compass Is Rewriting Itself", "archetype": "The Evolving Architect", "keyInsight": "Your choice reveals a dynamic Values–Identity Transformation Story — you're in a period where your beliefs, priorities, and internal compass are evolving. The Values Alignment Root Cause is developmental transformation: growth changes what matters. The Values Blocker is uncertainty — transitions create temporary confusion. Yet your Signature Hidden Strength is self-honesty — you embrace evolution instead of resisting it.\n\nYour Values Desire is clarity — understanding your emerging principles. Your Values-Based Future Self is someone who aligns next chapter with updated beliefs. Your Values Archetype is \"The Evolving Architect,\" someone redesigning their compass.\n\nNavigate evolution with Values Micro-Actions:\n\n24 hours: Notice what no longer energizes — these are outdated values.\n\n7 days: Track moments of resonance — what feels meaningful now.\n\n30 days: Define your emergent values blueprint.\n\nYour Values Fit Index shows transition — you're becoming, not lost.\nThe Digital Twin encourages:\n\"Evolution isn't confusion. It's growth. Trust the process.\"", "growthBlocker": "Uncertainty", "hiddenStrength": "Self-honesty", "hiddenDesire": "Clarity", "futureArchetype": "Someone who aligns next chapter with updated beliefs", "microActions": {"hours24": "Notice what no longer energizes — these are outdated values", "days7": "Track moments of resonance — what feels meaningful now", "days30": "Define your emergent values blueprint"}},
          {"option": "g", "score": 40, "text": "I feel a growing mismatch between what I do and who I am.", "depiction": "Your work and identity feel increasingly misaligned — friction is rising.", "title": "The Expanding Gap: When Your Work No Longer Reflects Your Evolving Identity", "archetype": "The Identity Evolver", "keyInsight": "Your response reveals a profound Values–Identity Drift Story — who you are becoming is drifting away from what you currently do. The Values Alignment Root Cause is developmental divergence: you've outgrown your current career container. The Values Blocker is stagnation — staying in misalignment drains vitality. Yet your Signature Hidden Strength is self-awareness — you recognize the gap clearly.\n\nYour Values Desire is realignment — work that mirrors your evolved self. Your Values-Based Future Self is someone whose career mirrors expanded self. Your Values Archetype is \"The Identity Evolver,\" someone outgrowing their role.\n\nRealign identity with work through Values Micro-Actions:\n\n24 hours: Name the aspects of your identity that have grown beyond your current role.\n\n7 days: Identify the work elements that contradict who you're becoming.\n\n30 days: Explore aligned pathways.\n\nYour Values Fit Index shows urgent misalignment — the gap is widening.\nThe Digital Twin warns:\n\"Outgrowing isn't failure. Staying too long is. Move.\"", "growthBlocker": "Stagnation", "hiddenStrength": "Self-awareness", "hiddenDesire": "Realignment", "futureArchetype": "Someone whose career mirrors expanded self", "microActions": {"hours24": "Name the aspects of your identity that have grown beyond your current role", "days7": "Identify the work elements that contradict who you're becoming", "days30": "Explore aligned pathways"}},
          {"option": "h", "score": 30, "text": "I'm questioning whether my career truly reflects my identity.", "depiction": "You're beginning to doubt whether your career reflects who you are becoming.", "title": "The Identity Inquiry: When Doubt Signals an Awakening", "archetype": "The Authenticity Seeker", "keyInsight": "Your selection reflects a reflective Values–Identity Questioning Story — you're examining whether the life you've built aligns with your true self. The Values Alignment Root Cause is authenticity awakening: deeper self-knowledge reveals misalignment. The Values Blocker is uncertainty about authenticity — questioning feels destabilizing. Yet your Signature Hidden Strength is courage in questioning — most people avoid this inquiry.\n\nYour Values Desire is authenticity — career that reflects true identity. Your Values-Based Future Self is someone who builds career from inside out. Your Values Archetype is \"The Authenticity Seeker,\" someone pursuing truth.\n\nExplore authenticity with Values Micro-Actions:\n\n24 hours: Write the top 3 traits that define your identity today.\n\n7 days: Review your work and identify what reflects or suppresses these traits.\n\n30 days: Begin shaping a career narrative anchored in true identity.\n\nYour Values Fit Index shows awakening — doubt is the beginning of alignment.\nThe Digital Twin affirms:\n\"Questions aren't weakness. They're the path to truth. Keep asking.\"", "growthBlocker": "Uncertainty about authenticity", "hiddenStrength": "Courage in questioning", "hiddenDesire": "Authenticity", "futureArchetype": "Someone who builds career from inside out", "microActions": {"hours24": "Write the top 3 traits that define your identity today", "days7": "Review your work and identify what reflects or suppresses these traits", "days30": "Begin shaping a career narrative anchored in true identity"}},
          {"option": "i", "score": 20, "text": "I feel pulled between personal meaning and external pressures.", "depiction": "External demands are pulling you away from what truly matters to you.", "title": "The Values Tug-of-War: When Purpose Battles Obligation", "archetype": "The Purpose–Obligation Balancer", "keyInsight": "Your response reveals an emotionally rich Values–Conflict Story — your inner sense of meaning clashes with the realities of responsibility and expectation. The Values Alignment Root Cause is dual pressure system: external obligations override internal compass. The Values Blocker is competing demands — meaning versus survival mode. Yet your Signature Hidden Strength is integrity — you feel the tension because you care about both.\n\nYour Values Desire is harmony — integrating meaning with responsibility. Your Values-Based Future Self is someone finding a path where impact doesn't require compromise. Your Values Archetype is \"The Purpose–Obligation Balancer,\" someone navigating competing pulls.\n\nReclaim meaning with Values Micro-Actions:\n\n24 hours: Identify the exact situations where meaning lost to pressure.\n\n7 days: Make one small decision prioritizing meaning over expectation.\n\n30 days: Redesign a part of your career to reduce pressure-driven decisions.\n\nYour Values Fit Index shows conflict — external forces are winning.\nThe Digital Twin advises:\n\"Pressure isn't purpose. Choose meaning, even in small ways.\"", "growthBlocker": "Dual pressure", "hiddenStrength": "Integrity", "hiddenDesire": "Harmony", "futureArchetype": "Someone finding a path where impact doesn't require compromise", "microActions": {"hours24": "Identify the exact situations where meaning lost to pressure", "days7": "Make one small decision prioritizing meaning over expectation", "days30": "Redesign a part of your career to reduce pressure-driven decisions"}},
          {"option": "j", "score": 10, "text": "I feel disconnected — I need a deeper sense of direction.", "depiction": "You feel disconnected from meaning — your inner compass needs recalibration.", "title": "The Disconnection Phase: When Meaning Evaporates and Purpose Feels Distant", "archetype": "The Meaning Reclaimer", "keyInsight": "Your choice reflects a significant Values–Meaning Disconnection Story — you're operating, performing, delivering… but without emotional resonance. The Values Alignment Root Cause is purpose depletion: when work becomes mechanical, meaning evaporates. The Values Blocker is directional void — absence of guiding compass creates drift. Yet your Signature Hidden Strength is capacity and functioning strength — you're still operating despite disconnection.\n\nYour Values Desire is direction — reconnecting with what matters. Your Values-Based Future Self is someone finding meaning through reconnection. Your Values Archetype is \"The Meaning Reclaimer,\" someone recovering purpose.\n\nReconnect with meaning through Values Micro-Actions:\n\n24 hours: Acknowledge the disconnection without judgment.\n\n7 days: Revisit moments where you felt most alive.\n\n30 days: Begin constructing a new purpose pathway.\n\nYour Values Fit Index shows depletion — your compass needs recalibration.\nThe Digital Twin reflects:\n\"Disconnection isn't permanent. It's a signal. Listen and rebuild.\"", "growthBlocker": "Purpose depletion", "hiddenStrength": "Capacity and functioning strength", "hiddenDesire": "Direction", "futureArchetype": "Someone finding meaning through reconnection", "microActions": {"hours24": "Acknowledge the disconnection without judgment", "days7": "Revisit moments where you felt most alive", "days30": "Begin constructing a new purpose pathway"}}
        ]
      },
      {
        "questionId": 9,
        "theme": "Reinvention & Future-Readiness",
        "question": "How do you emotionally view your next big career change or reinvention?",
        "indexName": "Reinvention Readiness Index (RRI Index)",
        "scoreType": "Reinvention Readiness Score",
        "measure": "Measures how emotionally and mentally prepared you are for major career change.",
        "scoringOptions": [
          {"option": "a", "score": 100, "text": "Excited — I'm ready to leap.", "depiction": "You're ready to leap — energy and clarity are aligned for a big change.", "title": "The Leap Energy: When Your Future Pulls You Stronger Than Your Present Holds You", "archetype": "The Ready Leaper", "keyInsight": "Your response reveals a powerful Reinvention–Momentum Story — you're standing at the edge of a new chapter with excitement, not fear. The Reinvention Readiness Root Cause is alignment of desire and courage: when vision and confidence converge, leaps become possible. The Reinvention Blocker is direction clarity — excitement needs focus. Yet your Signature Hidden Strength is courage — you're ready to move boldly.\n\nYour Reinvention Desire is expansion — bigger impact, deeper alignment. Your Reinvention-Based Future Self is someone who moves with conviction and shapes opportunities. Your Reinvention Archetype is \"The Ready Leaper,\" someone prepared to transform.\n\nLaunch reinvention with Reinvention Micro-Actions:\n\n24 hours: Capture the top 3 areas where you feel the strongest pull for reinvention.\n\n7 days: Choose one direction and create a first-10-steps plan.\n\n30 days: Execute a bold action — sign up, apply, build, launch, pitch, or collaborate.\n\nYour Reinvention Fit Index is optimal — you're ready to leap.\nThe Digital Twin celebrates:\n\"The future is pulling you. Trust it. Leap.\"", "growthBlocker": "Direction clarity", "hiddenStrength": "Courage", "hiddenDesire": "Expansion", "futureArchetype": "Someone who moves with conviction and shapes opportunities", "microActions": {"hours24": "Capture the top 3 areas where you feel the strongest pull for reinvention", "days7": "Choose one direction and create a first-10-steps plan", "days30": "Execute a bold action — sign up, apply, build, launch, pitch, or collaborate"}},
          {"option": "b", "score": 90, "text": "Open — I'm eager to explore new directions.", "depiction": "You're genuinely open to new paths — curiosity is guiding you forward.", "title": "The Exploration Phase: When Curiosity Becomes Your Reinvention Compass", "archetype": "The Open Explorer", "keyInsight": "Your response reveals a thoughtful Reinvention–Curiosity Story — you may not have chosen a specific path, but you're emotionally open to discovery. The Reinvention Readiness Root Cause is curiosity-driven exploration: openness creates possibilities. The Reinvention Blocker is choice overwhelm — too many options can paralyze. Yet your Signature Hidden Strength is openness and willingness — you embrace uncertainty as discovery.\n\nYour Reinvention Desire is alignment — finding the path that resonates. Your Reinvention-Based Future Self is someone who crafts career through exploration. Your Reinvention Archetype is \"The Open Explorer,\" someone discovering through experimentation.\n\nExplore reinvention with Reinvention Micro-Actions:\n\n24 hours: Identify 2–3 potential reinvention possibilities that excite you.\n\n7 days: Run micro-experiments — short learning bursts, conversations, role simulations.\n\n30 days: Shortlist one direction that feels most alive.\n\nYour Reinvention Fit Index is strong — openness is your advantage.\nThe Digital Twin affirms:\n\"Curiosity is your compass. Follow it without forcing outcomes.\"", "growthBlocker": "Choice overwhelm", "hiddenStrength": "Openness and willingness", "hiddenDesire": "Alignment", "futureArchetype": "Someone who crafts career through exploration", "microActions": {"hours24": "Identify 2–3 potential reinvention possibilities that excite you", "days7": "Run micro-experiments — short learning bursts, conversations, role simulations", "days30": "Shortlist one direction that feels most alive"}},
          {"option": "c", "score": 80, "text": "Curious — I sense something bigger is calling me.", "depiction": "You sense something bigger ahead — the spark of reinvention is alive.", "title": "The Calling Whisper: When Reinvention Begins as a Feeling, Not a Plan", "archetype": "The Intuitive Awakener", "keyInsight": "Your response reveals a soulful Reinvention–Intuition Story — the next chapter isn't clear, but you can feel its presence. The Reinvention Readiness Root Cause is intuitive sensing: your body and soul detect change before your mind defines it. The Reinvention Blocker is ambiguity — feelings without clarity can feel confusing. Yet your Signature Hidden Strength is intuition — you sense truth before logic explains it.\n\nYour Reinvention Desire is purpose — aligning with something bigger. Your Reinvention-Based Future Self is someone who embodies larger, more meaningful version of themselves. Your Reinvention Archetype is \"The Intuitive Awakener,\" someone sensing transformation.\n\nFollow intuition with Reinvention Micro-Actions:\n\n24 hours: Write the sensations — what bigger feels like for you.\n\n7 days: Follow the intuitive breadcrumbs — people, ideas, industries that spark energy.\n\n30 days: Shape a prototype of your bigger self.\n\nYour Reinvention Fit Index shows awakening — trust the whisper.\nThe Digital Twin reflects:\n\"Intuition is intelligence. The calling is real. Follow it.\"", "growthBlocker": "Ambiguity", "hiddenStrength": "Intuition", "hiddenDesire": "Purpose", "futureArchetype": "Someone who embodies larger, more meaningful version of themselves", "microActions": {"hours24": "Write the sensations — what bigger feels like for you", "days7": "Follow the intuitive breadcrumbs — people, ideas, industries that spark energy", "days30": "Shape a prototype of your bigger self"}},
          {"option": "d", "score": 70, "text": "Prepared — I've been building toward this.", "depiction": "You've been building toward change — the groundwork is already in motion.", "title": "The Readiness Phase: When Your Past Work Quietly Prepared You for a Bigger Chapter", "archetype": "The Prepared Architect", "keyInsight": "Your response reflects a grounded Reinvention–Preparation Story — you're not leaping impulsively; you've been intentionally building for this moment. The Reinvention Readiness Root Cause is strategic preparation: you've been laying groundwork systematically. The Reinvention Blocker is timing anxiety — waiting for perfect moment can delay action. Yet your Signature Hidden Strength is strategic patience — you build before leaping.\n\nYour Reinvention Desire is activation — moving from preparation to execution. Your Reinvention-Based Future Self is someone who executes reinvention with mastery. Your Reinvention Archetype is \"The Prepared Architect,\" someone who builds then launches.\n\nActivate preparation with Reinvention Micro-Actions:\n\n24 hours: List the top 3 capabilities you've built that signal readiness.\n\n7 days: Identify the exact moment that should start your transition.\n\n30 days: Launch your Reinvention Activation Plan.\n\nYour Reinvention Fit Index shows readiness — the foundation is solid.\nThe Digital Twin advises:\n\"Preparation is power. Now execute. The time is now.\"", "growthBlocker": "Timing anxiety", "hiddenStrength": "Strategic patience", "hiddenDesire": "Activation", "futureArchetype": "Someone who executes reinvention with mastery", "microActions": {"hours24": "List the top 3 capabilities you've built that signal readiness", "days7": "Identify the exact moment that should start your transition", "days30": "Launch your Reinvention Activation Plan"}},
          {"option": "e", "score": 60, "text": "Cautiously optimistic — I want to move, but with stability.", "depiction": "You want change, but prefer stability as your safety net.", "title": "The Balanced Reinventor: When Hope Meets Practicality", "archetype": "The Strategic Optimist", "keyInsight": "Your response reveals a thoughtful Reinvention–Stability Story — you are open to change but equally anchored in the need for safety and control. The Reinvention Readiness Root Cause is balanced pragmatism: you want growth without recklessness. The Reinvention Blocker is risk perception — fear of instability can slow momentum. Yet your Signature Hidden Strength is maturity — you value thoughtful transitions.\n\nYour Reinvention Desire is assurance — change with safety nets intact. Your Reinvention-Based Future Self is someone who transitions with elegance. Your Reinvention Archetype is \"The Strategic Optimist,\" someone who changes wisely.\n\nBalance risk with Reinvention Micro-Actions:\n\n24 hours: Write down the exact risks you fear.\n\n7 days: Design a Safety Net Blueprint — savings, skill gaps, fallback options.\n\n30 days: Begin a low-risk reinvention experiment.\n\nYour Reinvention Fit Index shows caution — balance is strength, not weakness.\nThe Digital Twin advises:\n\"Stability and growth aren't enemies. Design both.\"", "growthBlocker": "Risk perception", "hiddenStrength": "Maturity", "hiddenDesire": "Assurance", "futureArchetype": "Someone who transitions with elegance", "microActions": {"hours24": "Write down the exact risks you fear", "days7": "Design a Safety Net Blueprint — savings, skill gaps, fallback options", "days30": "Begin a low-risk reinvention experiment"}},
          {"option": "f", "score": 50, "text": "Undecided — I feel the shift coming but can't define it yet.", "depiction": "You feel a shift coming, but the direction is still foggy.", "title": "The Undefined Shift: When You Know Change Is Near, but Its Shape Is Still Forming", "archetype": "The Transitional Seeker", "keyInsight": "Your answer reflects a subtle Reinvention–Ambiguity Story — your body, intuition, and mind sense change, but clarity hasn't arrived yet. The Reinvention Readiness Root Cause is pre-emergence: transformation brewing beneath surface. The Reinvention Blocker is lack of definition — ambiguity feels uncomfortable. Yet your Signature Hidden Strength is sensitivity to evolution — you sense shifts early.\n\nYour Reinvention Desire is insight — clarity about next direction. Your Reinvention-Based Future Self is someone who finds clarity through exploration. Your Reinvention Archetype is \"The Transitional Seeker,\" someone in becoming phase.\n\nFind definition with Reinvention Micro-Actions:\n\n24 hours: Document the hints — conversations, ideas, skills, moments that spark curiosity.\n\n7 days: Expose yourself to new worlds — industries, people, books, environments.\n\n30 days: Shortlist 2–3 potential reinvention directions.\n\nYour Reinvention Fit Index shows emergence — the shift is real, clarity is coming.\nThe Digital Twin encourages:\n\"Uncertainty isn't weakness. It's the space where clarity forms.\"", "growthBlocker": "Lack of definition", "hiddenStrength": "Sensitivity to evolution", "hiddenDesire": "Insight", "futureArchetype": "Someone who finds clarity through exploration", "microActions": {"hours24": "Document the hints — conversations, ideas, skills, moments that spark curiosity", "days7": "Expose yourself to new worlds — industries, people, books, environments", "days30": "Shortlist 2–3 potential reinvention directions"}},
          {"option": "g", "score": 40, "text": "Anxious — too many unknowns, not enough clarity.", "depiction": "The unknowns feel heavy — clarity must rise before momentum can build.", "title": "The Overwhelm Zone: When Reinvention Feels Bigger Than Your Current Capacity", "archetype": "The Anxious but Aware Transformer", "keyInsight": "Your response reveals an honest Reinvention–Anxiety Story — you sense the need for change, but the ambiguity of the next step triggers turbulence. The Reinvention Readiness Root Cause is uncertainty overload: too many unknowns create paralysis. The Reinvention Blocker is cognitive overwhelm — anxiety blocks action. Yet your Signature Hidden Strength is awareness — you recognize the anxiety, which is step one.\n\nYour Reinvention Desire is reassurance — clarity to reduce overwhelm. Your Reinvention-Based Future Self is someone who moves with confidence through clarity. Your Reinvention Archetype is \"The Anxious but Aware Transformer,\" someone navigating fear.\n\nReduce anxiety with Reinvention Micro-Actions:\n\n24 hours: Acknowledge your anxiety.\n\n7 days: Break reinvention into micro-decisions.\n\n30 days: Build a clarity map — options, risks, rewards.\n\nYour Reinvention Fit Index shows overwhelm — break it down to move forward.\nThe Digital Twin soothes:\n\"Anxiety means you care. Small steps dissolve overwhelm.\"", "growthBlocker": "Uncertainty overload", "hiddenStrength": "Awareness", "hiddenDesire": "Reassurance", "futureArchetype": "Someone who moves with confidence through clarity", "microActions": {"hours24": "Acknowledge your anxiety", "days7": "Break reinvention into micro-decisions", "days30": "Build a clarity map — options, risks, rewards"}},
          {"option": "h", "score": 30, "text": "Conflicted — part of me wants change, part of me resists.", "depiction": "Part of you wants change; part resists — the tug-of-war is real.", "title": "The Inner Tug-of-War: When Desire and Safety Pull You in Opposite Directions", "archetype": "The Integrative Reinventor", "keyInsight": "Your answer reveals a powerful Reinvention–Duality Story — one part of you seeks growth; another part holds tightly to familiarity and safety. The Reinvention Readiness Root Cause is internal conflict: growth instinct versus safety mechanism. The Reinvention Blocker is inner resistance — competing parts create friction. Yet your Signature Hidden Strength is balance — you honor both sides.\n\nYour Reinvention Desire is integration — honoring safety while embracing growth. Your Reinvention-Based Future Self is someone who transforms while carrying forward the best. Your Reinvention Archetype is \"The Integrative Reinventor,\" someone bridging opposing forces.\n\nIntegrate conflict with Reinvention Micro-Actions:\n\n24 hours: Write down the two parts of you.\n\n7 days: Identify what the resisting part is protecting.\n\n30 days: Design a hybrid transition.\n\nYour Reinvention Fit Index shows conflict — integration, not suppression, is the path.\nThe Digital Twin reflects:\n\"Both parts are valid. Honor them both. Move forward together.\"", "growthBlocker": "Inner resistance", "hiddenStrength": "Balance", "hiddenDesire": "Integration", "futureArchetype": "Someone who transforms while carrying forward the best", "microActions": {"hours24": "Write down the two parts of you", "days7": "Identify what the resisting part is protecting", "days30": "Design a hybrid transition"}},
          {"option": "i", "score": 20, "text": "Fearful — change feels overwhelming right now.", "depiction": "Reinvention feels overwhelming — fear is louder than possibility right now.", "title": "The Fear Barrier: When Reinvention Feels Like a Threat Instead of an Opportunity", "archetype": "The Fear-Aware Rebuilder", "keyInsight": "Your response reveals a raw Reinvention–Fear Story — you're not resisting change; you're afraid of its magnitude, consequences, or emotional demands. The Reinvention Readiness Root Cause is fear of loss: change threatens identity, security, or belonging. The Reinvention Blocker is threat perception — fear overshadows possibility. Yet your Signature Hidden Strength is vulnerability awareness — naming fear is courage.\n\nYour Reinvention Desire is safety — security amid transformation. Your Reinvention-Based Future Self is someone who transforms once fear is replaced with clarity. Your Reinvention Archetype is \"The Fear-Aware Rebuilder,\" someone who faces fear directly.\n\nTransform fear with Reinvention Micro-Actions:\n\n24 hours: Identify the exact fear.\n\n7 days: Reduce fear through exposure — learn, observe, analyse.\n\n30 days: Build a Safety Layer.\n\nYour Reinvention Fit Index shows fear — acknowledge it, then act despite it.\nThe Digital Twin affirms:\n\"Fear is information, not instruction. You're stronger than it.\"", "growthBlocker": "Fear of loss", "hiddenStrength": "Vulnerability awareness", "hiddenDesire": "Safety", "futureArchetype": "Someone who transforms once fear is replaced with clarity", "microActions": {"hours24": "Identify the exact fear", "days7": "Reduce fear through exposure — learn, observe, analyse", "days30": "Build a Safety Layer"}},
          {"option": "j", "score": 10, "text": "Stuck — I know I need reinvention, but don't know where to begin.", "depiction": "You know change is needed, but you don't know how to begin — stuck at the starting line.", "title": "The Inertia Loop: When You Want Change but Can't Find the Starting Point", "archetype": "The Still Potential", "keyInsight": "Your answer reveals a relatable Reinvention–Stagnation Story — the desire for change is real, but the starting line is invisible. The Reinvention Readiness Root Cause is paralysis by complexity: too many options or unknowns create inertia. The Reinvention Blocker is overwhelm paralysis — not moving feels safer than moving wrong. Yet your Signature Hidden Strength is awareness of stuckness — recognition is the first step.\n\nYour Reinvention Desire is roadmap — clear first steps to break inertia. Your Reinvention-Based Future Self is someone who gains momentum through small steps. Your Reinvention Archetype is \"The Still Potential,\" someone ready to unstick.\n\nBreak inertia with Reinvention Micro-Actions:\n\n24 hours: Identify one area of your life or career that feels most misaligned.\n\n7 days: Take the smallest possible action.\n\n30 days: Build a Reinvention Momentum Loop.\n\nYour Reinvention Fit Index shows stagnation — any action breaks the pattern.\nThe Digital Twin encourages:\n\"Stuck isn't permanent. One tiny step changes everything. Start now.\"", "growthBlocker": "Overwhelm paralysis", "hiddenStrength": "Awareness of stuckness", "hiddenDesire": "Roadmap", "futureArchetype": "Someone who gains momentum through small steps", "microActions": {"hours24": "Identify one area of your life or career that feels most misaligned", "days7": "Take the smallest possible action", "days30": "Build a Reinvention Momentum Loop"}}
        ]
      },
      {
        "questionId": 10,
        "theme": "Hidden Passion & Future Self Expression",
        "question": "If fear, money, and expectations were removed, what would you love your life's work to express?",
        "indexName": "Passion Expression Alignment Index (PEA Index)",
        "scoreType": "Passion Clarity Score",
        "measure": "Reveals your deepest passion signature and how clearly it aligns with future identity.",
        "scoringOptions": [
          {"option": "a", "score": 100, "text": "Creativity — building, designing, expressing ideas.", "depiction": "Your soul speaks through creation — imagination is your native language.", "title": "The Creative Identity: Your Soul Speaks Through What You Make", "archetype": "The Creative Builder", "keyInsight": "Your answer reveals a profound Creative–Purpose Story — you feel most alive when your inner world takes shape through ideas, structures, visuals, products, or concepts. The Passion Expression Root Cause is generative drive: creation is how your soul communicates. The Passion Blocker is suppression in non-creative environments — constraint kills vitality. Yet your Signature Hidden Strength is generativity — you create instinctively.\n\nYour Passion Desire is expression — freedom to create without limits. Your Passion-Based Future Self is someone who leads through innovation and artistic intelligence. Your Passion Archetype is \"The Creative Builder,\" someone who makes ideas real.\n\nExpress creativity with Passion Micro-Actions:\n\n24 hours: Capture one idea you've been holding back.\n\n7 days: Build a tiny prototype.\n\n30 days: Launch a creative project.\n\nYour Passion Fit Index is optimal — creation is your calling.\nThe Digital Twin celebrates:\n\"Your imagination isn't decoration. It's your destiny. Create.\"", "growthBlocker": "Suppression in non-creative environments", "hiddenStrength": "Generativity", "hiddenDesire": "Expression", "futureArchetype": "Someone who leads through innovation and artistic intelligence", "microActions": {"hours24": "Capture one idea you've been holding back", "days7": "Build a tiny prototype", "days30": "Launch a creative project"}},
          {"option": "b", "score": 90, "text": "Impact — improving lives and contributing meaningfully.", "depiction": "You're wired to improve lives — meaning drives your future more than title.", "title": "The Impact Identity: You Are Wired for Significance, Not Just Success", "archetype": "The Meaning-Maker", "keyInsight": "Your response reveals a powerful Impact–Purpose Story — you feel fulfilled when your work leaves people, systems, or communities better than before. The Passion Expression Root Cause is significance drive: contribution matters more than achievement. The Passion Blocker is smallness — work without meaning drains vitality. Yet your Signature Hidden Strength is empathy combined with ambition — you care deeply and act boldly.\n\nYour Passion Desire is meaningful contribution — work that improves lives. Your Passion-Based Future Self is someone leading with conscience. Your Passion Archetype is \"The Meaning-Maker,\" someone driven by significance.\n\nCreate impact with Passion Micro-Actions:\n\n24 hours: Identify one person or group you can meaningfully help today.\n\n7 days: Start a micro-initiative — mentoring, teaching, volunteering.\n\n30 days: Design an impact blueprint.\n\nYour Passion Fit Index is strong — impact is your language.\nThe Digital Twin affirms:\n\"Success is hollow without significance. You're built for both.\"", "growthBlocker": "Smallness", "hiddenStrength": "Empathy combined with ambition", "hiddenDesire": "Meaningful contribution", "futureArchetype": "Someone leading with conscience", "microActions": {"hours24": "Identify one person or group you can meaningfully help today", "days7": "Start a micro-initiative — mentoring, teaching, volunteering", "days30": "Design an impact blueprint"}},
          {"option": "c", "score": 80, "text": "Mastery — becoming exceptional in a craft or skill.", "depiction": "You're built to become world-class — depth and discipline define your path.", "title": "The Mastery Path: You're Meant to Become World-Class at Something", "archetype": "The Deep Specialist", "keyInsight": "Your response reveals a compelling Mastery–Identity Story — you're driven by the desire to excel deeply, not broadly. The Passion Expression Root Cause is excellence pursuit: depth satisfies more than breadth. The Passion Blocker is distraction — shallow pursuits dilute potential. Yet your Signature Hidden Strength is discipline — you commit to long-term development.\n\nYour Passion Desire is mastery and excellence — becoming world-class. Your Passion-Based Future Self is someone becoming the go-to expert. Your Passion Archetype is \"The Deep Specialist,\" someone pursuing mastery.\n\nPursue mastery with Passion Micro-Actions:\n\n24 hours: Identify the craft or skill you're instinctively drawn to deepen.\n\n7 days: Create a daily or weekly mastery ritual.\n\n30 days: Enroll in a mastery pathway.\n\nYour Passion Fit Index is focused — depth is your advantage.\nThe Digital Twin reflects:\n\"Mastery isn't a destination. It's a devotion. Commit.\"", "growthBlocker": "Distraction", "hiddenStrength": "Discipline", "hiddenDesire": "Mastery and excellence", "futureArchetype": "Someone becoming the go-to expert", "microActions": {"hours24": "Identify the craft or skill you're instinctively drawn to deepen", "days7": "Create a daily or weekly mastery ritual", "days30": "Enroll in a mastery pathway"}},
          {"option": "d", "score": 70, "text": "Freedom — working on my terms, in my rhythm.", "depiction": "You thrive when you choose your rhythm — autonomy is your highest currency.", "title": "The Freedom Blueprint: You Are Meant to Build a Life, Not Just a Career", "archetype": "The Freedom Architect", "keyInsight": "Your answer reveals a deeply personal Freedom–Identity Story — structure or rigidity drains you, while autonomy energizes you. The Passion Expression Root Cause is autonomy imperative: control over time and choices is essential. The Passion Blocker is constraint and control — external demands suffocate creativity. Yet your Signature Hidden Strength is self-leadership — you self-regulate effectively.\n\nYour Passion Desire is freedom and self-direction — designing life on your terms. Your Passion-Based Future Self is someone defining pace, priorities, and projects. Your Passion Archetype is \"The Freedom Architect,\" someone building autonomy.\n\nClaim freedom with Passion Micro-Actions:\n\n24 hours: Identify one area where you can reclaim autonomy.\n\n7 days: Create a personal workflow supporting your natural rhythm.\n\n30 days: Build or explore a freedom-oriented pathway.\n\nYour Passion Fit Index shows autonomy need — freedom isn't luxury, it's necessity.\nThe Digital Twin affirms:\n\"Freedom isn't selfish. It's sacred. Design it.\"", "growthBlocker": "Constraint and control", "hiddenStrength": "Self-leadership", "hiddenDesire": "Freedom and self-direction", "futureArchetype": "Someone defining pace, priorities, and projects", "microActions": {"hours24": "Identify one area where you can reclaim autonomy", "days7": "Create a personal workflow supporting your natural rhythm", "days30": "Build or explore a freedom-oriented pathway"}},
          {"option": "e", "score": 60, "text": "Leadership — guiding people, shaping systems.", "depiction": "You're meant to guide people and shape systems — influence is your calling.", "title": "The Leadership Calling: Your Influence Is Not Accidental—It's Inherent", "archetype": "The Guided Leader in the Making", "keyInsight": "Your answer reveals a compelling Leadership–Purpose Story — you're drawn to guide people, shape culture, influence direction, and leave a mark beyond individual contribution. The Passion Expression Root Cause is natural influence: people gravitate to your direction. The Passion Blocker is underutilization — untapped leadership drains potential. Yet your Signature Hidden Strength is presence and natural influence — leadership flows from you.\n\nYour Passion Desire is impact through leadership — guiding people and systems. Your Passion-Based Future Self is someone in visible leadership roles. Your Passion Archetype is \"The Guided Leader in the Making,\" someone born to lead.\n\nStep into leadership with Passion Micro-Actions:\n\n24 hours: Notice where people already come to you for direction.\n\n7 days: Claim a leadership micro-space.\n\n30 days: Start crafting your leadership brand.\n\nYour Passion Fit Index shows leadership potential — influence is inherent.\nThe Digital Twin affirms:\n\"Leadership isn't a title. It's who you are. Own it.\"", "growthBlocker": "Underutilization", "hiddenStrength": "Presence and natural influence", "hiddenDesire": "Impact through leadership", "futureArchetype": "Someone in visible leadership roles", "microActions": {"hours24": "Notice where people already come to you for direction", "days7": "Claim a leadership micro-space", "days30": "Start crafting your leadership brand"}},
          {"option": "f", "score": 50, "text": "Innovation — solving problems and inventing possibilities.", "depiction": "Your mind thinks in future tense — you're a natural builder of new ideas.", "title": "The Innovation Drive: You Think in Possibilities, Not Limitations", "archetype": "The Future-Maker", "keyInsight": "Your response reveals a powerful Innovation–Identity Story — you're energized by challenges that require imagination, experimentation, and bold thinking. The Passion Expression Root Cause is possibility mindset: you see solutions where others see constraints. The Passion Blocker is bureaucracy — rigid systems kill innovation. Yet your Signature Hidden Strength is divergent thinking — you generate novel solutions naturally.\n\nYour Passion Desire is innovation and creation — inventing new possibilities. Your Passion-Based Future Self is someone shaping the future of industries. Your Passion Archetype is \"The Future-Maker,\" someone thinking beyond limits.\n\nInnovate with Passion Micro-Actions:\n\n24 hours: Identify a problem that frustrates you.\n\n7 days: Build a small prototype, model, or experiment.\n\n30 days: Launch an innovation project.\n\nYour Passion Fit Index shows innovation drive — possibilities excite you.\nThe Digital Twin encourages:\n\"Innovation isn't a skill. It's how you see the world. Build it.\"", "growthBlocker": "Bureaucracy", "hiddenStrength": "Divergent thinking", "hiddenDesire": "Innovation and creation", "futureArchetype": "Someone shaping the future of industries", "microActions": {"hours24": "Identify a problem that frustrates you", "days7": "Build a small prototype, model, or experiment", "days30": "Launch an innovation project"}},
          {"option": "g", "score": 40, "text": "Learning — teaching, mentoring, sharing knowledge.", "depiction": "You're motivated by knowledge — teaching and mentoring light your inner fire.", "title": "The Wisdom Path: You Are Wired to Grow and Help Others Grow", "archetype": "The Knowledge Catalyst", "keyInsight": "Your answer reveals a meaningful Learning–Purpose Story — growth energizes you, and teaching feels natural because knowledge is your generosity. The Passion Expression Root Cause is wisdom sharing: knowledge multiplies when given away. The Passion Blocker is stagnation — environments without learning drain vitality. Yet your Signature Hidden Strength is clarity and teaching ability — you translate complexity into understanding.\n\nYour Passion Desire is growth and sharing knowledge — helping others develop. Your Passion-Based Future Self is someone guiding and facilitating others. Your Passion Archetype is \"The Knowledge Catalyst,\" someone who accelerates learning.\n\nShare wisdom with Passion Micro-Actions:\n\n24 hours: Share one insight or resource with someone who needs it.\n\n7 days: Offer a mentoring session or lead a short learning circle.\n\n30 days: Start a knowledge platform.\n\nYour Passion Fit Index shows teaching drive — knowledge is your gift.\nThe Digital Twin reflects:\n\"Knowledge isn't power until shared. You're built to teach.\"", "growthBlocker": "Stagnation", "hiddenStrength": "Clarity and teaching ability", "hiddenDesire": "Growth and sharing knowledge", "futureArchetype": "Someone guiding and facilitating others", "microActions": {"hours24": "Share one insight or resource with someone who needs it", "days7": "Offer a mentoring session or lead a short learning circle", "days30": "Start a knowledge platform"}},
          {"option": "h", "score": 30, "text": "Adventure — exploring spaces, industries, new worlds.", "depiction": "You're drawn to new worlds — experiences, industries, and environments energize you.", "title": "The Explorer's Spirit: You Are Designed for Movement, Discovery, and Expansion", "archetype": "The Boundless Explorer", "keyInsight": "Your response reflects an adventurous Exploration–Identity Story — monotony suffocates you; novelty awakens you. The Passion Expression Root Cause is discovery drive: new experiences fuel vitality. The Passion Blocker is routine — repetition kills energy. Yet your Signature Hidden Strength is adaptability — you thrive in change.\n\nYour Passion Desire is exploration and variety — constantly discovering new worlds. Your Passion-Based Future Self is someone with life filled with new experiences. Your Passion Archetype is \"The Boundless Explorer,\" someone designed for movement.\n\nEmbrace adventure with Passion Micro-Actions:\n\n24 hours: Explore one new topic, space, or environment you've never considered.\n\n7 days: Break routine.\n\n30 days: Plan a larger exploration experiment.\n\nYour Passion Fit Index shows exploration need — novelty is oxygen.\nThe Digital Twin celebrates:\n\"Routine is prison. Discovery is freedom. Explore.\"", "growthBlocker": "Routine", "hiddenStrength": "Adaptability", "hiddenDesire": "Exploration and variety", "futureArchetype": "Someone with life filled with new experiences", "microActions": {"hours24": "Explore one new topic, space, or environment you've never considered", "days7": "Break routine", "days30": "Plan a larger exploration experiment"}},
          {"option": "i", "score": 20, "text": "Service — helping others find clarity, direction, hope.", "depiction": "Helping others find direction or hope is your quiet superpower.", "title": "The Service Compass: You Are Built to Be a Light for Others", "archetype": "The Light-Giver", "keyInsight": "Your response reveals a deeply heartfelt Service–Purpose Story — fulfilment comes when you guide, uplift, or support others through confusion or struggle. The Passion Expression Root Cause is contribution imperative: helping others is soul-deep. The Passion Blocker is misplacement in non-service roles — transactional work drains purpose. Yet your Signature Hidden Strength is compassion and emotional intelligence — you sense what others need.\n\nYour Passion Desire is service and support — being a light for others. Your Passion-Based Future Self is someone in service-oriented leadership or coaching. Your Passion Archetype is \"The Light-Giver,\" someone built to guide.\n\nServe with purpose through Passion Micro-Actions:\n\n24 hours: Offer support to someone who is emotionally or mentally stuck.\n\n7 days: Facilitate a clarity conversation or reflective session.\n\n30 days: Build a service pathway.\n\nYour Passion Fit Index shows service calling — helping is your essence.\nThe Digital Twin affirms:\n\"Service isn't sacrifice. It's your soul's language. Speak it.\"", "growthBlocker": "Misplacement in non-service roles", "hiddenStrength": "Compassion and emotional intelligence", "hiddenDesire": "Service and support", "futureArchetype": "Someone in service-oriented leadership or coaching", "microActions": {"hours24": "Offer support to someone who is emotionally or mentally stuck", "days7": "Facilitate a clarity conversation or reflective session", "days30": "Build a service pathway"}},
          {"option": "j", "score": 10, "text": "Legacy — creating something enduring beyond myself.", "depiction": "You want your life's work to outlive you — legacy matters more than applause.", "title": "The Legacy Drive: Your Work Is a Bridge Between Your Life and the Future", "archetype": "The Legacy Maker", "keyInsight": "Your answer reveals a profound Legacy–Purpose Story — you want your work to outlive you, touch people you may never meet, and leave a mark that shapes the future. The Passion Expression Root Cause is transcendence drive: meaning extends beyond personal achievement. The Passion Blocker is short-termism — immediate results overshadow enduring impact. Yet your Signature Hidden Strength is vision and long-horizon thinking — you see beyond yourself.\n\nYour Passion Desire is legacy building — creating something that endures. Your Passion-Based Future Self is someone creating institutions, movements, or enduring frameworks. Your Passion Archetype is \"The Legacy Maker,\" someone building for eternity.\n\nBuild legacy with Passion Micro-Actions:\n\n24 hours: Define what legacy means to you.\n\n7 days: Start documenting your wisdom, frameworks, or methods.\n\n30 days: Begin a legacy-building project.\n\nYour Passion Fit Index shows legacy vision — immortality through impact.\nThe Digital Twin celebrates:\n\"Legacy isn't ego. It's eternity. You're building forever.\"", "growthBlocker": "Short-termism", "hiddenStrength": "Vision and long-horizon thinking", "hiddenDesire": "Legacy building", "futureArchetype": "Someone creating institutions, movements, or enduring frameworks", "microActions": {"hours24": "Define what legacy means to you", "days7": "Start documenting your wisdom, frameworks, or methods", "days30": "Begin a legacy-building project"}}
        ]
      }
    ],
    "scoringMatrix": {
      "description": "Universal scoring scale applied to all questions",
      "scale": {
        "a": {
          "score": 100,
          "label": "Excellent",
          "range": "80-100",
          "color": "emerald"
        },
        "b": {
          "score": 90,
          "label": "Excellent",
          "range": "80-100",
          "color": "emerald"
        },
        "c": {
          "score": 80,
          "label": "Strong",
          "range": "60-79",
          "color": "cyan"
        },
        "d": {
          "score": 70,
          "label": "Strong",
          "range": "60-79",
          "color": "cyan"
        },
        "e": {
          "score": 60,
          "label": "Developing",
          "range": "40-59",
          "color": "amber"
        },
        "f": {
          "score": 50,
          "label": "Developing",
          "range": "40-59",
          "color": "amber"
        },
        "g": {
          "score": 40,
          "label": "Focus Area",
          "range": "0-39",
          "color": "red"
        },
        "h": {
          "score": 30,
          "label": "Focus Area",
          "range": "0-39",
          "color": "red"
        },
        "i": {
          "score": 20,
          "label": "Focus Area",
          "range": "0-39",
          "color": "red"
        },
        "j": {
          "score": 10,
          "label": "Focus Area",
          "range": "0-39",
          "color": "red"
        }
      }
    },
    "readinessLevels": {
      "80-100": "Highly Ready for Growth",
      "70-79": "Ready with Focus Areas",
      "60-69": "Moderately Ready with Development Needs",
      "50-59": "Emerging Readiness - Foundation Building",
      "0-49": "Significant Transformation Opportunity"
    },
    "archetypeCategories": {
      "aligned": ["The Aligned Visionary", "The Awakening Integrator", "The Quiet Seeker"],
      "transitional": ["The Disconnected Wanderer", "The Unexpressed Visionary", "The Emerging Pathfinder"],
      "transformational": ["The Identity Rebuilder", "The Outgrowing Architect", "The Emerging Explorer", "The Conscious Reconstructor"]
    },
    "expandableFields": {
      "description": "To expand scoring for additional questions, follow this structure:",
      "template": {
        "questionId": "NUMBER",
        "theme": "DIMENSION_NAME",
        "indexName": "FULL_INDEX_NAME_WITH_ABBREVIATION",
        "scoreType": "SCORE_TYPE_NAME",
        "measure": "ONE_LINE_DESCRIPTION",
        "scoringOptions": [
          {
            "option": "a-j",
            "score": "100-10 (decreasing by 10)",
            "depiction": "SHORT_STATEMENT",
            "title": "FULL_TITLE",
            "archetype": "ARCHETYPE_NAME",
            "keyInsight": "DETAILED_EXPLANATION",
            "growthBlocker": "MAIN_CHALLENGE",
            "hiddenStrength": "UNDERLYING_POWER",
            "hiddenDesire": "TRUE_WANT",
            "futureArchetype": "NEXT_EVOLUTION",
            "microActions": {
              "hours24": "ACTION",
              "days7": "ACTION",
              "days30": "ACTION"
            }
          }
        ]
      }
    },
    "reportSections": {
      "overallMetrics": [
        "Average Score (0-100)",
        "Readiness Level",
        "Primary Archetype",
        "Highest Scoring Dimension",
        "Lowest Scoring Dimension",
        "Overall Career Insight"
      ],
      "visualization": [
        "Bar chart showing all 10 question scores",
        "Score summary table (Question # | Theme | Index | Score Type | Score | Status)",
        "Individual question cards with expandable details",
        "Score distribution summary"
      ],
      "actionPlan": [
        "Immediate actions (24 hours)",
        "Short-term actions (7 days)",
        "Long-term actions (30 days)"
      ]
    }
  }
}
