{
  "questionId": 3,
  "theme": "Career Trajectory Perception",
  "question": "How do you perceive your current career growth trajectory?",
  "indexName": "Career Momentum Trajectory Index (CMT Index)",
  "scoreType": "Growth Momentum Score",
  "measure": "Captures the true trajectory—accelerating, plateauing, drifting, or pivot-ready.",
  "scoringOptions": [
    {
      "option": "a",
      "score": 100,
      "text": "Upward and accelerating — I'm gaining momentum.",
      "depiction": "Your career is accelerating — the momentum you've built is visible and valuable.",
      "title": "Your Career Is Rising — Let's Make the Rise Visible",
      "archetype": "The Accelerating Builder",
      "keyInsight": "You're gaining momentum — and not by accident.\n\nYour identity (Q1) and strengths (Q2) are finally working together.\n\nYou're in a chapter where:\n ✓ People notice your capability\n ✓ Opportunities are coming faster\n ✓ Your confidence and skill are rising together\n\nBut here's the key insight:\n\nIf you don't shape the direction of your rise,\nothers will shape it for you.\n\nRight now, you are climbing well.\n\nBut the real win is to climb where it pays off:\n ✓ Bigger influence\n ✓ Higher visibility\n ✓ Faster growth\n ✓ Monetizable expertise that gives you optionality\n\nThis is the stage where strategic acceleration matters.\n\nBecause careers grow two ways:\n\n1️⃣ Organically — slow, incremental, permission-based\n\n2️⃣ Intentionally — directional, visible, opportunity-driven\n\nYou are ready for the second path.\n\nThis is where your Digital Twin becomes a career multiplier:\n\nIt turns your rising intelligence into a clear narrative that:\n ✓ Attracts sponsors\n ✓ Earns strategic roles\n ✓ Builds a brand around your strengths\n ✓ Opens doors beyond your current company\n\nWhat Your Future Self Knows\n\n\"Momentum is valuable — but only if it's pointed at your destiny.\"\n\nYou don't need fixing.\n\nYou need strategic elevation.\n\nThe Gold Program accelerates exactly this phase —\nnot by pushing harder,\nbut by making your rise smarter, faster, and recognized.\n\nGrowth feels exciting —\nbut does it feel emotionally rewarding every day?\n\nThat's where we go next.",
      "growthBlocker": "Overextension - saying yes to too much",
      "hiddenStrength": "Responsiveness and ability to convert feedback into action",
      "hiddenDesire": "Maximizing window of growth",
      "futureArchetype": "Someone who becomes unstoppable once aligned",
      "microActions": {
        "hours24": "Define one direction you want your rise to lead — impact, innovation, leadership?",
        "days7": "Say yes to something that expands your influence, not just workload.",
        "days30": "Make one achievement visible to the right people — not the whole world, just the right room."
      }
    },
    {
      "option": "b",
      "score": 90,
      "text": "Growing steadily but not exponentially.",
      "depiction": "You're growing well — now it's time to shift from steady progress to strategic leaps.",
      "title": "You're Growing Steadily — Now It's Time to Accelerate",
      "archetype": "The Strategic Steady-Grower",
      "keyInsight": "Your career is moving in the right direction.\n\nYou're developing skills, gaining experience, and earning trust.\n\nThis stability is a strength — many professionals never achieve it.\n\nBut steady growth can become a ceiling if it doesn't evolve into:\n ✓ Visible contributions\n ✓ High-value responsibilities\n ✓ Stronger positioning in the organization\n ✓ Impact that is measurable and recognized\n\nRight now, you are accumulating experience.\n\nThe next stage is converting experience into opportunity.\n\nThe question isn't \"Are you growing?\"\n\nThe question is \"How fast — and toward what?\"\n\nThis is where smart career acceleration becomes essential.\n\nMonetizable Opportunity Signals\n\nBased on your profile so far, you can grow faster by:\n ✓ Leading initiatives that demonstrate ownership\n ✓ Taking on responsibilities tied to outcomes, not tasks\n ✓ Turning consistent delivery into authority in a domain\n ✓ Showcasing results that prove your trajectory\n\nThis puts you on track for:\n✔ Role upgrade or internal mobility\n✔ Higher compensation visibility\n✔ Strategic growth paths in the next 12–18 months\n\nYour Digital Twin will help you:\n ✓ Display your strengths and wins clearly\n ✓ Predict the best next roles for your profile\n ✓ Highlight where your value can scale faster\n\nClarity + visibility = faster acceleration.\n\nFuture-You Guidance\n\nSteady growth is good.\n\nStrategic growth is career-changing.\n\nTo convert your consistent performance into visible advancement,\nthe Gold Program provides a clear acceleration roadmap\nso you grow faster than the system's default pace.\n\nNow let's look at the real test —\nhow does your growth feel emotionally day-to-day?",
      "growthBlocker": "Absence of stretch",
      "hiddenStrength": "Positive directional movement",
      "hiddenDesire": "Evolution",
      "futureArchetype": "Someone who blends calmness with ambition",
      "microActions": {
        "hours24": "Identify one area where you are already performing well — document the tangible result.",
        "days7": "Communicate that result to a leader or decision-maker.",
        "days30": "Request or design one responsibility that aligns with your growth goals."
      }
    },
    {
      "option": "c",
      "score": 80,
      "text": "Stable, predictable, and comfortable.",
      "depiction": "Your career feels comfortable and safe — but comfort can quietly cap potential.",
      "title": "You're Stable — But Stability Can Quietly Slow You Down",
      "archetype": "The Settled Stabilizer",
      "keyInsight": "Right now, your career feels predictable.\n\nWork gets done. Performance is solid.\n\nThere are no immediate risks — and that is valuable.\n\nBut here's the leadership truth:\n\nStability is comfortable, until the environment changes faster than you do.\n\nToday's workplace rewards:\n ✓ agility\n ✓ visibility\n ✓ innovation\n ✓ measurable business impact\n\nNot just \"reliability.\"\n\nIf your role remains the same for too long, others may:\n ✓ Leap ahead in responsibility\n ✓ Earn seniority through transformation, not time\n ✓ Be seen as future-ready while you remain dependable\n\nYou deserve more than being the safe pair of hands.\n\nMonetizable Growth Opportunities\n\nTo move from stable to strategic, your strengths can be used to:\n✔ Own initiatives with business impact\n✔ Develop expertise that differentiates you\n✔ Build a personal value narrative others notice\n✔ Earn promotions based on contribution, not tenure\n\nThe goal is not to disrupt your stability —\nbut to convert it into influence.\n\nThis is where your Digital Twin becomes practical:\n ✓ It identifies where your hidden value is underutilized\n ✓ It maps faster routes to recognition and scope expansion\n ✓ It shows how you can shape a higher-impact future without risky jumps\n\nFuture-You Guidance\n\nYou're not stuck — but the growth curve needs a sharper angle.\n\nYou've earned stability.\n\nNow you can upgrade it into opportunity.\n\nIf you want clarity on where your potential can scale fastest,\nthe Silver Program helps you move from dependable to in-demand.\n\nNext, let's evaluate how your work feels —\nbecause emotional signals are often the first sign that change is due.",
      "growthBlocker": "Comfort — the subtle inertia that keeps you from exploring",
      "hiddenStrength": "Adaptability and stability",
      "hiddenDesire": "Significance and stretch",
      "futureArchetype": "Someone who needs intentional disruption to grow",
      "microActions": {
        "hours24": "Pick one area where your judgment is trusted — and document a result you improved.",
        "days7": "Offer a suggestion that enhances efficiency or outcomes — something leadership will remember.",
        "days30": "Seek a role extension: training, cross-functional project, or ownership of a new KPI."
      }
    },
    {
      "option": "d",
      "score": 70,
      "text": "Growing externally, but internally I feel stagnant.",
      "depiction": "The world sees progress, but internally you know you're not evolving fast enough.",
      "title": "You Look Like You're Growing — But Inside, You Feel Stuck",
      "archetype": "The Hollow Achiever",
      "keyInsight": "From the outside, your career seems successful.\n\nYou're achieving. You're progressing. Others may even admire your path.\n\nBut internally, something isn't moving.\n\nYou're not growing in ways that truly matter to you:\n ✓ No new learning curve\n ✓ No spark or fulfillment\n ✓ No deeper meaning in the achievement\n\nThis creates a silent frustration:\n\n\"Everyone thinks I'm doing great —\nso why doesn't it feel great anymore?\"\n\nThe risk here isn't failure —\nit's continuing to win in a direction that doesn't feel like yours.\n\nMonetizable Career Leverage\n\nYour strengths are still valuable, and can be amplified into:\n✔ Authority in your preferred skill areas\n✔ More meaningful responsibilities\n✔ Opportunities that tap your deeper interests\n✔ High-visibility roles aligned to who you're becoming\n\nYou don't need to abandon your success.\n\nYou need to redirect it toward a future that energizes you.\n\nThis is exactly where the Digital Twin helps:\n ✓ It reveals alignment gaps between external success and inner purpose\n ✓ It redesigns your trajectory toward sustainable growth\n ✓ It identifies opportunities that feel like progress, not pressure\n\nFuture-You Guidance\n\nYour success deserves to feel like success.\n\nYou're allowed to want more passion with your progress.\n\nTo align the career you're building with the person you're becoming,\nthe Gold Program offers structured direction without losing momentum.\n\nNext, we explore how your emotional energy at work is signaling your next step.",
      "growthBlocker": "Misalignment between impact and fulfilment",
      "hiddenStrength": "Self-awareness",
      "hiddenDesire": "Meaningful advancement",
      "futureArchetype": "Someone who outgrows the image of success",
      "microActions": {
        "hours24": "Write down what part of your role feels most meaningful — and most draining.",
        "days7": "Have a career conversation focusing on development, not tasks.",
        "days30": "Initiate or lobby for a project that excites you — not just progresses you."
      }
    },
    {
      "option": "e",
      "score": 60,
      "text": "I'm plateauing — growth feels slower than it should.",
      "depiction": "You feel the slowdown — progress is happening, but not at the speed you deserve.",
      "title": "You're Plateauing — Not Because You Lack Ability, But Because You've Outgrown This Level",
      "archetype": "The Plateau Breaker",
      "keyInsight": "Plateaus are misunderstood.\n\nPeople assume a plateau means:\n❌ not skilled enough\n❌ not working hard enough\n❌ not ambitious enough\n\nBut your plateau means something very different:\n\n   You've mastered what this level demands.\n\nThe environment around you hasn't evolved fast enough to match your growth.\n\nThis leads to a quiet internal question:\n\n\"Is this all there is for me here?\"\n\nYour effort is still high…\nbut the reward, the stretch, the thrill — is missing.\n\nMonetization & Opportunity Signal\n\nA plateau is not the end.\n\nIt's the best moment to re-shape your career:\n✔ Step into higher-complexity roles\n✔ Expand your income through expertise positioning\n✔ Turn specialization into influence\n✔ Lead initiatives instead of executing them\n\nYou don't need to work more.\n\nYou need to work at a different altitude.\n\nThis is exactly what your Digital Twin accelerates:\n ✓ Maps your next career elevation\n ✓ Shows where your strengths can command higher value\n ✓ Predicts what role evolution will unlock your exponential phase\n\nFuture-You Guidance\n\nYou're not stuck — you're waiting for the right elevation.\n\nWhat you've built so far is foundation, not finish line.\n\nTo shift from plateau to peak,\nthe Platinum Program gives structured elevation and visibility —\nso the world sees what you're truly ready for.\n\nNext, we decode how your emotional relationship with work reflects your need for renewal.",
      "growthBlocker": "Opportunity limitation",
      "hiddenStrength": "Independence and capability",
      "hiddenDesire": "Upward movement",
      "futureArchetype": "Someone who needs a strategic push to rise again",
      "microActions": {
        "hours24": "Identify one process/task you've outgrown — and delegate or simplify it.",
        "days7": "Propose a value-adding idea aligned to business priorities.",
        "days30": "Start building a capability that belongs to your next role, not this one."
      }
    },
    {
      "option": "f",
      "score": 50,
      "text": "My trajectory is unclear — I'm still finding the path.",
      "depiction": "The next step isn't clear yet — direction needs more focus before momentum rises.",
      "title": "Your Path Is Still Taking Shape — And That's a Strategic Advantage",
      "archetype": "The Direction-Seeker",
      "keyInsight": "You're not lost.\n\nYou're exploring.\n\nThis phase can feel uncertain… but it's actually one of the most valuable stages in a successful career.\n\nWhy?\n\nBecause you're not forcing yourself into a direction that doesn't fit.\n\nRight now, you're collecting:\n ✓ Experiences\n ✓ Preferences\n ✓ Strength signals\n ✓ Market awareness\n\nThis means your future trajectory has more upside and more flexibility than someone who locked into\nthe wrong path too early.\n\nMonetization & Opportunity Signal\n\nYour biggest opportunity now is clarity through experimentation:\n✔ Short sprints in different types of work\n✔ Exposure to diverse teams and challenges\n✔ Discovering strengths that feel energizing and valuable\n✔ Unlocking emerging passions that can convert into income streams later\n\nYour Digital Twin helps you:\n ✓ Identify patterns behind roles where you thrive\n ✓ Predict which paths can deliver both growth and income acceleration\n ✓ Avoid costly detours that waste years\n\nYou're at the stage where small, smart moves compound the fastest.\n\nFuture-You Guidance\n\nA clear path comes after honest exploration.\n\nAnd that exploration becomes a competitive advantage when guided thoughtfully.\n\nThe Silver Program is designed exactly for professionals at this stage —\nto turn exploration into a direction backed by data and strengths.\n\nNext, we'll examine how your emotional energy at work either fuels or slows your trajectory.",
      "growthBlocker": "Lack of clarity",
      "hiddenStrength": "Early-stage movement",
      "hiddenDesire": "Clarity",
      "futureArchetype": "Someone whose path reveals itself through exploration",
      "microActions": {
        "hours24": "Note 3 tasks from recent weeks that felt meaningful or energizing.",
        "days7": "Seek a micro-opportunity in one of those areas (shadowing, a mini-project, upskilling).",
        "days30": "Eliminate or reduce one type of work that drains you consistently."
      }
    },
    {
      "option": "g",
      "score": 40,
      "text": "I feel misaligned — I'm growing, but in the wrong direction.",
      "depiction": "You're moving forward, but the direction doesn't feel like your true path.",
      "title": "You're Growing — But Not in the Direction That Matters Most to You",
      "archetype": "The Path Realigner",
      "keyInsight": "You're progressing.\n\nBut it's not the progress you actually want.\n\nYou've likely taken opportunities that made sense logically:\n\n✔ Better title\n✔ Better salary\n✔ Better company\n\n…but emotionally and purpose-wise, something feels off.\n\nYou are building a career —\njust not the career you intended to build.\n\nThis creates a tension between:\n ✓ External success (how the world sees you)\n ✓ Internal alignment (what you really want)\n\nAnd the gap keeps widening.\n\nMonetization & Opportunity Signal\n\nThis is not a failure.\n\nIt is a course correction moment.\n\nHere's your advantage:\n\nYou now know what you don't want —\nwhich makes your next move far more precise.\n\nYour Digital Twin helps you:\n✔ Realign to roles that match your identity and long-term interests\n✔ Predict which industry/role shift will unlock fulfillment + income\n✔ Reposition your strengths where they are valued most\n\nThis is the moment where alignment becomes acceleration.\n\nFuture-You Guidance\n\nIn the right role, your growth won't just continue —\nit will compound.\n\nThe Gold Program is specifically designed for professionals realigning toward more meaningful and\nfuture-proof work — without losing current momentum.\n\nNext, we decode the emotions behind your work experience —\nbecause emotional alignment accelerates every strategic step you take.",
      "growthBlocker": "Directional misalignment",
      "hiddenStrength": "Self-awareness about misalignment",
      "hiddenDesire": "Course correction",
      "futureArchetype": "Someone who must shift direction, not speed",
      "microActions": {
        "hours24": "Write down what aspects of your current role feel misaligned.",
        "days7": "Explore 1–2 job redesign opportunities internally (skills shift, different team, new exposure).",
        "days30": "Connect with someone who currently works in the career direction you want — learn real success signals."
      }
    },
    {
      "option": "h",
      "score": 30,
      "text": "I've hit a wall — progress feels blocked or political.",
      "depiction": "You've hit barriers that aren't about capability — the system is slowing you down.",
      "title": "You Didn't Hit a Ceiling — You Hit a System",
      "archetype": "The Barrier Breaker",
      "keyInsight": "Your capability is not the issue.\n\nYour environment is.\n\nThe slowdown you're experiencing is not due to lack of effort or talent —\nit's because:\n ✓ Growth depends on politics, not performance\n ✓ Opportunities are held, not distributed\n ✓ Visibility is selective\n ✓ Advancement requires the \"right place, right moment\" luck\n\nThis creates frustration because you know you can deliver more…\nbut the system is not designed to reward it consistently.\n\nYour ambition is ahead of the ecosystem around you.\n\nMonetization & Opportunity Signal\n\nYou are ready for higher-trust, higher-impact work.\n\nYour value is real —\nit just needs to be positioned in places where:\n✔ Capability is recognized faster\n✔ Initiatives are merit-driven\n✔ Influence is rewarded\n✔ Leaders want to grow future leaders\n\nYour Digital Twin helps you:\n ✓ Build leverage and influence beyond current hierarchies\n ✓ Uncover growth ecosystems where advancement is faster\n ✓ Develop visibility assets that bypass political bottlenecks\n\nYou don't have a capability gap —\nyou have a platform gap.\n\nFuture-You Guidance\n\nYou grow when the system allows you to —\nand it's time to choose a system that enables your next leap.\n\nThe Platinum Program gives you a structured path to:\n ✓ Build influence assets\n ✓ Strengthen leadership credibility\n ✓ Position yourself for your next-level ecosystem\n\nNot by waiting —\nbut by designing your runway.\n\nNow, let's examine the emotional energy behind your work —\nbecause emotional strain or spark reveals how long this environment can support you.",
      "growthBlocker": "Systemic blockage",
      "hiddenStrength": "Persistence despite barriers",
      "hiddenDesire": "Liberation",
      "futureArchetype": "Someone who must choose whether to climb over or walk around",
      "microActions": {
        "hours24": "Identify one skill or contribution you're under-leveraging.",
        "days7": "Showcase a recent result to someone beyond your immediate team.",
        "days30": "Establish at least one external professional relationship aligned to future opportunities.\n(Smart careers are built inside and beyond the organization simultaneously.)"
      }
    },
    {
      "option": "i",
      "score": 20,
      "text": "I'm preparing for a major pivot, even if it's not visible yet.",
      "depiction": "You're quietly preparing for a pivot — change is coming, just not visible yet.",
      "title": "Your Pivot Has Already Begun — Even If Others Can't See It Yet",
      "archetype": "The Intentional Rebuilder",
      "keyInsight": "You're not waiting for change —\nyou're preparing for it.\n\nThis is a powerful place to be, because:\n ✓ You feel the shift coming before the world does\n ✓ You are collecting skills that belong to your next career chapter\n ✓ You are mentally ready for a bigger challenge\n ✓ You are already detaching from what no longer fits\n\nInternally, your career is evolving.\n\nExternally, the world is just catching up.\n\nThis creates a unique tension:\n\n\"I know something new is coming… but how do I make the leap at the right time?\"\n\nMonetization & Opportunity Signal\n\nThis stage is ideal for intentional reinvention — not reactive change.\n\nYour biggest opportunities now:\n✔ Design your next role before you apply for it\n✔ Market your evolving strengths with a clear value story\n✔ Shift toward higher-value work where your growth accelerates\n\nYour Digital Twin becomes the business case for your pivot:\n ✓ Shows where your future strengths will command better income\n ✓ Aligns your identity with opportunity areas\n ✓ Helps you transition without losing stability\n\nThis is your moment to future-proof yourself.\n\nFuture-You Guidance\n\nYou are already moving toward a chapter that fits you better —\nyour next decision determines how fast that chapter starts.\n\nThe Gold Program is designed for individuals on the edge of a career upgrade —\nhelping them convert preparation into positioning and tangible elevation.\n\nNo big leaps. Just smart transitions.\n\nNext, we'll decode how your emotional energy at work is signaling the urgency and timing of this career\nshift.",
      "growthBlocker": "Invisibility of pivot",
      "hiddenStrength": "Intentional movement",
      "hiddenDesire": "Transformation",
      "futureArchetype": "Someone whose external actions catch up with internal clarity",
      "microActions": {
        "hours24": "Identify the 1 capability you are most excited to use in your next chapter.",
        "days7": "Start showcasing that capability through a mini-project or content.",
        "days30": "Expand your network into the field/domain where you want to grow next.\nThe pivot becomes real the moment others see you through the future lens."
      }
    },
    {
      "option": "j",
      "score": 10,
      "text": "I feel lost — I don't know where this path is taking me.",
      "depiction": "You're advancing without clarity — you need a better compass to guide the path.",
      "title": "You're Questioning the Path — Because You're Ready for Better Direction",
      "archetype": "The Identity Seeker",
      "keyInsight": "Feeling lost doesn't mean you lack ambition.\n\nIt means you've outgrown the assumptions that brought you here.\n\nYou're no longer willing to follow a path \"just because it's there.\"\n\nYou want a reason — a future you can believe in.\n\nThis signals a high-awareness transition phase:\n ✓ You know what isn't working\n ✓ You're searching for what will\n ✓ You're no longer satisfied with default success\n\nIt's uncomfortable, yes —\nbut this discomfort is the beginning of clarity.\n\nMonetization & Opportunity Signal\n\nThis is a crucial moment where you can design a career that truly fits you — instead of inheriting one.\n\nYour strongest opportunities right now:\n✔ Discover where your strengths create the highest value\n✔ Explore industries/roles aligned with your identity and future aspirations\n✔ Shift toward a path that offers growth, recognition, and income upside\n\nYour Digital Twin is built for this chapter:\n ✓ It extracts patterns from what energizes you\n ✓ Predicts best-fit career directions\n ✓ Gives you clarity faster, avoiding trial-and-error years\n\nThis isn't a setback.\n\nIt's a redirection.\n\nFuture-You Guidance\n\nYour career story isn't missing direction —\nit's waiting for a decision that honors who you are becoming.\n\nThe Silver Program supports you in shaping that clarity —\nwith structured discovery and future-path validation that keeps you moving forward, not spinning.\n\nNext, we'll decode the emotional roots of your work experience —\nbecause how you feel at work is the clearest indicator of what needs to change next.",
      "growthBlocker": "Lack of clarity",
      "hiddenStrength": "Continuing to move despite uncertainty",
      "hiddenDesire": "Self-discovery",
      "futureArchetype": "Someone whose path reveals itself through exploration",
      "microActions": {
        "hours24": "Write down 3 things you no longer want your career to be defined by.",
        "days7": "Identify 1–2 fields or roles that you are curious to explore — even if they feel bold.",
        "days30": "Start learning or connecting in one chosen direction — momentum builds clarity."
      }
    }
  ]
}
