{
  "questionId": 4,
  "theme": "Emotional Relationship with Work",
  "question": "Which statement best describes your emotional relationship with work right now?",
  "indexName": "Work–Emotion Vitality Index (WEV Index)",
  "scoreType": "Emotional Health Score",
  "measure": "Measures emotional connection, energy quality, and psychological engagement with work.",
  "scoringOptions": [
    {
      "option": "a",
      "score": 100,
      "text": "I feel energized — work stretches me in meaningful ways.",
      "depiction": "Work challenges you in the right ways — your emotional energy is aligned and thriving.",
      "title": "Your Work Energizes You — That's a Competitive Advantage Most People Don't Have",
      "archetype": "The Energized Performer",
      "keyInsight": "The fact that your work stretches you in meaningful ways is one of the strongest positive career signals.\n\nMost professionals operate in:\n ✓ Efficiency mode (doing what they must)\n ✓ Survival mode (avoiding burnout)\n ✓ Autopilot mode (minimal emotional engagement)\n\nBut you are operating in Growth Mode:\n✔ You feel challenged\n✔ You feel useful\n✔ You feel alive in what you do\n\nThis tells us that:\n ✓ You are in the right arena\n ✓ Your skills are being recognized\n ✓ Your role has room to evolve\n\nYou're not just working hard — you're growing while performing.\n\nThat combination accelerates careers faster than qualifications ever can.\n\nMonetization & Impact Signal\n\nThis level of positive emotional connection can be leveraged into:\n✔ Bigger roles where your energy scales results\n✔ Leadership paths where you influence people, not just tasks\n✔ High-value opportunities where passion and purpose translate into visibility and income\n\nYour next career breakthrough will come from showcasing this energy —\nnot hiding it behind routine deliverables.\n\nYour Digital Twin helps amplify your emotional strengths by:\n ✓ Mapping where your motivation has the highest ROI\n ✓ Providing data-driven narratives to position your unique value\n ✓ Helping you build a personal brand around authentic contribution — not noise\n\nThis is how professionals with energy turn into professionals with impact.\n\nFuture-You Guidance\n\nYour emotional drive is your differentiator.\n\nIf nurtured well, it becomes your leadership identity.\n\nThe Gold Program is ideal at this stage —\nhelping you channel your strong emotional connection into:\n ✓ Rapid growth visibility\n ✓ Stronger influence\n ✓ More meaningful, high-impact work\n\nThis is not about working more —\nit's about being seen more for the work you already care about.\n\nNow that we understand what energizes you,\nnext we assess whether your weekly workload supports your long-term growth.",
      "growthBlocker": "Over-stimulation",
      "hiddenStrength": "Vitality and emotional fuel",
      "hiddenDesire": "Mastery and continuous growth",
      "futureArchetype": "Someone who thrives in high-growth environments",
      "microActions": {
        "hours24": "Document a recent moment at work where you felt proud — and why it mattered.",
        "days7": "Share one outcome from that moment with a leader or peer (visibility matters).",
        "days30": "Step into one initiative where your energy can influence others — not just your tasks."
      }
    },
    {
      "option": "b",
      "score": 90,
      "text": "I feel engaged but wish my emotional connection was deeper.",
      "depiction": "You're engaged, but you want a deeper emotional reward from what you contribute.",
      "title": "You're Engaged — But You Know There's a Deeper Level Waiting",
      "archetype": "The Under-Connected Achiever",
      "keyInsight": "You show up with interest and diligence.\n\nYou care about your work.\n\nYou make progress.\n\nBut there is a gap —\nbetween doing well and feeling deeply fulfilled.\n\nThis usually happens when:\n ✓ Your strengths are being used, but not fully expressed\n ✓ Your role has meaning, but not enough identity connection\n ✓ You're contributing, but not in ways that feel personal\n\nIt's like running with the brakes slightly pressed.\n\nYou're moving — just not at your true pace.\n\nMonetization & Impact Signal\n\nYour opportunity now is to elevate what's already working:\n✔ Take on tasks that reflect more of who you are\n✔ Lean into areas that give you pride and visibility\n✔ Expand scope toward outcomes you emotionally care about\n\nSustained emotional connection leads to:\n ✓ Faster recognition\n ✓ Better negotiation power\n ✓ More meaningful work portfolios\n\nYour Digital Twin helps you:\n ✓ Identify where stronger emotional investment = stronger career acceleration\n ✓ Design a path where passion and profession reinforce each other\n ✓ Position your strengths to be seen and valued at the right level\n\nDeep engagement isn't a luxury —\nit's a growth multiplier.\n\nFuture-You Guidance\n\nYou are closer than most to meaningful alignment —\nyou just need to turn up the volume on what sparks you.\n\nThe Silver Program supports professionals at this exact stage —\nhelping them deepen emotional connection to their strengths\nand convert that into clearer impact and career lift.\n\nNow, let's see if your weekly energy supports this next stage of emotional upgrade.",
      "growthBlocker": "Emotional undernourishment",
      "hiddenStrength": "Resilience and consistency",
      "hiddenDesire": "Connection and emotional fulfilment",
      "futureArchetype": "Someone seeking authenticity and emotional alignment",
      "microActions": {
        "hours24": "Write down one part of your work you wish you could do more of.",
        "days7": "Proactively request a responsibility shift toward that area.",
        "days30": "Showcase progress — results build momentum and visibility."
      }
    },
    {
      "option": "c",
      "score": 80,
      "text": "I feel neutral — work gets done, but it doesn't move me.",
      "depiction": "You're performing well, but the emotional spark isn't consistently there.",
      "title": "Your Work Gets Done — But It Doesn't Do Much for You",
      "archetype": "The Neutral Operator",
      "keyInsight": "You're consistent.\n\nYou deliver.\n\nYou meet expectations.\n\nBut emotionally, work feels like execution — not expression.\n\nThis usually indicates:\n ✓ You are operating within your capability, not stretching it\n ✓ Your strengths are being used functionally, not strategically\n ✓ You're contributing, but the work doesn't feel like it's shaping your future\n\nYou're not disconnected — but you're not excited either.\n\nYou're in the Neutral Zone.\n\nThe risk?\n\nNeutrality slowly dims ambition.\n\nNot because you don't care — but because there's nothing fueling you.\n\nMonetization & Impact Signal\n\nThis is the right time to upgrade your role from functional contribution to value creation:\n✔ Identify tasks that allow ownership and thinking\n✔ Shift from doer to decision-influencer\n✔ Bring ideas that define how work should be done, not just what\n\nThat's where:\n ✓ Recognition starts appearing\n ✓ Income potential grows\n ✓ Career momentum restarts\n\nYour Digital Twin helps you:\n ✓ Spot hidden strengths that deserve more room\n ✓ Reframe your contribution into a visible value story\n ✓ Build a pathway to work that energizes, not drains\n\nNeutral can become powerful — if redirected intentionally.\n\nFuture-You Guidance\n\nYou're capable of more — and you know it.\n\nThis is the moment to insert your identity back into your work.\n\nThe Silver Program is ideal here —\nsupporting you in turning routine responsibilities into recognition and growth triggers.\n\nNext, we assess whether your weekly energy and workload is supporting growth — or gradually limiting it.",
      "growthBlocker": "Monotony and routine",
      "hiddenStrength": "Functional efficiency",
      "hiddenDesire": "Activation and inspiration",
      "futureArchetype": "Someone seeking emotional fulfillment",
      "microActions": {
        "hours24": "Write one change that would make your work feel more meaningful.",
        "days7": "Propose or initiate a small improvement that solves a problem others ignore.",
        "days30": "Showcase one value-adding outcome that shifts how people see your role."
      }
    },
    {
      "option": "d",
      "score": 70,
      "text": "I feel emotionally distant — like I'm watching myself work.",
      "depiction": "You show up, but you feel disconnected — like your heart and your work are separate.",
      "title": "You're Doing the Work — But You're No Longer in the Story",
      "archetype": "The Detached Executor",
      "keyInsight": "You're present…\nbut not truly in it.\n\nWork is happening around you, not through you.\n\nThis indicates a deeper emotional disconnect:\n ✓ The job is no longer shaping your identity\n ✓ Contribution feels transactional, not meaningful\n ✓ You're functioning more from obligation than purpose\n\nThis is not laziness or a lack of ambition.\n\nIt's a sign your internal standards have evolved faster than your role.\n\nYou've outgrown the story you're currently in.\n\nMonetization & Impact Signal\n\nThis is the right moment to reclaim ownership of your future direction.\n\nOpportunities unlock when:\n✔ You re-introduce your strengths into decision-making\n✔ You align tasks with areas where you feel your impact\n✔ You build visibility around what still matters to you\n\nYour Digital Twin helps you:\n ✓ Reconnect work with your identity and long-term meaning\n ✓ Find opportunities where you're not just executing — you're influencing\n ✓ Create a role narrative that feels like a chapter worth living\n\nEmotional distance is often the first sign of a needed transition.\n\nFuture-You Guidance\n\nYou deserve a career where you feel involved — not just employed.\n\nYour next chapter should reflect who you're becoming, not who you were.\n\nThe Gold Program is designed for this transition —\nhelping you regain emotional connection while upgrading your professional trajectory.\n\nNot by forcing passion —\nbut by reconnecting you with work that feels like you.\n\nNow, let's examine whether your energy reserves support the change your future self is asking for.",
      "growthBlocker": "Identity detachment",
      "hiddenStrength": "High functional resilience",
      "hiddenDesire": "Re-engagement and participation",
      "futureArchetype": "Someone who feels deeply involved",
      "microActions": {
        "hours24": "Identify one meaningful strength that is currently absent from your work.",
        "days7": "Re-introduce that strength through a task, proposal, or initiative.",
        "days30": "Decide whether this environment can support your evolving needs — or whether a shift is necessary."
      }
    },
    {
      "option": "e",
      "score": 60,
      "text": "I'm productive, but I've lost joy and spark in the process.",
      "depiction": "You're productive, but fulfillment is fading underneath the routine.",
      "title": "You're Performing Well — But the Joy That Once Fueled You Is Fading",
      "archetype": "The Faded Performer",
      "keyInsight": "You're still productive.\n\nYou still care.\n\nYou still show up with competence and commitment.\n\nBut something has changed.\n\nThe spark that once made you excited to contribute…\nhas been replaced with a sense of routine and responsibility.\n\nYou're not disengaged —\nyou're under-inspired.\n\nThis typically means:\n ✓ You've learned the role faster than it has evolved\n ✓ Work feels predictable rather than energizing\n ✓ Personal growth is happening slower than your potential\n\nNothing is \"wrong.\"\n\nBut very little feels truly right either.\n\nMonetization & Impact Signal\n\nThis is the point where people either:\n➡ plateau for years\nor\n➡ upgrade to their next identity level\n\nYour best opportunities right now:\n✔ Move toward responsibilities that challenge your thinking\n✔ Shift into work that has broader impact and visibility\n✔ Connect performance with purpose and recognition\n\nYour Digital Twin supports this shift by:\n ✓ Mapping what type of work will reignite motivation\n ✓ Aligning strengths to higher-value opportunities\n ✓ Building a development plan that returns joy + reward, not just output\n\nThis is about moving from functional success to fulfilling success.\n\nFuture-You Guidance\n\nYou've proven you can deliver.\n\nNow it's time to enjoy delivering again.\n\nThe Gold Program helps you:\n ✓ Reconnect passion to professional growth\n ✓ Rebuild visibility in ways that feel authentic\n ✓ Design work that excites you again — not just occupies you\n\nYour future career should feel alive, not just successful.\n\nNext, we decode whether your weekly workload and energy are helping or hurting your next phase of growth.",
      "growthBlocker": "Routine-driven burnout",
      "hiddenStrength": "Discipline and high performance",
      "hiddenDesire": "Revival",
      "futureArchetype": "Someone whose productivity is matched by passion",
      "microActions": {
        "hours24": "List 2 tasks that feel meaningful when you do them — and why.",
        "days7": "Initiate or request at least one responsibility shift toward those areas.",
        "days30": "Showcase one improvement or initiative that reflects the work you want to be known for.\nYour effort deserves emotional return."
      }
    },
    {
      "option": "f",
      "score": 50,
      "text": "I feel drained — not because of work, but because of constant context switching.",
      "depiction": "Constant switching and juggling are draining your emotional bandwidth.",
      "title": "You're Drained — Not From the Work, But From the Way Work Is Happening",
      "archetype": "The Fragmented Multitasker",
      "keyInsight": "Your energy isn't disappearing because tasks are difficult.\n\nIt's disappearing because your attention is being fragmented all day long.\n\nYou're switching between priorities, messages, expectations, and interruptions…\nand your brain never gets to finish a thought before moving to the next.\n\nThis creates:\n ✓ High output, low satisfaction\n ✓ Effort without the feeling of progress\n ✓ Constant pressure to keep up\n\nYou're not tired of working —\nyou're tired of not getting the space to think.\n\nMonetization & Impact Signal\n\nWhen your work allows deeper focus:\n✔ You produce higher-quality outcomes\n✔ You accelerate success on the critical things\n✔ You strengthen your perceived expertise\n\nYou need fewer tasks —\nand more meaningful ones.\n\nYour Digital Twin helps you:\n ✓ Identify the work that truly deserves your best energy\n ✓ Reorganize responsibilities toward higher-value outcomes\n ✓ Build influence by delivering impact, not volume\n\nBetter focus = stronger recognition = faster career lift.\n\nFuture-You Guidance\n\nYour potential isn't limited —\nyour mental bandwidth is.\n\nOnce you reclaim focus, you'll reclaim your momentum.\n\nThe Silver Program supports this transformation:\n ✓ You redesign where your energy goes\n ✓ You focus on what actually builds your career\n ✓ You create results that protect your time and raise your value\n\nYou perform best when your brain is fully involved —\nnot constantly interrupted.\n\nNext, we assess whether your weekly workload reality is sustainable —\nor signaling the need for a new operating system.",
      "growthBlocker": "Lack of protected focus",
      "hiddenStrength": "Adaptability",
      "hiddenDesire": "Coherence",
      "futureArchetype": "Someone who feels mentally lighter and centred",
      "microActions": {
        "hours24": "Block one uninterrupted 60-minute focus sprint for a high-value task.",
        "days7": "Reduce or hand off one low-value recurring task that drains attention.",
        "days30": "Create a weekly \"Deep Thinking Zone\" where you work only on outcomes that shape your future.\nThis shifts you from busy to valuable."
      }
    },
    {
      "option": "g",
      "score": 40,
      "text": "Work feels heavier lately — small things take more emotional effort.",
      "depiction": "Small tasks feel heavier than they should — your emotional capacity is signaling overload.",
      "title": "Work Is Becoming Heavier — That's a Signal, Not a Personal Failure",
      "archetype": "The Emotional Carrier",
      "keyInsight": "You're still delivering.\n\nYou're still showing up.\n\nBut tasks that once felt simple now require extra emotional effort.\n\nThis typically happens when:\n ✓ Internal motivation has dropped faster than workload\n ✓ Your effort no longer feels connected to meaningful progress\n ✓ You're carrying more responsibility than recognition\n ✓ Emotional fatigue is building silently\n\nNothing is \"wrong with you.\"\n\nWhat's happening is friction has increased, and support or inspiration hasn't kept pace.\n\nThis phase often appears right before a major personal growth shift.\n\nMonetization & Career Impact Signal\n\nWhen work feels heavier, it's a sign you need one of two things:\n✔ Redistribution — less noise, more high-value work\n✔ Elevation — bigger roles that offer renewed purpose and influence\n\nThe goal is not to work harder —\nbut to work where your effort creates momentum, not exhaustion.\n\nYour Digital Twin helps you:\n ✓ Separate draining tasks from energizing strengths\n ✓ Show leaders where you add strategic value\n ✓ Design a path to more emotionally sustainable roles\n\nYou deserve work that grows with you — not work you must drag.\n\nFuture-You Guidance\n\nEmotional heaviness is a career signpost —\nit's pointing you toward something that deserves to change.\n\nThe Silver Program focuses exactly on this:\n ✓ Rebalancing emotional effort vs. professional growth\n ✓ Re-energizing your role with purpose and clarity\n ✓ Supporting momentum without overwhelming pressure\n\nBecause success that feels heavy isn't success that lasts.\n\nNext, we decode your energy and workload reality —\nto understand whether your current operating mode is helping or hurting your future success.",
      "growthBlocker": "Emotional saturation",
      "hiddenStrength": "Perseverance",
      "hiddenDesire": "Relief",
      "futureArchetype": "Someone who reclaims emotional agility",
      "microActions": {
        "hours24": "Identify two tasks that drain you the most — label why (ambiguity, repetition, low value, people dynamics).",
        "days7": "Propose solutions to streamline or delegate at least one of them.",
        "days30": "Shift 10–15% of your work time toward tasks that match strengths and meaning — track the improvement.\nSmall workload redesigns prevent long-term burnout."
      }
    },
    {
      "option": "h",
      "score": 30,
      "text": "I feel undervalued or unseen, which affects my energy.",
      "depiction": "Feeling undervalued is costing you energy — recognition matters more than people admit.",
      "title": "Your Energy Drops When Your Contribution Isn't Seen — And That's Completely Valid",
      "archetype": "The Unseen Achiever",
      "keyInsight": "You're not just doing tasks —\nyou're showing up with care, skill, and personal investment.\n\nBut when the visibility doesn't match the effort,\nwhen acknowledgment doesn't reflect contribution,\nmotivation naturally declines.\n\nThis is not sensitivity —\nit's a sign that your strengths are ready to be recognized.\n\nYour performance is exceeding the recognition infrastructure around you.\n\nThis phase usually means:\n ✓ Your impact is real\n ✓ Your voice and value are under-amplified\n ✓ You are operating below your natural influence level\n\nYou don't want applause —\nyou want fairness and visibility.\n\nMonetization & Career Impact Signal\n\nRecognition isn't an ego need —\nit is a career currency.\n\nWhen seen:\n✔ Opportunities appear\n✔ Compensation grows\n✔ Gatekeepers open doors\n\nYour Digital Twin helps you:\n ✓ Build a visibility strategy that reflects your real contribution\n ✓ Showcase your value to decision-makers\n ✓ Position you for roles where recognition is systematic, not accidental\n\nYou deserve to be noticed, not just needed.\n\nFuture-You Guidance\n\nYour energy grows when your impact matters —\nand that's a sign of leadership identity.\n\nThe Gold Program supports you in:\n ✓ Making your value visible\n ✓ Building recognition pathways\n ✓ Increasing your influence footprint\n\nWhen you're seen — you rise.\n\nNext, we'll measure whether your energy system can sustain the future you're building — or needs restructuring immediately.",
      "growthBlocker": "Recognition deficit",
      "hiddenStrength": "Commitment and contribution",
      "hiddenDesire": "Acknowledgement",
      "futureArchetype": "Someone working in an environment where effort is recognized",
      "microActions": {
        "hours24": "Document one tangible result you've driven recently — include outcomes, not just effort.",
        "days7": "Share that result with the right stakeholder (leader, partner team, etc.) in a concise update.",
        "days30": "Take ownership of a contribution area where your name becomes part of the success story.\nVisibility is a skill — and a strategy."
      }
    },
    {
      "option": "i",
      "score": 20,
      "text": "I'm functioning, but I'm on emotional autopilot.",
      "depiction": "You're functioning without presence — habit is replacing motivation.",
      "title": "You're Functioning Well — But Emotionally, You're on Auto-Pilot",
      "archetype": "The Emotional Sleeper",
      "keyInsight": "You are competent.\n\nYou are reliable.\n\nYou are delivering.\n\nBut you're doing it without feeling connected to any of it.\n\nYou're not disengaged enough to crash —\nbut not engaged enough to care deeply.\n\nThis usually happens when:\n ✓ There is no real meaning attached to the work\n ✓ The work doesn't challenge your strengths anymore\n ✓ Success is measured by completion, not fulfillment\n ✓ The job feels like a routine rather than a direction\n\nEmotionally, you're meeting expectations…\nbut not building anything that feels like a future worth getting excited about.\n\nMonetization & Career Impact Signal\n\nAutopilot is the danger zone — not because performance drops,\nbut because ambition slowly fades without you noticing.\n\nThis is the moment to:\n✔ Reconnect to what makes work personally rewarding\n✔ Shift into responsibilities that reflect identity and aspiration\n✔ Build momentum toward growth, not maintenance\n\nYour Digital Twin supports this by:\n ✓ Mapping what energizes vs. what numbs you\n ✓ Re-aligning your strengths with work that matters\n ✓ Giving you a path where results feel personal again\n\nYou deserve progress that feels alive, not just acceptable.\n\nFuture-You Guidance\n\nA successful career without emotional involvement leads to regret later.\n\nIt's time to step back into a role\nwhere your presence makes a difference — not just your effort.\n\nThe Silver Program is designed for exactly this stage:\n ✓ Clarifying your deeper drivers\n ✓ Reconnecting passion and performance\n ✓ Building momentum with fulfillment\n\nYou're capable of more than execution —\nyour work should reflect that.\n\nNext, we'll assess if your energy and workload levels are supporting your comeback —\nor contributing to the emotional flattening.",
      "growthBlocker": "Habit and disengagement",
      "hiddenStrength": "Discipline",
      "hiddenDesire": "Reanimation",
      "futureArchetype": "Someone who works with renewed intentionality",
      "microActions": {
        "hours24": "Write down one professional outcome that would make you feel genuinely proud.",
        "days7": "Incorporate one task or initiative that uses your strengths in a more meaningful way.",
        "days30": "Start building a capability or project that represents the future version of you.\nRe-engagement doesn't require a career change —\nit requires a purpose change."
      }
    },
    {
      "option": "j",
      "score": 10,
      "text": "I feel like I need a reset — emotionally, mentally, or directionally.",
      "depiction": "Your system is asking for a reset — mentally and emotionally you need a new playbook.",
      "title": "You Need a Reset — And That's a Sign of Strength, Not Struggle",
      "archetype": "The Reset Seeker",
      "keyInsight": "Reaching a point where you know something must change is not failure —\nit's awareness.\n\nYou've pushed through challenges.\n\nYou've adapted when needed.\n\nYou've delivered even when motivation wasn't there.\n\nBut now your mind and emotions are sending a clear message:\n\n\"This version of my work life is no longer enough for who I'm becoming.\"\n\nYou're not asking for less —\nyou're asking for better alignment, better energy, and a better future.\n\nThis is a pivot point, not a breakdown.\n\nMonetization & Career Impact Signal\n\nA reset done right positions you for the next level of outcome and fulfillment.\n\nYour strongest opportunities right now:\n✔ Re-evaluate what you truly want your work to stand for\n✔ Redirect effort into roles that renew purpose and visibility\n✔ Leverage strengths in markets or teams that value them more\n\nYour Digital Twin becomes critical here:\n ✓ It clarifies what direction will reignite motivation\n ✓ It helps design an identity-aligned role evolution\n ✓ It accelerates transition with measurable certainty\n\nA planned reset can save years of misaligned effort.\n\nFuture-You Guidance\n\nYou're not stepping back —\nyou're stepping out of a version of work that no longer fits your growth.\n\nThe Gold Program gives you the strategic reset:\n ✓ Clear direction\n ✓ Better energy system\n ✓ Confident transition to your next chapter\n\nNot escape. Evolution.\n\nNow let's evaluate whether your energy and workload reality supports the reset your future self is demanding.",
      "growthBlocker": "Accumulated misalignment",
      "hiddenStrength": "Awareness",
      "hiddenDesire": "Renewal",
      "futureArchetype": "Someone who begins a new chapter with intention and alignment",
      "microActions": {
        "hours24": "Write down what you are no longer willing to tolerate in your work life.",
        "days7": "Identify one meaningful change you can act on — task, team, priority, or environment.",
        "days30": "Start a structured transition path toward a role that reflects the professional you want to become next.\nA reset is an upgrade when you lead it intentionally."
      }
    }
  ]
}
