{
  "questionId": 5,
  "theme": "Energy & Workload Reality",
  "question": "How would you describe your typical weekly energy and workload experience?",
  "indexName": "Sustainable Energy Load Index (SEL Index)",
  "scoreType": "Burnout Risk Score",
  "measure": "Assesses energy rhythm, overload patterns, and burnout thresholds.",
  "scoringOptions": [
    {
      "option": "a",
      "score": 100,
      "text": "Balanced — I end most weeks with fuel left in the tank.",
      "depiction": "Your weekly energy is strong and well-managed — you're working smart, not just hard.",
      "title": "You Manage Your Energy Well — And That Gives You a Real Edge",
      "archetype": "The Balanced Performer",
      "keyInsight": "Ending most weeks with energy left in the tank is not common.\n\nIt shows that you've learned how to work effectively without compromising your wellbeing.\n\nThis signals:\n ✓ You balance intensity and recovery intelligently\n ✓ You pace yourself based on priorities, not pressure\n ✓ You have strong personal boundaries even in demanding environments\n\nThis is a top-5% career advantage, because energy is the currency of progress.\n\nWhile others start Monday still recovering from last week,\nyou arrive ready to move.\n\nMonetization & Career Impact Signal\n\nYou can leverage this energy surplus into:\n✔ Leading strategic initiatives that require stamina and consistency\n✔ Taking ownership roles that elevate your influence\n✔ Stepping into high-visibility contributions that expand your value story\n\nYour weekly energy isn't just a wellness metric —\nit's a career acceleration asset.\n\nYour Digital Twin helps you:\n ✓ Channel your strongest energy windows into high-impact outcomes\n ✓ Avoid energy leaks that don't contribute to your future\n ✓ Scale your strengths without risking burnout\n\nWhen energy meets strategy → growth compounds.\n\nFuture-You Guidance\n\nYou're already operating sustainably.\n\nNow it's time to operate strategically.\n\nThe Gold Program can help you convert your strong energy foundation into:\n ✓ Faster leadership progression\n ✓ Stronger influence and recognition\n ✓ A career that grows without draining you\n\nBecause when your energy is protected, your potential stays unlocked.\n\nNow that we know how your energy works for you —\nwe'll examine your relationship with workplace culture\nand whether the environment supports or restricts your future growth.",
      "growthBlocker": "Complacency",
      "hiddenStrength": "Strong self-regulation",
      "hiddenDesire": "Optimization",
      "futureArchetype": "Someone who elevates performance without sacrificing health",
      "microActions": {
        "hours24": "Identify one outcome you're proud of from the past week — and who should know about it.",
        "days7": "Take on one responsibility that aligns with your long-term growth (not just current tasks).",
        "days30": "Build a rhythm where your highest energy moments are consistently linked to your highest-value work.\nGreat careers are not built by doing more —\nbut by doing the right more."
      }
    },
    {
      "option": "b",
      "score": 90,
      "text": "Manageable — some weeks are heavy, but I recover well.",
      "depiction": "Some weeks are demanding, but you bounce back — resilience is one of your key assets.",
      "title": "You Recover Well — But Your Workload Keeps Testing the Limits",
      "archetype": "The Resilient Balancer",
      "keyInsight": "Your weeks swing between manageable and demanding —\nbut importantly, you bounce back.\n\nThis tells us:\n ✓ You have strong personal resilience\n ✓ You know how to reset and refuel\n ✓ Stress doesn't hold you for long\n\nYou're functional under pressure and functional in recovery —\na powerful capability in today's work environment.\n\nBut there's a hidden risk here:\n\nIf the \"heavy weeks\" start becoming the new normal,\nyour recovery advantage can turn into a drain over time.\n\nYour energy system needs a smarter strategy — not a stronger push.\n\nMonetization & Career Impact Signal\n\nYou are performing well.\n\nNow the priority is to perform without volatility.\n\nYour top opportunities:\n✔ Reduce low-value workload that eats time but builds no future\n✔ Increase work aligned to strategic contributions\n✔ Build influence so your effort creates leverage, not repetition\n\nYour Digital Twin supports you by:\n ✓ Reprioritizing energy toward growth tasks\n ✓ Identifying where your output commands stronger recognition\n ✓ Creating momentum that doesn't reset to zero each Monday\n\nYour energy deserves return on investment, not just recovery.\n\nFuture-You Guidance\n\nYou have the resilience most people wish they had.\n\nNow it's time to let that resilience fuel your rise, not just your survival.\n\nThe Silver Program is tuned for exactly this stage —\nhelping you:\n ✓ Strengthen systems that protect energy\n ✓ Increase output that builds future opportunity\n ✓ Create consistency in visibility and progress\n\nBecause your career shouldn't depend on how heavy the week is —\nit should depend on how strong you are becoming.\n\nNext, we'll decode how well your workplace culture supports the growth your energy system is ready for.",
      "growthBlocker": "Unpredictability",
      "hiddenStrength": "Elasticity and adaptability",
      "hiddenDesire": "Consistency",
      "futureArchetype": "Someone who maintains high performance without absorbing unnecessary volatility",
      "microActions": {
        "hours24": "Identify one recurring task that drains time but adds minimal value.",
        "days7": "Redesign, automate, or renegotiate that task — even partially.",
        "days30": "Shift saved time into high-visibility work that strengthens your reputation.\nThis is how you convert effort into influence."
      }
    },
    {
      "option": "c",
      "score": 80,
      "text": "Variable — energy swings depending on tasks or people.",
      "depiction": "Your energy shifts depending on tasks and people — you perform best in the right environment.",
      "title": "Your Energy Swings — Because Your Work Experience Is Uneven",
      "archetype": "The Sensitive High-Performer",
      "keyInsight": "Some weeks, you feel strong and motivated.\n\nOther weeks, the same job feels draining.\n\nThis inconsistency usually means:\n ✓ Your energy depends too much on the type of task\n ✓ Certain people or environments unlock your best\n ✓ Other dynamics interrupt your flow or confidence\n ✓ Emotional effort changes more than workload does\n\nYou don't have an energy problem.\n\nYou have a work design problem.\n\nYour strengths are currently used situationally, not systematically.\n\nMonetization & Career Impact Signal\n\nYour goal now is to increase the percentage of work that brings out your best.\n\nYou rise fastest when:\n✔ You focus on strengths that energize you\n✔ You reduce exposure to friction-heavy responsibilities\n✔ You choose environments where collaboration fuels you\n\nYour Digital Twin helps by:\n ✓ Pinpointing what tasks, people, and settings amplify vs. drain you\n ✓ Designing a role evolution where your best performance becomes the default\n ✓ Building influence in areas where your strengths clearly shine\n\nStable energy = stable progress — and stronger visibility.\n\nFuture-You Guidance\n\nYour fluctuating energy is not random —\nit's a diagnostic of what your career needs next.\n\nOnce you re-architect your work around energizing strengths,\nyou will see more consistent results and faster growth.\n\nThe Gold Program supports:\n ✓ Energy-driven role redesign\n ✓ Stronger self-advocacy and visibility\n ✓ A more predictable path to long-term career elevation\n\nYour strengths deserve consistency — not chance.\n\nNext, we explore whether your workplace culture is helping or inhibiting the kind of work that keeps you energized.",
      "growthBlocker": "Inconsistency",
      "hiddenStrength": "Self-awareness",
      "hiddenDesire": "Stability",
      "futureArchetype": "Someone who consciously selects energizing environments and tasks",
      "microActions": {
        "hours24": "Note 3 recent tasks that energized you vs. 3 that drained you.",
        "days7": "Shift at least 1 draining task toward efficiency or collaboration.",
        "days30": "Increase your time in energizing work by 10–15% — measurable shift, measurable progress.\nEven small redistributions create major improvements in career velocity."
      }
    },
    {
      "option": "d",
      "score": 70,
      "text": "Sustained pressure — doable but tiring.",
      "depiction": "You're under sustained pressure — still in control, but it's costing you more effort.",
      "title": "You're Operating Under Sustained Pressure — And It's Starting to Show",
      "archetype": "The Endurance Worker",
      "keyInsight": "You're holding it together.\n\nDeadlines are met.\n\nExpectations are managed.\n\nPerformance remains steady.\n\nBut the effort required keeps increasing.\n\nThis tells us:\n ✓ The role depends heavily on your reliability\n ✓ The workload is rising faster than support or structure\n ✓ You are spending more time absorbing pressure than expanding potential\n\nYou're coping well —\nbut coping is not the same as growing.\n\nIf this continues unchecked,\npressure can slowly replace motivation.\n\nMonetization & Career Impact Signal\n\nThis is the moment to shift from being the pressure-absorber to the pressure-director.\n\nYour opportunity now:\n✔ Move from execution to shaping priorities\n✔ Reallocate energy toward strategic contributions\n✔ Create leverage — systems, delegation, influence\n\nProgress shouldn't depend on how much you can carry.\n\nIt should depend on how well you position yourself.\n\nYour Digital Twin supports you by:\n ✓ Identifying where your effort is undervalued\n ✓ Showing which strengths belong in higher-impact spaces\n ✓ Building a roadmap that reduces pressure while increasing recognition\n\nYour time and energy must create future returns, not just survival.\n\nFuture-You Guidance\n\nYour capability is already proven.\n\nNow the goal is to use your capability in a way that expands, not exhausts.\n\nThe Platinum Program aligns perfectly for this phase —\nhelping you:\n ✓ Build authority around critical outcomes\n ✓ Grow your role while reducing unnecessary load\n ✓ Transition toward influence-driven advancement\n\nYour career deserves a future where success feels sustainable.\n\nNext, we'll decode how your workplace culture supports or strains your ability to thrive — emotionally and strategically.",
      "growthBlocker": "Lack of recovery cycles",
      "hiddenStrength": "Endurance",
      "hiddenDesire": "Relief",
      "futureArchetype": "Someone who performs at high level while maintaining emotional spaciousness",
      "microActions": {
        "hours24": "Pinpoint one recurring responsibility that needs either support or redesign.",
        "days7": "Propose a small operational improvement or distribution change.",
        "days30": "Shift 10% of your work into tasks that influence what gets done — not just doing it yourself.\nThis is how you move from pressure-taker to decision-maker."
      }
    },
    {
      "option": "e",
      "score": 60,
      "text": "Always 'on' — difficult to disconnect fully.",
      "depiction": "It's hard to switch off — work mentally follows you everywhere.",
      "title": "You're Always 'On' — And That's Not Sustainable, Even for High Performers",
      "archetype": "The Perpetual Performer",
      "keyInsight": "You handle responsibility well.\n\nYou are dependable.\n\nPeople know you will deliver.\n\nBut the issue isn't the work —\nit's the constant accessibility that comes with it.\n\nYour brain is never fully off duty:\n ✓ Work thoughts follow you home\n ✓ Notifications become interruptions\n ✓ Recovery time gets squeezed\n ✓ Boundaries blur without permission\n\nYou're not burning out —\nbut you're heading in that direction unless the system resets.\n\nMonetization & Career Impact Signal\n\nBeing \"always available\" is not a promotion strategy —\nit's a visibility trap.\n\nYou become known as:\n ✓ The fixer\n ✓ The responder\n ✓ The reliable one\n\nBut not as:\n ✓ The strategist\n ✓ The innovator\n ✓ The leader\n\nYour Digital Twin helps you:\n ✓ Redesign where and when your value is delivered\n ✓ Shift perception: from \"always here\" to \"high-impact presence\"\n ✓ Protect energy so you can do work that advances your career\n\nYour worth is not measured by hours —\nbut by value creation.\n\nFuture-You Guidance\n\nYour next career level requires space to think, build, and lead.\n\nBeing constantly \"on\" keeps you busy —\nbut it slows your rise.\n\nThe Gold Program is built for professionals like you:\n ✓ High responsibility\n ✓ High standards\n ✓ High potential\n\n…and a need for sustainable success systems.\n\nYou deserve to deliver impact — without sacrificing yourself.\n\nNow that we understand your energy load,\nwe'll analyze whether your culture enables the boundaries and growth you need next.",
      "growthBlocker": "Emotional vigilance",
      "hiddenStrength": "Dedication",
      "hiddenDesire": "Mental freedom",
      "futureArchetype": "Someone who works in cycles — intense when needed, fully off when not",
      "microActions": {
        "hours24": "Turn off one non-critical notification block for a focused work sprint.",
        "days7": "Set a clear daily \"shutdown ritual\" for work — same time, consistent routine.",
        "days30": "Schedule weekly focus blocks for strategic outcomes — not reactive tasks.\nYou can't elevate if you're always responding."
      }
    },
    {
      "option": "f",
      "score": 50,
      "text": "Overextended — I manage, but barely.",
      "depiction": "You're carrying too much — you manage, but recovery is almost nonexistent.",
      "title": "You're Managing More Than You Should — And It's Starting to Cost You",
      "archetype": "The Overloaded Executor",
      "keyInsight": "You are holding things together that were meant for multiple people.\n\nYou don't drop the ball — even when you're juggling too many.\n\nThis indicates:\n ✓ You have strong ownership and accountability\n ✓ You absorb gaps that the system fails to handle\n ✓ You protect outcomes even when support is limited\n\nBut when someone is \"barely managing,\"\nit means the load is exceeding the role.\n\nThat's when careers become draining instead of rewarding.\n\nMonetization & Career Impact Signal\n\nTaking on more does not automatically lead to advancement.\n\nOften it leads to:\n ✓ Hidden success\n ✓ Invisible effort\n ✓ Limited recognition\n\nIt's time to convert responsibility into leverage.\n\nYour Digital Twin supports you by:\n✔ Identifying responsibilities that reinforce your future role\n✔ Helping you negotiate workload vs. value\n✔ Building visibility around outcomes you already own\n\nThe question isn't whether you can handle more —\nit's whether doing so advances your future.\n\nFuture-You Guidance\n\nYour strength is clear —\nnow it needs to be recognized and rewarded, not consumed.\n\nThe Silver Program supports this shift:\n ✓ From overload to influence\n ✓ From silent contribution to visible leadership\n ✓ From surviving expectations to shaping them\n\nYou deserve a structure that lifts you — not one you must carry alone.\n\nNext, we look at workplace culture —\nwhether the environment supports your growth or relies unfairly on your extra effort.",
      "growthBlocker": "Depletion",
      "hiddenStrength": "Resilience",
      "hiddenDesire": "Relief",
      "futureArchetype": "Someone who operates from strength, not survival",
      "microActions": {
        "hours24": "List the top 2 responsibilities you should not be owning anymore.",
        "days7": "Delegate, automate, or clarify ownership for one of them.",
        "days30": "Reposition yourself in areas where effort is rewarded with growth.\nYou can't elevate if you're buried."
      }
    },
    {
      "option": "g",
      "score": 40,
      "text": "Mentally overloaded — too many tasks, not enough space.",
      "depiction": "Mental overload is blocking performance — there's too much on your plate to think deeply.",
      "title": "Your Mind Is Overloaded — Not Your Capability",
      "archetype": "The Overloaded Thinker",
      "keyInsight": "You're not struggling with the work itself —\nyou're struggling with the volume of decisions, priorities, and mental switching required daily.\n\nYou're capable, intelligent, and outcome-oriented.\n\nBut too many simultaneous demands cause:\n ✓ Cognitive fatigue\n ✓ Reduced strategic thinking time\n ✓ Increased mistakes or frustrations\n ✓ Less satisfaction from completed work\n\nThis isn't a performance issue —\nit's a mental bandwidth crisis.\n\nGreat performers burn out mentally long before they burn out physically.\n\nMonetization & Career Impact Signal\n\nYour next level is not about effort —\nit's about clarity and focus.\n\nYou rise faster when:\n✔ You operate in defined priorities\n✔ You reduce complexity in your workflow\n✔ You reserve energy for strategic contributions\n\nYour Digital Twin helps you:\n ✓ Identify high-impact zones where your thinking creates value\n ✓ Build focus habits that accelerate results\n ✓ Streamline decision-making so your brain performs at peak levels\n\nYou already think like a leader —\nyou just need the space leaders get.\n\nFuture-You Guidance\n\nYour professional value lies in your thinking ability —\nnot in your tolerance for chaos.\n\nThe Gold Program supports exactly this shift:\n ✓ From mental overload to mental optimization\n ✓ From scattered priorities to strategic impact\n ✓ From constant churn to visible advancement\n\nYour mind deserves an environment where it can perform, not just endure.\n\nNext, we decode whether your workplace culture is enabling clarity —\nor adding noise to your potential.",
      "growthBlocker": "Cognitive clutter",
      "hiddenStrength": "Perseverance",
      "hiddenDesire": "Mental decluttering",
      "futureArchetype": "Someone who operates with sharper focus and fewer tabs open",
      "microActions": {
        "hours24": "Eliminate or simplify one decision you make daily (templates, automation, pre-decisions).",
        "days7": "Reorganize your tasks into focus blocks instead of constant switching.",
        "days30": "Increase time spent in thinking + influence work by at least 10–20%.\nClearer mind → higher impact → faster growth."
      }
    },
    {
      "option": "h",
      "score": 30,
      "text": "Physically exhausted — my body feels the strain before my mind does.",
      "depiction": "Your body feels the strain before your mind does — stress is becoming physical.",
      "title": "Your Body Is Saying What Your Mind Has Been Ignoring",
      "archetype": "The Drained Achiever",
      "keyInsight": "You're pushing through —\nshowing commitment, resilience, and strong accountability.\n\nBut your body is absorbing the consequences:\n ✓ Fatigue hits earlier\n ✓ Recovery takes longer\n ✓ Stress shows up physically\n ✓ Motivation drops when energy drops\n\nThis isn't about weakness.\n\nIt's about biology.\n\nWhen physical energy declines, it's a clear sign that:\n ✓ Workload + stress ≠ Sustainable performance\n ✓ The system expects more than the body can replenish\n ✓ You're operating beyond healthy boundaries\n\nThe danger is not burnout —\nit's burnout disguised as dedication.\n\nMonetization & Career Impact Signal\n\nIf your body can't sustain your ambition,\nyour career trajectory slows — even with strong talent.\n\nYour opportunity now:\n✔ Redesign your workday around strength peaks\n✔ Prioritize high-impact tasks when energy is strongest\n✔ Reduce obligations that don't contribute to future success\n\nYour Digital Twin helps you:\n ✓ Integrate health with high performance\n ✓ Map your physical energy patterns to your career goals\n ✓ Build routines that improve performance instead of draining it\n\nStrong careers need strong foundations.\n\nFuture-You Guidance\n\nYour capabilities are high —\nnow your environment must support your physical wellbeing too.\n\nThe Silver Program helps you:\n ✓ Create a healthy performance rhythm\n ✓ Strengthen energy infrastructure\n ✓ Enable growth that your body can sustain\n\nYou deserve progress that doesn't come at the cost of your health.\n\nNext, we assess whether your workplace culture enables or restricts a sustainable, growth-oriented environment.",
      "growthBlocker": "Somatic fatigue",
      "hiddenStrength": "Mental durability",
      "hiddenDesire": "Restoration",
      "futureArchetype": "Someone who honours their physiology as much as their ambition",
      "microActions": {
        "hours24": "Commit to one non-negotiable recovery routine: sleep, hydration, sunlight, or movement.",
        "days7": "Delegate or decline one low-value activity that drains physical capacity.",
        "days30": "Introduce a weekly recharge ritual that reinforces health and performance.\nEnergy is not a luxury.\nIt is the fuel for your future."
      }
    },
    {
      "option": "i",
      "score": 20,
      "text": "Running on reserve energy — recovery isn't happening.",
      "depiction": "You're running on reserve fuel — rest isn't restoring you anymore.",
      "title": "You're Running on Reserve Energy — That's a Warning Sign, Not a Weakness",
      "archetype": "The Reserve Runner",
      "keyInsight": "You are still delivering.\n\nYou still push through.\n\nYou keep operating even when the tank is almost empty.\n\nBut there's a cost:\n ✓ Recovery isn't happening\n ✓ Rest doesn't feel restorative\n ✓ You start each week already behind on energy\n\nThis is the stage where strong performers often ignore the signs —\nuntil performance, health, or motivation drops suddenly.\n\nYour body is signaling what your role hasn't acknowledged yet:\n\n\"Support and sustainability are missing.\"\n\nMonetization & Career Impact Signal\n\nIf the system continues like this, your capability may remain high —\nbut your output and visibility will decline.\n\nYour opportunity now is to:\n✔ Reclaim capacity through better boundaries\n✔ Prioritize value-driven work over volume\n✔ Re-negotiate responsibilities based on actual impact\n\nYour Digital Twin helps you:\n ✓ Identify where energy is leaking without career return\n ✓ Shift workload into areas that accelerate growth\n ✓ Build a sustainable system where success doesn't drain you\n\nA long-term career cannot be powered by leftover energy.\n\nFuture-You Guidance\n\nYour resilience has carried you far.\n\nBut to go further, you need a structure that supports you —\nnot one that drains you.\n\nThe Silver Program is designed for this exact scenario:\n ✓ Rebalancing your workload\n ✓ Strengthening your energy system\n ✓ Ensuring that career progress doesn't compromise your health\n\nYou deserve success that doesn't cost your wellbeing.\n\nNow, let's see whether the culture around you is enabling or exhausting your potential —\nbecause environment is a major driver of energy.",
      "growthBlocker": "Lack of restoration cycles",
      "hiddenStrength": "Survival strength",
      "hiddenDesire": "Replenishment",
      "futureArchetype": "Someone who rebuilds energy faster than they deplete it",
      "microActions": {
        "hours24": "Commit to one non-negotiable renewal ritual (sleep, walk, stretch, reflection time).",
        "days7": "Say \"no\" or \"not now\" to one commitment that doesn't advance your growth.",
        "days30": "Shift 10–20% of your weekly effort into growth-oriented tasks that give energy back.\nEnergy protection = career protection."
      }
    },
    {
      "option": "j",
      "score": 10,
      "text": "In burnout zone — I'm functioning but emotionally depleted.",
      "depiction": "You're in burnout territory — functioning on the outside, depleted on the inside.",
      "title": "You're Still Performing — But Emotionally, You're Already in Burnout Territory",
      "archetype": "The Burnout Survivor",
      "keyInsight": "You're functioning.\n\nYou're delivering.\n\nPeople may not even notice anything is wrong.\n\nBut inside, the emotional cost has reached a critical point.\n\nThis stage shows:\n ✓ High resilience but zero recovery\n ✓ Strong responsibility but declining motivation\n ✓ Work happening without any internal reward\n ✓ Disconnection from meaning, pride, and growth\n\nThis is where people often say:\n\n\"I'm doing everything right… so why does it feel so wrong?\"\n\nBecause your system has been in overdrive too long.\n\nMonetization & Career Impact Signal\n\nBurnout doesn't just harm health — it slows future opportunity.\n\nYour capability is not the issue.\n\nYour capacity has been exhausted.\n\nTo protect your long-term career:\n✔ Work must shift to where energy returns, not disappears\n✔ Responsibilities must align to strengths and motivation\n✔ Support, visibility, and prioritization must improve\n\nYour Digital Twin helps you:\n ✓ Remove low-value strain that brings no growth\n ✓ Focus on contributions that matter and energize\n ✓ Build a career runway that doesn't require emotional sacrifice\n\nYou must recover before you reinvent, or progress won't last.\n\nFuture-You Guidance\n\nYou've been strong for too long without enough support.\n\nNow the focus must be:\n ✓ Repair\n ✓ Reset\n ✓ Redesign\n\nThe Platinum Program is specifically built for high performers at this stage:\n ✓ Strategic role redesign\n ✓ Support systems that protect emotional and mental energy\n ✓ Transition to work that lifts you, not drains you\n\nYou've proven you can endure anything.\n\nNow let's help you thrive again.\n\nNext, we decode Workplace Culture —\nbecause the environment you operate in significantly determines whether you recover or relapse.",
      "growthBlocker": "Emotional burnout",
      "hiddenStrength": "Grit",
      "hiddenDesire": "Reset",
      "futureArchetype": "Someone who operates with renewal, strength, and emotional alignment",
      "microActions": {
        "hours24": "Block 30 minutes for personal reset — reflection, breath, or just stillness.",
        "days7": "Communicate one boundary — time, priorities, or communication limits.",
        "days30": "Shift at least 15% of your work into tasks that give you a sense of progress or recognition.\nThis isn't slowing down —\nit's preventing collapse so you can accelerate again."
      }
    }
  ]
}
