{
  "questionId": 9,
  "theme": "Emotional Readiness for Reinvention",
  "question": "How emotionally ready are you for reinvention or transformation?",
  "indexName": "Reinvention Readiness Index (RRI)",
  "scoreType": "Transformation Readiness Score",
  "measure": "Evaluates emotional and psychological openness to change, risk tolerance, and growth mindset.",
  "scoringOptions": [
    {
      "option": "a",
      "score": 100,
      "text": "Excited — I'm ready to leap into what's next.",
      "depiction": "You're already evolving faster than your environment — future-ready and proactive.",
      "title": "You're Excited — You're Ready to Leap into What's Next",
      "archetype": "The Strategic Reinventer",
      "keyInsight": "This is a powerful signal of future readiness. You're not waiting for permission. You're prepared to evolve.\n\nExcitement means:\n✓ You already see opportunities others overlook\n✓ You trust your ability to adapt and learn\n✓ You are mentally prepared to shift from execution to creation\n\nThis mindset is the foundation of breakout career acceleration.\n\nHowever, excitement without direction can lead to:\n• Jumping too fast into roles that don't scale your strengths\n• Momentum that isn't monetized\n• Growth that feels good now but plateaus later\n\nYour next level demands structured expansion, not random leaps.\n\n**What This Reveals About You**\n\nYou are future-positive and confident in your potential. Your identity has matured — now it wants:\n✔ Bigger canvas\n✔ Strategic autonomy\n✔ Roles that multiply impact, not just increase workload\n\nYou're not just changing jobs — you're upgrading your value.\n\n**How the Digital Twin Accelerates Reinvention**\n\nThe Digital Twin transforms future readiness into tangible advantage:\n• Maps your growth trajectory with AI-backed benchmarking\n• Positions you for roles that value your unique future strengths\n• Converts your excitement into strategic leverage\n• Ensures your jump leads to higher fulfillment + higher growth + higher income\n\nIt becomes your launch control system for the leap you're already ready for.\n\n**Best-Fit Program Recommendation**\n\nYour mindset right now matches the **Gold Program** perfectly:\n• It accelerates reinvention with a guided roadmap\n• Builds your professional narrative for bigger opportunities\n• Ensures your leap is strategic, not experimental\n\nYou bring the excitement — we help you turn it into career-defining momentum.\n\nNext, we decode how open you are to emerging possibilities — because excitement is powerful, but adaptability creates results.",
      "growthBlocker": "Excitement without strategic direction",
      "hiddenStrength": "Future-positive mindset and confidence in potential",
      "hiddenDesire": "Structured expansion with bigger canvas and impact",
      "futureArchetype": "Someone who upgrades value, not just changes jobs",
      "microActions": {
        "hours24": "Identify one capability that defines your next professional version — not your current one",
        "days7": "Have one conversation that exposes you to future opportunities (e.g., leader, mentor, potential collaborator)",
        "days30": "Build a visible proof-of-potential — a case story, a prototype, a thought-leadership post, a portfolio upgrade"
      }
    },
    {
      "option": "b",
      "score": 90,
      "text": "Open — I'm curious about what else is possible.",
      "depiction": "You're open to new paths and preparing for transition — curiosity is accelerating you.",
      "title": "You're Open — Curious About What Else Is Possible",
      "archetype": "The Strategic Explorer",
      "keyInsight": "This is a strong and healthy place to be. You're not resisting change… you're exploring it intelligently.\n\nWhat this says about your career mindset:\n✓ You sense that more is available for you\n✓ You're paying attention to opportunities outside your current line of sight\n✓ You are willing to evolve — but only with clarity\n\nThis reflects emotional maturity and strategic optimism.\n\n**The Opportunity in Openness**\n\nWhen someone is open but not fully committed to a direction, the risk is:\n• Staying in reflection mode too long\n• Letting external commitments shape your path by default\n• Exploring broadly but not going deep enough to stand out\n\nYour career growth will accelerate the moment you convert curiosity into a plan.\n\n**How the Digital Twin Supports Your Curiosity**\n\nOur Digital Twin is designed for people exactly in this phase:\n✔ Converts curiosity into a mapped career trajectory\n✔ Shows how your current strengths can open new doors\n✔ Highlights the most rewarding future paths (strategically + financially)\n\nInstead of \"trying things and hoping,\" you get clarity on where your potential has the highest ROI.\n\n**Best-Fit Program Recommendation**\n\nThe **Silver Program** is ideal for you right now — because it:\n• Helps you evaluate options without pressure\n• Translates your interests into practical pathways\n• Gives you structured tools to take smarter, faster decisions\n\nYou stay open — but now with direction and outcomes.\n\nNext, we explore what happens when curiosity turns into a strong inner calling.",
      "growthBlocker": "Reflection mode without deep commitment",
      "hiddenStrength": "Emotional maturity and strategic optimism",
      "hiddenDesire": "Converting curiosity into actionable plan",
      "futureArchetype": "Someone who moves from exploration to strategic execution",
      "microActions": {
        "hours24": "Document 3 types of roles or industries that excite you — without judging the feasibility",
        "days7": "Reach out to one person who is already where you want to be — learn from lived experience",
        "days30": "Prototype your future: work on a mini-project, shadow an expert, or test a new domain through skill-building"
      }
    },
    {
      "option": "c",
      "score": 80,
      "text": "Curious — something bigger feels close, but I'm still exploring.",
      "depiction": "You feel the call to something bigger — reinvention signals are active.",
      "title": "Curiosity Is Pointing You Toward Something Bigger",
      "archetype": "The Emerging Reinventer",
      "keyInsight": "You feel a pull — even if you haven't fully named it yet. This is the early stage of reinvention: your intuition knows something is expanding before your mind fully catches up.\n\nWhat this reveals:\n✓ You've outgrown your current environment in some way\n✓ New insights are emerging from your strengths and lived experiences\n✓ Your career direction is evolving — and that's a positive signal\n\nCuriosity isn't confusion. It's intelligence searching for its next arena.\n\n**The Opportunity in Curiosity**\n\nYour growth edge lies in exploration with structure. The risk right now? Letting curiosity float without converting it into traction.\n\nPeople at this stage often:\n• Consume ideas → but don't test them\n• Feel inspired → but lack a roadmap\n• See possibilities → but struggle to choose\n\nYour future needs experiments, not just thoughts.\n\n**How the Digital Twin Accelerates Your Curiosity**\n\nOur Digital Twin framework helps you:\n✔ Convert vague interest into clear future roles\n✔ Validate which direction gives you the highest outcome\n✔ Avoid detours and years of trial-and-error\n✔ Predict your professional \"next peak\"\n\nYou move from \"I think this could be right…\" to \"I know where I should go next.\"\n\n**Best-Fit Program Recommendation**\n\nThe **Gold Program** fits your stage perfectly:\n• Designed to turn curiosity into career breakthroughs\n• Matches your strengths with high-growth opportunities\n• Provides a 6-week guided transformation into your next level\n\nYou're not just curious — you're getting ready. Let's make sure this interest becomes momentum, not hesitation.\n\nNext, we look at what happens when someone is intentionally building toward reinvention.",
      "growthBlocker": "Curiosity without structured experimentation",
      "hiddenStrength": "Intuitive awareness of expansion potential",
      "hiddenDesire": "Converting curiosity into career breakthrough",
      "futureArchetype": "Someone who predicts and reaches their next peak",
      "microActions": {
        "hours24": "Write down the recurring themes that excite you — skills, industries, topics, problems you want to solve",
        "days7": "Identify one experiment: a course, a gig, a conversation, or a contribution in a space that excites you",
        "days30": "Build evidence — something you can show, not just say. Small prototypes create clarity faster than long reflections"
      }
    },
    {
      "option": "d",
      "score": 70,
      "text": "Preparing — I'm not guessing, I'm actively building toward a leap.",
      "depiction": "You're building toward change, but not consistently yet.",
      "title": "You're Not Guessing — You're Preparing for a Leap",
      "archetype": "The Intentional Transformer",
      "keyInsight": "You're not waiting for change to happen to you — you're building toward it with intention.\n\nThis reflects high future readiness:\n✔ You've developed strengths others rely on\n✔ You've gathered experience that now needs a larger stage\n✔ You're thinking beyond \"next role\" to \"next version of myself\"\n\nThis is the posture of a strategic reinventer — someone who evolves before the environment forces it.\n\n**What This Means for Your Career**\n\nYour confidence isn't accidental — it shows that your progress so far is earned, not lucky.\n\nBut here's the most important signal: You are reaching the point where bigger rooms, bigger challenges, and bigger outcomes should become accessible.\n\nThe risk right now? Not underperformance — but under-visibility.\n\nYou could continue growing… at the same pace. Or… unlock the accelerated lane your readiness has earned.\n\n**How the Digital Twin Helps You Leap Faster**\n\nRight now, your transformation requires precision:\n• The exact role archetypes where you'll thrive\n• How to brand your strengths to attract the right opportunities\n• How to stand out as the obvious choice for leadership roles\n• Data-backed trajectory mapping to avoid wrong turns\n\nOur Digital Twin technology accelerates what you're already doing — it gives your growth direction + speed.\n\n**Best-Fit Program Recommendation**\n\nYou're primed for impact — you just need the stage.\n\nThe **Platinum Leadership Reinvention Program** is designed for people like you:\n• Strategic role mapping for the next 3–5 years\n• Executive branding and visibility pathways\n• Personalized expansion plan powered by AI + coaching\n\nNot about fixing anything that's broken — about scaling what's working.\n\nYou're already preparing. We help you arrive faster.\n\nNext, we decode when someone wants growth but also stability — a very different readiness profile.",
      "growthBlocker": "Under-visibility despite high readiness",
      "hiddenStrength": "Intentional preparation and earned confidence",
      "hiddenDesire": "Accelerated lane with bigger rooms and outcomes",
      "futureArchetype": "Someone who scales what's working to leadership level",
      "microActions": {
        "hours24": "Identify the top 1–2 strengths that will matter most in your NEXT role — not your current one",
        "days7": "Seek a platform to demonstrate readiness — a leadership challenge, a visible contribution, or a new initiative",
        "days30": "Actively build your future-proof profile — a track record aligned with where you want to go, not where you're standing"
      }
    },
    {
      "option": "e",
      "score": 60,
      "text": "Cautiously optimistic — I want change, but stability matters too.",
      "depiction": "You want change, but stability still anchors your decisions.",
      "title": "You're Ready for Change — But Stability Still Matters",
      "archetype": "The Calculated Advancer",
      "keyInsight": "You're open to a new direction… as long as it doesn't jeopardize what you've built.\n\nThat's a very rational stage of growth — especially for high-performers with responsibilities, reputations, or family dynamics to consider.\n\nThis signals:\n✓ You are forward-looking, not stuck\n✓ You want measured progress, not reckless leaps\n✓ You value security and gain — not security vs. gain\n\nYou don't need chaos to evolve. You need calculated advancement.\n\n**Your Reinvention Profile**\n\nThis specific mindset is incredibly valuable because:\n✔ You make better long-term decisions\n✔ You avoid career detours others regret\n✔ You are capable of holding ambition + stability together\n\nWhere many people jump emotionally… you design your next chapter intelligently.\n\nThe opportunity ahead is to upgrade, not disrupt, your life.\n\n**How the Digital Twin Supports You**\n\nPeople at your stage don't need motivation — they need smart modeling:\n• What are your lowest-risk, highest-return next roles?\n• How do you test a new identity without losing stability?\n• What transition timeline protects you financially and emotionally?\n• How do you build a visible track record to support that move?\n\nYour Digital Twin maps your future possibilities before you have to choose one — reducing uncertainty and giving confidence to every step.\n\n**Best-Fit Program Recommendation**\n\nThe **Gold Program** is built for professionals exactly here:\n• Risk-aware reinvention without career disruption\n• Clear future mapping aligned to strengths + stability needs\n• Structured experimentation with accountability\n\nYou've already said \"yes\" to your future — now it's about doing it the smart way.\n\nNext, we decode what happens when the future feels close… but still undefined.",
      "growthBlocker": "Fear of jeopardizing built foundation",
      "hiddenStrength": "Rational, long-term decision-making capability",
      "hiddenDesire": "Upgrade without disruption",
      "futureArchetype": "Someone who designs intelligent next chapters",
      "microActions": {
        "hours24": "List what you want to protect (income, flexibility, reputation, wellbeing)",
        "days7": "Define the top 2 directions that excite you — even if they feel early",
        "days30": "Start exploring one path without leaving the current foundation (e.g., side projects, skill experiments, internal role expansions)"
      }
    },
    {
      "option": "f",
      "score": 50,
      "text": "Uncertain — I sense a shift coming, but the path isn't clear yet.",
      "depiction": "You sense a shift coming but haven't decoded the direction.",
      "title": "You Sense a Shift Coming — But the Path Isn't Clear Yet",
      "archetype": "The Liminal Explorer",
      "keyInsight": "You're aware that the next chapter is forming… but the picture is still partly blurred.\n\nThis is not uncertainty — this is a transition mindset.\n\nPsychologists call this a liminal stage:\n✓ You've grown beyond who you were\n✓ You haven't yet stepped into who you're becoming\n\nThis phase often appears right before major breakthroughs.\n\n**What This Reveals About You**\n\nYou are clearly evolving — your ideas, values, and ambitions are shifting. The only missing piece is structure.\n\nStrength indicators from your choice:\n✔ Curiosity is active\n✔ Identity is expanding\n✔ You feel the limits of the current role\n✔ You know there is \"more\" ahead\n\nYour internal system is asking: \"What exactly should I grow into next?\"\n\nAnd that's a crucial career-defining question.\n\n**How Your Digital Twin Helps**\n\nYou don't need guesses. You need scenario modeling:\n• Which future paths best match your strengths?\n• What capabilities must be built — and in what order?\n• How do you transition without derailing what's already working?\n• What future identity will give meaning + income + momentum?\n\nYour Digital Twin turns possibilities into clear roadmaps, so exploration becomes a confident strategy — not trial and error.\n\n**Best-Fit Program Recommendation**\n\nYou are not lost — you're emerging.\n\nThe **Silver Program** is built for this exact stage:\n• Identity decoding\n• Clarity builder frameworks\n• Pilot projects that test the next version of your career\n\nThis is where ambiguity evolves into opportunity.\n\nNow let's explore the other side of reinvention — when excitement turns into anxiety.",
      "growthBlocker": "Lack of structure in transition",
      "hiddenStrength": "Active curiosity and expanding identity",
      "hiddenDesire": "Clear roadmap from possibilities",
      "futureArchetype": "Someone who confidently navigates emergence into clarity",
      "microActions": {
        "hours24": "Write down 3 career directions that intrigue you — without judging feasibility",
        "days7": "Have one career-expansion conversation (mentor, senior leader, or someone already living a role you admire)",
        "days30": "Prototype your future identity: a task, training, side project, or guided experiment"
      }
    },
    {
      "option": "g",
      "score": 40,
      "text": "Hesitant — the desire to grow is there, but the fear of the unknown is louder.",
      "depiction": "The uncertainty of change is slowing your momentum — clarity must come first.",
      "title": "The Desire to Grow Is There — But the Fear of the Unknown Is Louder",
      "archetype": "The Cautious Evolver",
      "keyInsight": "⚠️ You're ready to evolve — intellectually, emotionally, and professionally. But something inside is holding the brakes: \"What if this move goes wrong?\"\n\nThis fear is not a weakness. It is self-protection at work.\n\nWhen your brain senses uncertainty, it responds with hesitation — even when the future is full of better possibilities.\n\nWhat matters is this: You are not resisting change. You are resisting risk without clarity.\n\n**What This Says About Your Current Stage**\n\n✓ You can see potential ahead, but not the full map\n✓ You worry about losing what you've already built\n✓ You want a better future — without regret later\n✓ You need more evidence that the leap is worth it\n\nThis is a very common inflection point among high-potential professionals right before a major advancement.\n\n**How the Digital Twin Supports You**\n\nFear reduces when clarity increases.\n\nYour Digital Twin helps by:\n• Predicting your future success across different role paths\n• Quantifying risk vs reward based on your strengths\n• Building a transition plan grounded in data\n• Reducing emotional uncertainty through visibility\n\nYou shift from \"What if I make a mistake?\" to \"Now I know my best move.\"\n\n**Best-Fit Program Recommendation**\n\nThe **Gold Program** is designed for your exact stage:\n\nYou don't want blind leaps. You want informed reinvention.\n\nGold gives you:\n• Data-driven transition mapping\n• Strength-monetization strategy\n• Confidence-building action plan\n\nA shift becomes exciting because it is smart.\n\nNext, we'll explore a different emotional tension — wanting change while resisting it at the same time.",
      "growthBlocker": "Fear of risk without clarity",
      "hiddenStrength": "Self-protection and desire for evidence-based decisions",
      "hiddenDesire": "Informed reinvention with reduced uncertainty",
      "futureArchetype": "Someone who makes smart, calculated transitions",
      "microActions": {
        "hours24": "Write one fear and convert it into a question. Example: \"What if I fail?\" → \"What support would I need to succeed?\"",
        "days7": "Map 2–3 future directions and evaluate each using real criteria: growth, income scalability, relevance, personal meaning",
        "days30": "Test one direction with a low-risk experiment: attend a workshop, shadow a role, launch a small challenge"
      }
    },
    {
      "option": "h",
      "score": 30,
      "text": "Torn — part of me wants change, part of me wants stability.",
      "depiction": "Fear vs. potential is a daily tug-of-war — inner friction is high.",
      "title": "Part of You Wants Change — Part of You Wants Stability",
      "archetype": "The Dual-Mind Professional",
      "keyInsight": "You're standing at a crossroads with two strong forces inside you:\n1️⃣ The drive to evolve and step into bigger impact\n2️⃣ The comfort of what is familiar and currently working\n\nThis internal contradiction doesn't mean you're confused — it means you're thinking responsibly.\n\nYou value growth, but not at the cost of losing your foundation.\n\nThis tension often appears when:\n✓ Your role no longer matches your ambition\n✓ But you've invested too much to walk away without certainty\n✓ You don't want to waste potential — or security\n\nThis is the classic Mid-Career Dilemma faced by ambitious talent.\n\n**What This Reveals About You**\n\n✔ You are capable of more\n✔ You know the current version of you has outgrown pieces of your role\n✔ But you want a transition that feels aligned and sustainable\n✔ You're cautious because you've earned too much to start from scratch\n\nYou don't need a leap. You need a guided pivot.\n\n**How the Digital Twin Accelerates This Stage**\n\nYou need clarity that reduces emotional friction:\n\nYour Digital Twin identifies:\n• Which strengths will remain relevant in your pivot\n• Which new capabilities multiply your future worth\n• Which transition routes protect stability while boosting growth\n• The exact confidence-building steps to move forward\n\nYour decision-making becomes evidence-based — not fear-based.\n\n**Best-Fit Program Recommendation**\n\nThis unique tension requires professional reinforcement.\n\nThe **Gold Program** fits perfectly because:\n• It preserves what's working\n• While unlocking what's waiting\n• With a roadmap that de-risks the transition process\n\nYou don't need to choose between growth and stability. You can build a future where you get both.\n\nNow let's decode what happens when changing your career feels overwhelming.",
      "growthBlocker": "Internal contradiction between ambition and security",
      "hiddenStrength": "Responsible thinking and earned foundation",
      "hiddenDesire": "Guided pivot that preserves stability while enabling growth",
      "futureArchetype": "Someone who achieves both growth and stability",
      "microActions": {
        "hours24": "Write down what you want to keep from your current career vs. what you want to change moving forward",
        "days7": "Connect with one person whose career path represents where you want to be next — learn what shifted for them",
        "days30": "Begin a structured capability upgrade tied to your future identity (e.g., industry transition skill, leadership exposure, innovation competence)"
      }
    },
    {
      "option": "i",
      "score": 20,
      "text": "Overwhelmed — I want change, but the uncertainty feels overwhelming right now.",
      "depiction": "Reinvention feels overwhelming — even when dissatisfaction is loud.",
      "title": "You Want Change — But the Uncertainty Feels Overwhelming Right Now",
      "archetype": "The Clarity Seeker",
      "keyInsight": "You're not resisting growth. You're resisting losing control in the process of change.\n\nThis emotional signal is common when:\n✓ You've built solid credibility, and don't want to risk it\n✓ You've seen transitions go wrong for others\n✓ You feel pressure to make the \"right\" move, not just any move\n✓ You don't want to disrupt life outside work\n\nThis is a safety instinct, not a lack of ambition.\n\nAnd acknowledging that fear is actually the first step to moving past it — constructively.\n\n**What This Reveals About You**\n\n✔ You care about long-term outcomes\n✔ You don't want short-term emotions to drive permanent decisions\n✔ You want clarity before action — which is smart\n✔ You want a future that feels secure, meaningful, and financially sound\n\nIn other words: You want change done properly.\n\n**How the Digital Twin Supports You**\n\nThe easiest path becomes visible when you can:\n• Test multiple career futures before choosing\n• Quantify risk vs. reward\n• See how your strengths translate into new spaces\n• Build change that supports your lifestyle priorities\n\nYour Digital Twin does exactly that — it replaces fear-driven guessing with data-driven clarity.\n\nThe message becomes: \"I'm not stepping into the unknown — I'm stepping into a mapped-out future.\"\n\n**Best-Fit Program Recommendation**\n\nTo move beyond overwhelm without rushing decisions, the **Silver Program** is ideal:\n• Strength and purpose alignment\n• Clarity frameworks that reduce anxiety\n• Safe transition-testing pathways\n• Confidence-building guidance\n\nThis helps you shift from \"Change might break things…\" to \"Change can finally build what I truly want.\"\n\nNext, we decode when the need for reinvention is clear — but people don't know where to even begin.",
      "growthBlocker": "Fear of losing control during change",
      "hiddenStrength": "Long-term thinking and desire for proper execution",
      "hiddenDesire": "Change done properly with clarity before action",
      "futureArchetype": "Someone who steps into mapped-out futures with confidence",
      "microActions": {
        "hours24": "Write down the exact sources of your overwhelm (e.g., financial fears, skill gaps, role identity, timing)",
        "days7": "Seek one expert or mentor conversation focused specifically on de-risking transitions",
        "days30": "Test a safe, reversible \"micro move\" — a course, stretch task, or exploratory project — to build confidence through action"
      }
    },
    {
      "option": "j",
      "score": 10,
      "text": "Lost — I know reinvention is necessary, but I don't know where to start.",
      "depiction": "You know change is needed but don't know where to start — stuck at the threshold.",
      "title": "You Know Reinvention Is Necessary — But You Don't Know Where to Start",
      "archetype": "The Roadmap Builder",
      "keyInsight": "This is one of the most important emotional signals in career transformation.\n\nYou're not ignoring the need for change. You fully recognize it.\n\nWhat's missing is a starting point that feels realistic and guided.\n\nProfessionals in this stage usually experience at least one of these:\n✓ You've outgrown your current environment\n✓ Your strengths are undervalued or underutilized\n✓ Your work no longer reflects the identity you want to build\n✓ You're unsure which direction will give the greatest return on effort\n\nThis is NOT a lack of ambition. This is a lack of roadmap clarity.\n\n**What This Says About Your Potential**\n\n✔ You have internal momentum — even if external movement hasn't begun\n✔ You're highly self-aware — you can see your mismatch clearly\n✔ You're willing to act — once the action becomes visible\n✔ You're not afraid of effort — you're afraid of wasted effort\n\nThis means you're at the perfect stage for structured reinvention.\n\n**How the Digital Twin Supports You**\n\nWhen you feel stuck at \"Step Zero\", the Digital Twin gives you:\n• A diagnosis of your unrealized strengths\n• A ranked list of future-fit career pathways\n• Specific capability-building priorities\n• A 24-week transition blueprint so reinvention becomes structured\n\nYou get answers to the question: \"What future is truly worth pursuing?\"\n\nThis is how uncertainty converts into direction.\n\n**Best-Fit Program Recommendation**\n\nAt this stage, you need high-touch guidance and hands-on career engineering.\n\nThe **Platinum Program** is the most suitable because it provides:\n• Deep transformation coaching\n• Transition strategy + monetization roadmap\n• A complete Digital Twin expansion (Skills, Leadership, Commercial Value, Network Strength)\n\nThis isn't about forcing a leap. It's about helping you begin the right leap, backed by clarity and evidence.\n\nFrom here, the next insight is: What does meaningful work look like for you? That's exactly what the next question unlocks.",
      "growthBlocker": "Lack of roadmap clarity and starting point",
      "hiddenStrength": "Self-awareness and internal momentum",
      "hiddenDesire": "Structured reinvention with clear starting point",
      "futureArchetype": "Someone who begins the right leap with clarity and evidence",
      "microActions": {
        "hours24": "Write down what is no longer acceptable in your work and why",
        "days7": "Identify two industries or roles where people like you often transition successfully",
        "days30": "Begin one capability upgrade linked directly to a future professional identity — not the current one"
      }
    }
  ]
}
